[
  {
    "title": "Chaque image décorative est dotée d’une alternative textuelle appropriée.",
    "objectifs": [
      "Éviter aux utilisateurs placés dans des contextes où les images ne sont pas perceptibles (navigateur texte, lecteur d’écran, navigateur avec images désactivées) d’être perturbés par des informations sur des images qui leur sont inutiles.",
      "Fournir aux robots d’indexation uniquement des informations pertinentes."
    ]
  },
  {
    "title": "Chaque image-lien est dotée d’une alternative textuelle appropriée.",
    "objectifs": [
      "Permettre aux utilisateurs placés dans des contextes où les images ne sont pas perceptibles (navigateur texte, lecteur d’écran, navigateur avec images désactivées) de comprendre le sens des liens présents sur des images qu’ils ne peuvent voir.",
      "Permettre aux robots d’exploiter l’information véhiculée par les images-liens (pour le référencement, l’indexation, la traduction automatique des alternatives d’images-texte).",
      "Permettre l’affichage d’un texte pertinent pendant le chargement des images."
    ]
  },
  {
    "title": "Chaque image porteuse d’information est dotée d’une alternative textuelle appropriée.",
    "objectifs": [
      "Permettre aux utilisateurs placés dans des contextes où les images ne sont pas perceptibles (navigateur texte, lecteur d’écran, navigateur avec images désactivées) de comprendre le sens des images qu’ils ne peuvent voir.",
      "Permettre aux robots d’exploiter l’information véhiculée par les images (référencement, indexation, traduction automatique des alternatives d’images-texte).",
      "Permettre l’affichage d’un texte pendant le chargement des images."
    ]
  },
  {
    "title": "Les objets inclus sont dotés d’une alternative textuelle appropriée.",
    "objectifs": [
      "Fournir un accès à l’information pour les utilisateurs dont le navigateur ou la plateforme ne supporte pas l’inclusion d’objets ou les technologies utilisées dans les objets inclus.",
      "Faciliter l’exploitation de ces contenus par les robots (référencement en particulier)."
    ]
  },
  {
    "title": "Les contenus générés via les styles sont dotés d’une alternative appropriée.",
    "objectifs": [
      "Permettre aux utilisateurs placés dans des contextes où les styles ne sont pas restitués (navigateur texte, lecteur d’écran, navigateur avec styles désactivés) d’accéder à l’information présente sous forme de contenus générés en CSS (images d’arrière-plan notamment).",
      "Permettre aux robots d’exploiter l’information véhiculée par les styles CSS (référencement, indexation, traduction automatique des alternatives)."
    ]
  },
  {
    "title": "Les pictogrammes typographiques sont dotés d’une alternative appropriée.",
    "objectifs": [
      "Permettre aux utilisateurs placés dans des contextes où les polices CSS utilisées pour afficher des pictogrammes ne sont pas restituées (navigateur texte, lecteur d’écran, navigateur avec styles désactivés) de comprendre le sens de ces pictogrammes.",
      "Permettre aux robots d’exploiter l’information véhiculée par ces pictogrammes (référencement, indexation, traduction automatique des alternatives)."
    ]
  },
  {
    "title": "Chaque contenu audio et vidéo est accompagné de sa transcription textuelle.",
    "objectifs": [
      "Permettre aux utilisateurs qui ne peuvent accéder au son ou à l’image proposés d’accéder à une transcription textuelle servant d’alternative.",
      "Permettre aux utilisateurs qui ne peuvent accéder au son d’accéder à l’information contenue dans la vidéo.",
      "Permettre l’exploitation de l’information par des robots pour améliorer son indexation et son référencement, ou encore pour permettre sa traduction par des outils linguistiques en ligne."
    ]
  },
  {
    "title": "L’information n’est pas véhiculée uniquement par la couleur.",
    "objectifs": [
      "Permettre l’accès à l’information pour les utilisateurs dont le navigateur, la plate-forme, l’aide technique ou encore le handicap (comme le daltonisme) ne permettent pas de visualiser ou de différencier les couleurs.",
      "Rendre l’information accessible aux robots d’indexation."
    ]
  },
  {
    "title": "Les captchas audio peuvent être réécoutés à volonté.",
    "objectifs": [
      "Faciliter l’accès aux contenus ou services protégés par des captchas pour les utilisateurs ne pouvant exploiter les captchas graphiques.",
      "Faciliter l’utilisation des captchas audio. "
    ]
  },
  {
    "title": "Les captchas sont accompagnés d’une solution alternative d’accès.",
    "objectifs": [
      "Permettre aux utilisateurs qui ont des difficultés à passer les tests des captchas, en particulier graphiques, d’accéder par un autre moyen aux contenus ou services protégés."
    ]
  },
  {
    "title": "Le code source de chaque page débute par une déclaration de type de document dont la syntaxe est conforme à celles recommandées par le W3C.",
    "objectifs": [
      "Faciliter la validation du code source.",
      "Favoriser un rendu prévisible quel que soit le navigateur (des versions de navigateurs encore en circulation sont susceptibles de s’appuyer sur la syntaxe précise de la DTD pour adopter un mode de rendu CSS)."
    ]
  },
  {
    "title": "Chaque identifiant HTML n’est utilisé qu’une seule fois par page.",
    "objectifs": [
      "Éviter les erreurs de restitution du contenu ou d’interaction via les scripts.",
      "Limiter les risques d’interprétation hasardeuse du Document Object Model (DOM) par des agents utilisateurs différents."
    ]
  },
  {
    "title": "Le contenu de chaque page est organisé selon une structure de titres et sous-titres hiérarchisée.",
    "objectifs": [
      "Permettre aux utilisateurs qui le souhaitent de visualiser la structure du contenu de la page et d’y naviguer.",
      "Permettre aux machines et aux outils d’indexation d’extraire le plan de chaque page.",
      "Améliorer le référencement en facilitant l’interprétation du contenu par les robots d’indexation."
    ]
  },
  {
    "title": "Le site n’impose pas de redirection ou de rafraîchissement automatique côté client.",
    "objectifs": [
      "Permettre aux utilisateurs de conserver la maîtrise de leur environnement de travail.",
      "Éviter des coupures ou des pertes d’information en cours de lecture, notamment pour les utilisateurs équipés de lecteurs d’écran qu’un rafraîchissement ou une redirection temporisée interromprait lors de la consultation.",
      "Ne pas pénaliser la consultation du contenu en mobilité lorsque la qualité du réseau est variable sur une courte échelle de temps.",
      "Permettre à l’utilisateur d’éviter un surcroît non désiré de coût d’utilisation des données mobiles."
    ]
  },
  {
    "title": "Les dates sont présentées dans des formats explicites.",
    "objectifs": [
      "Éviter aux utilisateurs les risques de méprise sur le sens d’une date.",
      "Faciliter la compréhension et la réutilisation des contenus concernés."
    ]
  },
  {
    "title": "L’emplacement des blocs de navigation est cohérent dans le code source de toutes les pages.",
    "objectifs": [
      "Faciliter la mémorisation de l’organisation des pages et de la navigation pour les utilisateurs de lecteurs d’écran ou pour ceux qui naviguent au clavier."
    ]
  },
  {
    "title": "Le codage de caractères utilisé est UTF-8.",
    "objectifs": [
      "Recourir à un jeu de caractères international.",
      "Prévenir les défauts d’affichage.",
      "Faciliter la manipulation des contenus par les utilisateurs et les développeurs."
    ]
  },
  {
    "title": "Le code source de chaque page contient une métadonnée qui définit le jeu de caractères.",
    "objectifs": [
      "Permettre un affichage hors ligne correct des pages en indiquant au navigateur quel est le jeu de caractères utilisé.",
      "Prévenir le risque de problèmes d’affichage de caractères lié à un fonctionnement parfois hasardeux des mécanismes de rattrapage des navigateurs quand ils ne disposent pas de l’information nécessaire via l’en-tête HTTP content-type."
    ]
  },
  {
    "title": "Un contenu qui doit être restitué dans un lecteur d’écran ne lui est pas dissimulé.",
    "objectifs": [
      "Permettre une restitution correcte des contenus masqués qui doivent être lus par les lecteurs d’écran."
    ]
  },
  {
    "title": "Le contenu et le sens de chaque page ne sont pas altérés lorsque les styles sont désactivés.",
    "objectifs": [
      "Permettre la compréhension des contenus par les utilisateurs dont le navigateur n’appliquera pas les feuilles de styles du site ou dont le mode d’accès n’est pas visuel.",
      "Séparer rigoureusement les contenus de la présentation pour favoriser leur interopérabilité."
    ]
  },
  {
    "title": "Les éléments visuellement présentés sous forme de liste sont balisés de façon appropriée dans le code source.",
    "objectifs": [
      "Permettre l’identification des listes par les navigateurs et les aides techniques et donc leur restitution appropriée afin de faciliter leur compréhension par les utilisateurs.",
      "Améliorer la sémantique du contenu des pages et sa réutilisabilité."
    ]
  },
  {
    "title": "Les textes pouvant être mis en forme via des styles ne sont pas remplacés par des images.",
    "objectifs": [
      "Faciliter l’adaptation du rendu au media (mobile ou autre) ou aux besoins de l’utilisateur (agrandissement de la taille des caractères, modification des couleurs, de la police, de la graisse, de la justification, etc.)."
    ]
  },
  {
    "title": "La première occurrence d’une abréviation ou d’un acronyme dans le corps de chaque page donne accès à sa signification.",
    "objectifs": [
      "Permettre à l’utilisateur d’accéder rapidement à la signification d’un sigle.",
      "Permettre l’exploitation du contenu par un robot (pour l’établissement d’un index des sigles).",
      "Favoriser le référencement du contenu."
    ]
  },
  {
    "title": "Le code source de chaque page ne contient pas d’éléments détournés à des fins de présentation.",
    "objectifs": [
      "Permettre l’exploitation pertinente du code source par les agents utilisateurs (les navigateurs, les robots d’indexation des moteurs de recherche, les plages brailles, etc.).",
      "Alléger le code source en déportant la mise en forme dans les CSS."
    ]
  },
  {
    "title": "Le code source de chaque page ne contient pas d’éléments ou d’attributs de présentation.",
    "objectifs": [
      "Favoriser l’adaptation de la mise en forme des contenus par les agents utilisateurs, selon les besoins de l’utilisateur.",
      "Réduire le poids du code source des pages, en incitant à mutualiser et à externaliser les informations de mise en forme grâce à CSS.",
      "Faciliter la réutilisation du contenu sans contraintes liées à sa mise en forme initiale."
    ]
  },
  {
    "title": "Le site propose au moins un moyen de contact.",
    "objectifs": [
      "Faciliter le retour d’information de la part des utilisateurs.",
      "Favoriser la confiance en garantissant d’entrée de jeu à l’utilisateur la possibilité d’un recours en cas de difficultés."
    ]
  },
  {
    "title": "Le site propose au moins deux moyens de contact.",
    "objectifs": [
      "Optimiser les possibilités de retour d’information de la part des utilisateurs.",
      "Éviter de mettre l’utilisateur en difficulté en cas d’indisponibilité ou de problèmes d’utilisation de l’un des moyens de contact."
    ]
  },
  {
    "title": "Les coordonnées postales et téléphoniques de la représentation locale ou du siège social des sociétés et organisations sont indiquées.",
    "objectifs": [
      "Favoriser l’identification de l’entité responsable des contenus et des services.",
      "Fournir un moyen de contact alternatif."
    ]
  },
  {
    "title": "Chaque demande d’information fait l’objet d’un accusé de réception.",
    "objectifs": [
      "Informer les utilisateurs de la prise en compte de leur demande.",
      "Permettre aux utilisateurs d’obtenir une confirmation archivable de la bonne réception de leur demande d’information."
    ]
  },
  {
    "title": "Les délais de réponse aux demandes d’information sont indiqués.",
    "objectifs": [
      "Informer les utilisateurs sur les délais chiffrés de réponse.",
      "Limiter les risques de relance de la part des utilisateurs.",
      "Rassurer sur la capacité à prendre en compte les demandes."
    ]
  },
  {
    "title": "Les données contenues dans le Whois du site permettent de le relier directement à son propriétaire.",
    "objectifs": [
      "Faciliter l’identification de l’entité ou de la personne responsable des contenus ou des services.",
      "Permettre à des utilisateurs de s’assurer qu’ils sont bien sur le bon site et non sur un site de phishing, par exemple."
    ]
  },
  {
    "title": "Le titre de chaque page permet d’identifier le site.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier immédiatement le site dans les onglets, les favoris, dans la fenêtre du navigateur ou encore dans les lecteurs d’écran.",
      "Améliorer le référencement du site et sa présentation dans les moteurs de recherche."
    ]
  },
  {
    "title": "Le titre de chaque page permet d’identifier son contenu.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier immédiatement la nature des contenus de chaque page dans les onglets, les favoris, dans la fenêtre du navigateur ou encore dans les lecteurs d’écran. ",
      "Améliorer le référencement des pages et leur présentation dans les moteurs de recherche."
    ]
  },
  {
    "title": "Les contenus publicitaires ou sponsorisés sont identifiés comme tels.",
    "objectifs": [
      "Permettre une identification immédiate des contenus publicitaires ou sponsorisés.",
      "Éviter les confusions entre contenus rédactionnels et publicitaires.",
      "Prévenir les risques associés aux conflits d’intérêt."
    ]
  },
  {
    "title": "Les informations relatives aux droits de copie et de réutilisation sont accessibles depuis toutes les pages.",
    "objectifs": [
      "Informer les utilisateurs sur les conditions sous lesquelles sont publiés les contenus.",
      "Informer les utilisateurs sur les conditions de copie et de réutilisation."
    ]
  },
  {
    "title": "Le site fournit aux utilisateurs la possibilité de connaître les nouveaux contenus ou services.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier immédiatement les nouveaux contenus ou services en ligne."
    ]
  },
  {
    "title": "Si le site propose un espace personnel ou abonné, il est possible de sauvegarder les contenus personnels dans un format standard.",
    "objectifs": [
      "Permettre l’archivage des contenus créés par l’utilisateur.",
      "Éviter à l’utilisateur d’éventuelles saisies redoublées en cas de réutilisation des contenus."
    ]
  },
  {
    "title": "Un lexique ou un glossaire adapté au public visé explique le vocabulaire sectoriel ou technique.",
    "objectifs": [
      "Permettre aux utilisateurs de comprendre les contenus sectoriels ou à caractère technique.",
      "Faciliter l’utilisation d’un service.",
      "Améliorer le référencement sur des mots-clés ou expressions techniques."
    ]
  },
  {
    "title": "L’achat d’un produit ou service est possible sans création de compte.",
    "objectifs": [
      "Permettre à l’acheteur de commander immédiatement.",
      "Lever la barrière de la création de compte.",
      "Augmenter le taux de conversion."
    ]
  },
  {
    "title": "Aucun produit ni service annexe n’est ajouté au panier de commande sans que cette action soit déclenchée par l’utilisateur.",
    "objectifs": [
      "Laisser à l’utilisateur le contrôle de sa commande.",
      "Ne pas compromettre la relation de confiance avec l’utilisateur.",
      "Éviter toute forme de vente forcée."
    ]
  },
  {
    "title": "La disponibilité des produits est indiquée avant la validation définitive de la commande.",
    "objectifs": [
      "Permettre d’anticiper d’éventuelles difficultés et une augmentation du délai de livraison."
    ]
  },
  {
    "title": "Le délai de livraison estimé est indiqué avant la validation définitive de la commande.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier la date réelle à laquelle le bien commandé sera effectivement en leur possession."
    ]
  },
  {
    "title": "Les modalités de récupération d’un bien dématérialisé sont précisées avant la commande.",
    "objectifs": [
      "Permettre à l’utilisateur d’anticiper les conditions et les moyens d’accès au service ou au bien dématérialisé.",
      "Éviter les déceptions et le traitement de réclamations."
    ]
  },
  {
    "title": "La modification de la quantité de chaque article, l’ajout et la suppression d’un ou plusieurs articles restent possibles avant la validation définitive de la commande.",
    "objectifs": [
      "Permettre à l’utilisateur de modifier facilement sa commande."
    ]
  },
  {
    "title": "La nature et les caractéristiques quantifiables des produits et services sont indiquées.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier précisément la nature et les spécifications des produits proposés."
    ]
  },
  {
    "title": "La période et les conditions de validité des offres spéciales et promotions sont indiquées.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier la période au cours de laquelle ils peuvent bénéficier des offres proposées."
    ]
  },
  {
    "title": "Le numéro d’immatriculation délivré aux sociétés ou organisations au terme des procédures légales d’enregistrement en vigueur dans leur pays est indiqué.",
    "objectifs": [
      "Fournir aux utilisateurs une indication vérifiable de l’existence officielle de la structure qui propose les contenus ou le service."
    ]
  },
  {
    "title": "Le sous-total détaillé est indiqué avant la validation définitive de la commande.",
    "objectifs": [
      "Permettre à l’utilisateur de connaître le détail du montant de sa commande.",
      "Lever un frein à la validation d’une commande. "
    ]
  },
  {
    "title": "Les conditions de financement sont indiquées.",
    "objectifs": [
      "Permettre à l’utilisateur d’identifier le montant total qu’il aura à payer et les différentes composantes de ce montant."
    ]
  },
  {
    "title": "Les conditions de fonctionnement du service après-vente sont indiquées.",
    "objectifs": [
      "Permettre aux utilisateurs de connaître les conditions d’assistance en cas de difficulté."
    ]
  },
  {
    "title": "Les conditions de débit ou d’encaissement sont spécifiées avant la validation définitive de la commande.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier précisément les conditions de l’encaissement."
    ]
  },
  {
    "title": "Les conditions de garantie sont indiquées.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier précisément la nature des services associés et leur coût."
    ]
  },
  {
    "title": "Les conditions de vente ou d’utilisation sont accessibles depuis toutes les pages.",
    "objectifs": [
      "Permettre un accès facile et permanent à toutes les conditions de réalisation du service. "
    ]
  },
  {
    "title": "Les informations relatives à la zone de livraison des produits ou de réalisation des services sont indiquées.",
    "objectifs": [
      "Éviter une navigation et des commandes inutiles, voire une perte de temps pour l’utilisateur ainsi que pour la structure qui propose les biens ou les services."
    ]
  },
  {
    "title": "Les moyens de paiement acceptés et les procédures correspondantes sont indiqués.",
    "objectifs": [
      "Permettre aux utilisateurs d’anticiper le mode et les conditions de paiement et de vérifier avant la commande s’ils pourront la mener à son terme."
    ]
  },
  {
    "title": "Les horaires et tarifs de fonctionnement des services mis à la disposition des utilisateurs sont indiqués.",
    "objectifs": [
      "Permettre aux utilisateurs de connaître les services mis à leur disposition et leur fonctionnement."
    ]
  },
  {
    "title": "Les recours en cas de litige sont indiqués dans les conditions générales de vente ou d’utilisation.",
    "objectifs": [
      "Rassurer l’internaute avant l’achat.",
      "Donner à l’acheteur toutes les informations liées à son achat, que celui-ci se passe bien ou non. "
    ]
  },
  {
    "title": "L’adresse et les conditions de retour des produits sont indiquées.",
    "objectifs": [
      "Permettre aux utilisateurs d’anticiper d’éventuelles difficultés d’utilisation et/ou de fonctionnement du bien ou du service proposé. ",
      "Réduire le nombre de sollicitations du service client."
    ]
  },
  {
    "title": "Le mode de dépôt et la procédure de traitement des réclamations sont indiqués.",
    "objectifs": [
      "Permettre aux utilisateurs de comprendre ou d’anticiper d’éventuelles difficultés sur le site ou lors de la transaction."
    ]
  },
  {
    "title": "Les conditions de remboursement sont indiquées.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier précisément les pièces nécessaires en cas de nécessité de retour du produit.",
      "Anticiper d’éventuels problèmes en cas de demande de remboursement réalisée après le délai légal.",
      "Diminuer le nombre de démarches inutiles et le nombre de demandes au support client.",
      "Augmenter le taux de transformation d’un site e-commerce."
    ]
  },
  {
    "title": "Les matériels et logiciels nécessaires au fonctionnement du service sont indiqués avant la validation de la commande.",
    "objectifs": [
      "Permettre à l’utilisateur d’anticiper les conditions et les moyens d’utilisation du service.",
      "Limiter les réclamations."
    ]
  },
  {
    "title": "Les prix affichés mentionnent le détail des taxes et suppléments éventuels ainsi que le montant hors taxes.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier précisément et avant l’achat le montant total qu’ils auront à payer.",
      "Permettre aux utilisateurs d’identifier précisément les montants déductibles et les différentes imputations."
    ]
  },
  {
    "title": "Une adresse de livraison différente de l’adresse de facturation peut être spécifiée.",
    "objectifs": [
      "Permettre aux utilisateurs de faire livrer un achat sur le lieu de leur choix."
    ]
  },
  {
    "title": "Le site accepte au moins deux moyens de paiement.",
    "objectifs": [
      "Permettre aux utilisateurs de choisir le mode de paiement qui leur convient le mieux dans leur contexte."
    ]
  },
  {
    "title": "La référence de la transaction est affichée au client après la validation de sa commande.",
    "objectifs": [
      "Permettre aux utilisateurs d’afficher et éventuellement d’imprimer une trace de leur commande."
    ]
  },
  {
    "title": "Les mentions d’appartenance à un ordre ou groupe professionnel, d’un label ou d’une récompense sont accompagnées d’un lien vers la source.",
    "objectifs": [
      "Donner un accès immédiat à l’utilisateur pour lui permettre de comprendre de quoi il s’agit.",
      "Permettre à l’utilisateur de vérifier par lui-même l’information.",
      "Accroître le degré de confiance ou de crédibilité."
    ]
  },
  {
    "title": "Les produits indisponibles font l’objet d’une différenciation visuelle et textuelle.",
    "objectifs": [
      "Permettre à l’utilisateur d’identifier immédiatement et sans confusion possible les produits indisponibles.",
      "Éviter l’effet de déception si un utilisateur débute une procédure de commande et s’aperçoit tardivement de l’indisponibilité du produit désiré. "
    ]
  },
  {
    "title": "Un courriel indiquant la référence de la transaction et les données de la commande est envoyé suite à la validation.",
    "objectifs": [
      "Donner à l’utilisateur une confirmation des informations relatives à la commande.",
      "Permettre à l’utilisateur de conserver un historique de la transaction ailleurs que dans le site."
    ]
  },
  {
    "title": "Chaque réclamation fait l’objet d’un accusé de réception.",
    "objectifs": [
      "Permettre à l’utilisateur d’obtenir une confirmation de sa demande en-dehors du contexte de la navigation sur le site. ",
      "Éviter au service client de recevoir plusieurs demandes concernant une même réclamation."
    ]
  },
  {
    "title": "Le site propose au moins un moyen de contacter le responsable des réclamations.",
    "objectifs": [
      "Permettre aux utilisateurs de s’adresser ou d’adresser directement leurs réclamations au bon interlocuteur. ",
      "Rassurer les internautes sur le fait qu’ils pourront facilement interagir avec le service des réclamations en cas de problème."
    ]
  },
  {
    "title": "Le site propose au moins un moyen de contacter le modérateur des espaces publics.",
    "objectifs": [
      "Permettre aux utilisateurs de contacter le modérateur pour demander une correction, poser une question ou signaler des abus."
    ]
  },
  {
    "title": "Les espaces publics proposent au moins un moyen de signaler les abus.",
    "objectifs": [
      "Faciliter le signalement de contenus illégaux ou inappropriés.",
      "Accélérer la détection de ces contenus.",
      "Limiter les risques de consultation de contenus illégaux ou inappropriés."
    ]
  },
  {
    "title": "Les conditions de modération des espaces publics sont indiquées.",
    "objectifs": [
      "Expliquer aux utilisateurs pour quelles raisons et dans quelle mesure leurs publications peuvent être modérées.",
      "Limiter le nombre de réclamations des utilisateurs ne voyant pas leur publication apparaître."
    ]
  },
  {
    "title": "Les contenus ou fichiers destinés à des espaces publics peuvent être vérifiés avant leur envoi définitif.",
    "objectifs": [
      "Permettre à l’utilisateur de vérifier sa saisie en contexte et, si nécessaire, de la corriger avant envoi."
    ]
  },
  {
    "title": "Les informations destinées à des espaces publics peuvent être prévisualisées sous la forme où elles seront affichées.",
    "objectifs": [
      "Permettre à l’utilisateur de vérifier et de corriger si nécessaire sa saisie en tenant compte de la présentation finale du contenu concerné."
    ]
  },
  {
    "title": "La durée des contenus vidéo ou audio est indiquée.",
    "objectifs": [
      "Informer l’utilisateur afin qu’il puisse décider en connaissance de cause de consulter ou de télécharger ou non le contenu concerné."
    ]
  },
  {
    "title": "Le format des fichiers proposés en téléchargement est indiqué.",
    "objectifs": [
      "Permettre aux utilisateurs de savoir en temps utile si leurs outils les autorisent à consulter les fichiers proposés en téléchargement.",
      "Réduire la charge serveur en évitant les téléchargements inutiles."
    ]
  },
  {
    "title": "La taille des fichiers internes proposés en téléchargement est indiquée.",
    "objectifs": [
      "Informer de façon préventive les utilisateurs sur la quantité de données à télécharger.",
      "Permettre aux utilisateurs de différer le téléchargement en connexion bas débit ou mobile."
    ]
  },
  {
    "title": "La langue des fichiers en téléchargement est précisée lorsqu’elle diffère de celle de la page d’origine.",
    "objectifs": [
      "Éviter aux utilisateurs des téléchargements inutiles.",
      "Informer les utilisateurs sur les fichiers téléchargés."
    ]
  },
  {
    "title": "Les animations, sons et clignotements peuvent être mis en pause.",
    "objectifs": [
      "Laisser à l’utilisateur le contrôle des animations lors de la consultation du contenu.",
      "Ne pas perturber l’attention en imposant des éléments pouvant gêner celle-ci.",
      "Permettre la consultation pas à pas d’animations séquentielles ou de contenus sonores."
    ]
  },
  {
    "title": "Le déroulement des animations ne bloque pas la navigation ou l’accès aux contenus.",
    "objectifs": [
      "Fournir aux utilisateurs un accès direct et immédiat aux contenus, même lorsque l’administrateur du site décide de proposer une animation ou une publicité préalable."
    ]
  },
  {
    "title": "Les sons et vidéos sont déclenchés par l’utilisateur.",
    "objectifs": [
      "Laisser à l’utilisateur le contrôle de l’interface sonore et visuelle lors de la consultation du site.",
      "Ne pas surprendre l’utilisateur par la diffusion inattendue d’un contenu audio.",
      "Ne pas imposer à l’utilisateur le déclenchement d’un contenu animé."
    ]
  },
  {
    "title": "Le texte des documents PDF internes est sélectionnable.",
    "objectifs": [
      "Permettre le référencement des contenus des documents PDF.",
      "Faciliter la manipulation et la réutilisation du contenu des documents PDF.",
      "Garantir la lisibilité des contenus des documents PDF."
    ]
  },
  {
    "title": "Les documents PDF internes sont dotés d’une structure de titres.",
    "objectifs": [
      "Permettre aux utilisateurs d’accéder directement à différentes sections d’un document PDF.",
      "Fournir une structure de titres aux utilisateurs qui en ont besoin.",
      "Permettre la consultation d’un PDF via une aide technique."
    ]
  },
  {
    "title": "Chaque champ de formulaire est associé dans le code source à une étiquette qui lui est propre.",
    "objectifs": [
      "Faciliter la compréhension des données attendues dans les formulaires.",
      "Permettre aux aides techniques d’accessibilité de restituer les champs de formulaires en les associant systématiquement à une étiquette indiquant leur rôle et la nature de la saisie attendue.",
      "Faciliter la saisie en permettant de sélectionner le champ via un clic sur son étiquette aussi bien que sur le champ lui-même (particulièrement en cas de case à cocher ou de case radio)."
    ]
  },
  {
    "title": "Les informations complétant l’étiquette d’un champ sont associées à celui-ci dans le code-source",
    "objectifs": [
      "Optimiser le rendu dans les lecteurs d’écran en permettant d’expliciter les étiquettes des champs de formulaire."
    ]
  },
  {
    "title": "L’étiquette de chaque champ de formulaire indique si la saisie est obligatoire.",
    "objectifs": [
      "Permettre aux utilisateurs de savoir à l’avance si un champ est obligatoire.",
      "Prévenir les erreurs avant qu’elles ne surviennent."
    ]
  },
  {
    "title": "L’étiquette de chaque champ de formulaire indique, le cas échéant, quel format de saisie doit être respecté.",
    "objectifs": [
      "Limiter le risque d’erreurs de saisie.",
      "Limiter les risques associés à l’envoi de données erronées ou impossibles à exploiter. ",
      "Éviter que l’utilisateur ne renonce à poursuivre faute d’information sur la saisie attendue."
    ]
  },
  {
    "title": "L’utilisateur est averti lorsqu’une saisie est sensible à la casse.",
    "objectifs": [
      "Éviter le risque d’erreur et donc éviter à l’utilisateur de devoir remplir plusieurs fois un même champ.",
      "Éviter l’incompréhension de l’utilisateur qui pense avoir rempli correctement le champ et qui le voit signalé en erreur."
    ]
  },
  {
    "title": "La création d’un mot de passe par l’utilisateur fait l’objet d’un mécanisme de prévention des erreurs de saisie.",
    "objectifs": [
      "Éviter à l’utilisateur de saisir un mot de passe qui ne correspond finalement pas à celui qu’il a souhaité ou mémorisé."
    ]
  },
  {
    "title": "Les caractères saisis dans un champ de mot de passe peuvent être affichés en clair.",
    "objectifs": [
      "Faciliter la saisie des mots de passe, notamment sur les claviers virtuels des terminaux mobiles.",
      "Prévenir les erreurs."
    ]
  },
  {
    "title": "Chaque étiquette de formulaire est visuellement rattachée au champ qu’elle décrit.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier sans ambiguïté les champs de formulaire et la nature des informations à saisir.",
      "Prévenir les erreurs de saisie.",
      "Faciliter et accélérer l’usage du formulaire."
    ]
  },
  {
    "title": "En cas de rejet des données saisies dans un formulaire, les champs contenant les données rejetées sont indiqués à l’utilisateur.",
    "objectifs": [
      "Donner un retour à l’utilisateur sur l’action qu’il vient d’effectuer.",
      "Guider l’utilisateur directement vers les éléments sur lesquels il doit agir."
    ]
  },
  {
    "title": "En cas de rejet des données saisies dans un formulaire, les raisons du rejet sont indiquées à l’utilisateur.",
    "objectifs": [
      "Aider l’internaute à comprendre ce qu’on attend et, ainsi, faciliter le passage à l’étape suivante.",
      "Éviter la frustration de l’utilisateur face à une erreur dont il n’aurait pas la solution immédiate."
    ]
  },
  {
    "title": "En cas de rejet des données saisies dans un formulaire, toutes les données saisies peuvent être modifiées par l’utilisateur.",
    "objectifs": [
      "Laisser la main à l’utilisateur sur la totalité des informations qu’il donne.",
      "Faciliter la correction des erreurs commises par l’utilisateur.",
      "Permettre à l’utilisateur de modifier des informations sur lesquelles il voudrait revenir. ",
      "Éviter que l’utilisateur ne quitte le formulaire avant validation définitive."
    ]
  },
  {
    "title": "Lors de la saisie d’un formulaire réparti sur plusieurs pages, un récapitulatif global est affiché avant l’envoi définitif.",
    "objectifs": [
      "Donner à l’utilisateur une vue globale de ce qu’il a saisi dans les pages précédentes.",
      "Permettre à l’utilisateur de vérifier l’ensemble des informations d’une procédure complexe avant la soumission définitive."
    ]
  },
  {
    "title": "La page affichée après l’envoi d’un formulaire permet de reprendre directement la navigation.",
    "objectifs": [
      "Éviter de dérouter l’utilisateur en le menant à une page en impasse, y compris par l’utilisation de la fonction « page précédente » du navigateur.",
      "Limiter le risque de double envoi de formulaire."
    ]
  },
  {
    "title": "La soumission d’un formulaire est suivie d’un message indiquant la réussite ou non de l’action souhaitée.",
    "objectifs": [
      "Fournir à l’utilisateur un retour immédiat et explicite sur l’action qu’il vient d’effectuer.",
      "Éviter la frustration d’un utilisateur qui pense que le processus s’est déroulé avec succès alors qu’il y a eu un problème."
    ]
  },
  {
    "title": "Les processus complexes sont accompagnés de la liste de leurs étapes.",
    "objectifs": [
      "Donner de la visibilité à l’utilisateur sur les actions qu’il va réaliser (temps, ordre des étapes, informations nécessaires pour les accomplir, etc.).",
      "Éviter que l’utilisateur ne se sente piégé dans un processus dont il n’avait pas prévu la durée."
    ]
  },
  {
    "title": "L’étape en cours d’un processus complexe est indiquée.",
    "objectifs": [
      "Permettre à l’utilisateur d’identifier le degré d’avancement dans un processus.",
      "Rassurer l’utilisateur lors de la réalisation d’un processus complexe."
    ]
  },
  {
    "title": "Chaque étape d’un processus complexe permet de revenir à l’étape précédente.",
    "objectifs": [
      "Faciliter l’utilisation des formulaires répartis sur plusieurs pages successives.",
      "Réduire les risques d’erreurs de saisie.",
      "Limiter les risques d’abandon en cours de processus."
    ]
  },
  {
    "title": "L’utilisateur est averti de la perte d’information en cas d’utilisation de l’historique de son navigateur dans un processus complexe.",
    "objectifs": [
      "Faciliter l’utilisation des formulaires répartis sur plusieurs pages successives.",
      "Limiter les risques d’abandon en cours de processus."
    ]
  },
  {
    "title": "La navigation dans un processus complexe ne provoque pas la perte des données précédemment soumises.",
    "objectifs": [
      "Faciliter la saisie et sa correction dans les formulaires répartis par étapes.",
      "Limiter les risques d’abandon en cours de procédure."
    ]
  },
  {
    "title": "Le copier coller est possible dans les champs de formulaire.",
    "objectifs": [
      "Faciliter la saisie dans les formulaires."
    ]
  },
  {
    "title": "Les éléments d’une liste déroulante qui peuvent être regroupés le sont de manière appropriée.",
    "objectifs": [
      "Permettre aux aides techniques de restituer à l’utilisateur une liste dont l’organisation est clairement perceptible et qui facilite le passage d’un élément du contenu à l’autre.",
      "Favoriser un rendu approprié des listes déroulantes complexes dans tous les navigateurs."
    ]
  },
  {
    "title": "Les listes d’options de formulaires sont présentées dans un ordre identifiable.",
    "objectifs": [
      "Permettre aux utilisateurs d’accéder rapidement à l’item de liste recherché."
    ]
  },
  {
    "title": "Chaque lien est doté d’un intitulé dans le code source.",
    "objectifs": [
      "Éviter aux utilisateurs d’avoir uniquement une URL peu compréhensible en guise de libellé.",
      "Éviter les liens qui deviennent invisibles lorsque les styles CSS ou les images d’arrière-plan ne sont pas pris en compte."
    ]
  },
  {
    "title": "Le soulignement est réservé aux hyperliens.",
    "objectifs": [
      "Éviter les clics inutiles sur des contenus soulignés perçus comme des hyperliens.",
      "Faciliter l’identification des liens."
    ]
  },
  {
    "title": "Les hyperliens sont visuellement différenciés du reste du contenu.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier facilement les liens au fil du texte ainsi que les blocs de navigation."
    ]
  },
  {
    "title": "Le site n’applique pas le même style aux liens visités et non visités.",
    "objectifs": [
      "Faciliter l’identification des contenus déjà visités.",
      "Faciliter l’identification des contenus restant à découvrir.",
      "Inciter à la navigation sur de nouvelles pages."
    ]
  },
  {
    "title": "Le site n’impose pas d’interdiction ou de restriction à la mise en place des liens entrants.",
    "objectifs": [
      "Faciliter le référencement à travers l’obtention de backlinks.",
      "Augmenter la visibilité du site pour les utilisateurs."
    ]
  },
  {
    "title": "Le survol ou l’activation des hyperliens ne modifie pas la mise en page.",
    "objectifs": [
      "Limiter les difficultés à cliquer sur un lien lorsque celui-ci occupe plus d’espace en mode survolé ou activé.",
      "Limiter les effets de clignotement ou de déplacement de contenus lors du survol d’un lien ou de sa prise de focus clavier."
    ]
  },
  {
    "title": "Les hyperliens de même nature ont des couleurs, des formes et des comportements identiques sur toutes les pages.",
    "objectifs": [
      "Accélérer l’apprentissage du fonctionnement de l’interface.",
      "Améliorer l’identification des liens et de leurs fonctions respectives."
    ]
  },
  {
    "title": "Tous les hyperliens internes du site sont valides.",
    "objectifs": [
      "Éviter les erreurs 404 en cours de navigation.",
      "Faciliter un accès rapide à tous les contenus."
    ]
  },
  {
    "title": "Le libellé de chaque hyperlien décrit sa fonction ou la nature du contenu vers lequel il pointe.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier précisément la nature du lien et d’éviter des actions erronées.",
      "Permettre aux outils d’indexation d’associer un libellé à une ressource.",
      "Permettre aux lecteurs d’écran d’en indiquer la cible de façon explicite et d’éviter de désorienter les utilisateurs."
    ]
  },
  {
    "title": "Les hyperliens consécutifs sont séparés visuellement.",
    "objectifs": [
      "Éviter les confusions entre deux liens consécutifs. ",
      "Améliorer la lisibilité des liens et des contenus."
    ]
  },
  {
    "title": "Les hyperliens internes et externes sont différenciés.",
    "objectifs": [
      "Avertir clairement l’internaute du fait qu’il va quitter le service en ligne qu’il est en train de visiter. ",
      "Faciliter le repérage des liens externes"
    ]
  },
  {
    "title": "L’identité de l’auteur, de la société ou de l’organisation est indiquée.",
    "objectifs": [
      "Rassurer l’utilisateur en lui permettant d’identifier directement l’auteur (au sens large).",
      "Limiter les risques de défiance."
    ]
  },
  {
    "title": "L’identité de la personne ou du service responsable des contenus est indiquée.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier sans ambiguïté un interlocuteur physique capable de répondre aux questions éventuelles sur les contenus proposés, ou d’assumer les responsabilités liées à ces contenus."
    ]
  },
  {
    "title": "La page d’accueil expose la nature des contenus et services proposés.",
    "objectifs": [
      "Donner aux utilisateurs une vision immédiate de la nature du site et des contenus proposés.",
      "Éviter les recherches inutiles."
    ]
  },
  {
    "title": "Le nom du site et/ou le nom de l’auteur sont indiqués sur chaque page.",
    "objectifs": [
      "Permettre à l’utilisateur d’identifier immédiatement et en permanence l’auteur, l’entité qui administre le site ou le site lui-même le cas échéant."
    ]
  },
  {
    "title": "Si le site est réservé ou destiné à un public spécifique, ce public est mentionné au moins sur la page d’accueil.",
    "objectifs": [
      "Éviter des consultations inutiles.",
      "Délivrer un avertissement aux utilisateurs."
    ]
  },
  {
    "title": "L’adresse complète et le numéro de téléphone des sociétés et organisations sont accessibles depuis toutes les pages du site.",
    "objectifs": [
      "Donner aux utilisateurs qui le souhaitent la possibilité d’accéder sans difficulté aux moyens de contact téléphoniques et postaux."
    ]
  },
  {
    "title": "La racine du site contient des instructions pour les robots d’indexation.",
    "objectifs": [
      "Permettre un référencement ciblé.",
      "Améliorer le guidage des outils de recherche. "
    ]
  },
  {
    "title": "Le code source de chaque page contient une métadonnée qui en décrit le contenu.",
    "objectifs": [
      "Permettre aux outils de recherche et d’indexation d’extraire des informations à propos du contenu des pages et ainsi d’améliorer la restitution aux utilisateurs des résultats de recherche."
    ]
  },
  {
    "title": "Le code source des pages contient un appel valide à un icône de favori.",
    "objectifs": [
      "Améliorer l’identification visuelle du site et de ses pages.",
      "Faciliter l’identification dans le navigateur et dans les favoris ou signets.",
      "Permettre l’affichage, l’appel, et la mémorisation éventuelle de l’icône de favori par tous les navigateurs."
    ]
  },
  {
    "title": "L’extension utilisée est cohérente avec l’identité, l’activité, la zone géographique couverte ou avec le nom de domaine.",
    "objectifs": [
      "Contribuer à la compréhension immédiate de l’identité, de l’activité ou de la zone géographique du site.",
      "Améliorer la capacité des utilisateurs à mémoriser l’adresse du site et à la retrouver en cas d’oubli."
    ]
  },
  {
    "title": "Le site propose un fichier sitemap indiquant les contenus à explorer.",
    "objectifs": [
      "Mettre à disposition des informations synthétiques et lisibles par les machines sur l’ensemble des contenus proposés.",
      "Le fichier sitemap permet d’indiquer aux moteurs majeurs l’intégralité des contenus à indexer. L’intérêt premier est pour les sites très profonds comme les catalogues en ligne avec plusieurs milliers de produits ou encore des sites dont le contenu est difficilement accessible linéairement comme des encyclopédies.",
      "L’intérêt pour un site de quelques pages est faible voire inexistant, mais la présence du fichier ne sera pas pénalisante."
    ]
  },
  {
    "title": "Si le site déclare respecter un ou plusieurs standards ou référentiels, un lien est proposé vers chacun d’entre eux.",
    "objectifs": [
      "Faciliter la compréhension par l’utilisateur des règles de qualité, d’accessibilité ou autres appliquées sur le site.",
      "Accroître la confiance dans les informations délivrées sur le site."
    ]
  },
  {
    "title": "L’indicatif international est disponible pour tous les numéros de téléphone.",
    "objectifs": [
      "Permettre l’utilisation immédiate du contact téléphonique quel que soit le contexte utilisateur."
    ]
  },
  {
    "title": "Le pays est précisé pour toutes les adresses postales.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier immédiatement le pays associé à l’adresse postale, sans ambiguïté et sans avoir recours à d’autres éléments (ville, région, code postal, numéro de téléphone)."
    ]
  },
  {
    "title": "Le code source de chaque page indique la langue principale du contenu.",
    "objectifs": [
      "Favoriser l’indexation des contenus selon leur langue.",
      "Faciliter la traduction automatique.",
      "Permettre une lecture correcte du contenu par un outil de synthèse vocale."
    ]
  },
  {
    "title": "La langue principale de la page cible d’un hyperlien est identifiable lorsqu’elle diffère de celle de la page d’origine.",
    "objectifs": [
      "Permettre aux utilisateurs et outils de navigation d’anticiper le changement de langue en cours de navigation.",
      "Éviter aux utilisateurs de se rendre sur une page dont ils ne comprennent pas la langue."
    ]
  },
  {
    "title": "Chaque changement de langue est signalé.",
    "objectifs": [
      "Permettre aux aides techniques d’interpréter correctement les contenus exprimés dans une autre langue.",
      "Faciliter le travail des outils de traduction automatiques.",
      "Permettre aux outils d’indexation d’extraire des chaînes dans une langue donnée."
    ]
  },
  {
    "title": "Les liens d’accès aux versions traduites pointent directement vers la traduction de la page courante.",
    "objectifs": [
      "Donner un accès direct et immédiat aux traductions de la page courante."
    ]
  },
  {
    "title": "Les liens vers les versions équivalentes de la page ou du site sont rédigés dans leur langue cible.",
    "objectifs": [
      "Permettre l’identification immédiate du lien pertinent par l’utilisateur. ",
      "Rendre compréhensible des liens spécialement créés pour un public spécifique. "
    ]
  },
  {
    "title": "Le serveur ne force pas la redirection de la version desktop vers la version mobile.",
    "objectifs": [
      "Laisser le choix à l’utilisateur de la version ayant ses préférences."
    ]
  },
  {
    "title": "Il est possible de basculer depuis chaque page entre les versions mobile et desktop du site.",
    "objectifs": [
      "Permettre à l’utilisateur de choisir le mode de rendu le plus adapté à ses préférences et à son contexte."
    ]
  },
  {
    "title": "Le site ne bloque pas les fonctionnalités de zoom du navigateur.",
    "objectifs": [
      "Permettre aux utilisateurs d’adapter le rendu à leurs besoins ou à leurs préférences en recourant au zoom graphique."
    ]
  },
  {
    "title": "Les alertes javascript et fenêtres modales invitant à l’installation d’une application mobile ne se produisent qu’une seule fois par session.",
    "objectifs": [
      "Éviter les sollicitations imposées et répétitives.",
      "Faciliter la navigation dans le site.",
      "Prévenir d’éventuelles pénalités de la part des moteurs de recherche."
    ]
  },
  {
    "title": "La promotion de l’application mobile ne recourt ni aux alertes javascript ni aux fenêtres modales.",
    "objectifs": [
      "Éviter les sollicitations imposées et répétitives.",
      "Faciliter la navigation dans le site.",
      "Prévenir d’éventuelles pénalités de la part des moteurs de recherche."
    ]
  },
  {
    "title": "Le site propose un ou plusieurs mécanismes dédiés à l’adaptation aux terminaux mobiles.",
    "objectifs": [
      "Faciliter la consultation sur les terminaux mobiles.",
      "Améliorer le positionnement dans les outils d’indexation qui prennent ce critère en compte."
    ]
  },
  {
    "title": "Les champs de saisie de type mail, URL, téléphone, nombre, recherche, mots de passe, heure et date sont dotés du type approprié.",
    "objectifs": [
      "Permettre l’utilisation des claviers virtuels adaptés aux différents types de saisie sur les terminaux mobiles.",
      "Faciliter la validation de la saisie. "
    ]
  },
  {
    "title": "Les numéros de téléphone sont activables via le protocole approprié.",
    "objectifs": [
      "Permettre l’utilisation des claviers virtuels adaptés aux différents types de saisie sur les terminaux mobiles.",
      "Faciliter la validation de la saisie."
    ]
  },
  {
    "title": "Chaque iframe est doté d’une description.",
    "objectifs": [
      "Permettre une restitution alternative d’un iframe sous la forme d’un lien correctement libellé vers le contenu inclus."
    ]
  },
  {
    "title": "Le site n’emploie pas la technique des jeux de cadres.",
    "objectifs": [
      "Améliorer la consultation et la navigation pour les personnes handicapées.",
      "Éviter les problèmes d’impression ou de mise en favoris.",
      "Améliorer le référencement en évitant l’indexation de pages orphelines."
    ]
  },
  {
    "title": "Il est possible de revenir à la page d’accueil depuis toutes les pages.",
    "objectifs": [
      "Permettre aux utilisateurs de revenir en page d’accueil en cas de désorientation.",
      "Identifier le lien principal permettant d’accéder au site."
    ]
  },
  {
    "title": "L’utilisateur est averti des ouvertures de nouvelles fenêtres.",
    "objectifs": [
      "Permettre à l’utilisateur d’anticiper le résultat de l’activation d’un lien.",
      "Éviter aux utilisateurs d’aides techniques d’être désorientés par l’ouverture d’une nouvelle fenêtre qui n’est pas toujours perceptible et perturbe notamment l’utilisation de l’historique de navigation."
    ]
  },
  {
    "title": "La navigation sur le site ne provoque pas l’ouverture de fenêtres surgissantes (popups).",
    "objectifs": [
      "Permettre à l’utilisateur de naviguer sur le site sans avoir d’opération spécifique à effectuer pendant la navigation.",
      "Éviter à des utilisateurs d’aides techniques d’être désorientés par l’ouverture d’une nouvelle fenêtre qui ne sera pas toujours aisément perceptible et qui perturbe notamment l’utilisation de l’historique de navigation ou qui masquera dans un lecteur d’écran la fenêtre principale. "
    ]
  },
  {
    "title": "Les mécanismes de fermeture de fenêtres sont visuellement rattachées à leur contenu.",
    "objectifs": [
      "Faciliter la navigation."
    ]
  },
  {
    "title": "Les mécanismes de fermetures de fenêtres sont immédiatement disponibles.",
    "objectifs": [
      "Limiter le temps d’apprentissage de l’interface.",
      "Accélérer l’accès aux contenus.",
      "Réduire le taux de rebond."
    ]
  },
  {
    "title": "Les nouvelles fenêtres dimensionnées et les fenêtres modales sont dotées d’un bouton de fermeture explicite.",
    "objectifs": [
      "Donner aux utilisateurs des indications explicites pour fermer une fenêtre ou une boîte modale."
    ]
  },
  {
    "title": "Les mécanismes de fermetures de fenêtres sont affichés aux mêmes emplacements sur toutes les pages.",
    "objectifs": [
      "Limiter le temps d’apprentissage de l’interface.",
      "Accélérer l’accès aux contenus.",
      "Faciliter la navigation."
    ]
  },
  {
    "title": "La consultation du site ne redimensionne pas la fenêtre du navigateur.",
    "objectifs": [
      "Laisser à l’utilisateur le contrôle de son navigateur et de son interface de consultation",
      "Ne pas le désorienter ou le surprendre par un changement non anticipé de ceux-ci."
    ]
  },
  {
    "title": "Le focus clavier n’est ni supprimé ni masqué.",
    "objectifs": [
      "Permettre la navigation au clavier ou via des périphériques d’entrées ou des dispositifs qui ne reposent pas sur la souris."
    ]
  },
  {
    "title": "Le site est intégralement utilisable au clavier.",
    "objectifs": [
      "Permettre la navigation au clavier pour les utilisateurs ayant une préférence pour cette pratique.",
      "Permettre la consultation des contenus et l’utilisation des services indépendamment du périphérique d’entrée, afin de les rendre accessibles aux utilisateurs d’aides techniques (lecteurs d’écran par exemple) qui n’utilisent que le clavier ou un périphérique plus spécifique reposant sur les mêmes mécanismes que le clavier (bouton poussoir par exemple)."
    ]
  },
  {
    "title": "La navigation au clavier s’effectue dans un ordre prévisible.",
    "objectifs": [
      "De nombreux utilisateurs naviguent sans souris, avec les touches de leur clavier : facilitez-leur la vie."
    ]
  },
  {
    "title": "Le site ne comporte pas de liens internes vers des pages en construction.",
    "objectifs": [
      "Éviter des clics inutiles aux utilisateurs.",
      "Limiter la consommation inutile de bande passante.",
      "Proposer du contenu à valeur ajoutée."
    ]
  },
  {
    "title": "Chaque page affiche une information permettant de connaître son emplacement dans l’arborescence du site.",
    "objectifs": [
      "Permettre à l’utilisateur de déterminer son emplacement dans le site.",
      "Simplifier le passage des moteurs de recherche.",
      "Faciliter la navigation dans l’arborescence des contenus."
    ]
  },
  {
    "title": "Le site propose un moteur de recherche interne.",
    "objectifs": [
      "Fournir aux utilisateurs une solution de navigation alternative et d’accès rapide aux contenus liés à des mots-clés retenus par ceux-ci."
    ]
  },
  {
    "title": "La page des résultats de recherche indique le nombre de résultats, le nombre de pages de résultats, et le nombre de résultats par page.",
    "objectifs": [
      "Permettre aux utilisateurs d’avoir l’ensemble des informations essentielles relatives à la recherche qu’ils ont effectuée."
    ]
  },
  {
    "title": "Chaque page de résultats de recherche peut être atteint via une adresse Web.",
    "objectifs": [
      "Permettre à l’utilisateur de partager ou de conserver dans ses signets un résultat de recherche."
    ]
  },
  {
    "title": "Un plan du site est accessible depuis chaque page.",
    "objectifs": [
      "Fournir aux utilisateurs une solution en cas de désorientation, pour naviguer et se repérer dans le site, pour visualiser l’ensemble des contenus et la taille du site.",
      "Inciter les responsables du contenu à représenter graphiquement et à rationaliser leur contenu."
    ]
  },
  {
    "title": "Les blocs de navigation de même nature sont affichés aux mêmes emplacements sur toutes les pages.",
    "objectifs": [
      "Faciliter l’apprentissage de la navigation sur l’interface.",
      "Faciliter le repérage de l’information."
    ]
  },
  {
    "title": "Les icônes de navigation sont accompagnées d’une légende explicite.",
    "objectifs": [
      "Limiter le temps d’apprentissage de l’interface.",
      "Faciliter la compréhension des icônes.",
      "Limiter le risque d’erreurs."
    ]
  },
  {
    "title": "Les liens provoquant l’ouverture d’un logiciel externe ont un libellé explicite.",
    "objectifs": [
      "Éviter sur le poste client l’ouverture inopinée d’un autre logiciel que le navigateur Web."
    ]
  },
  {
    "title": "Si le site n’est pas réservé à un public spécifique, l’accès aux contenus est immédiat.",
    "objectifs": [
      "Permettre aux utilisateurs de commencer immédiatement leur navigation sur la ressource qu’ils ont demandée."
    ]
  },
  {
    "title": "Chaque page contient des liens d’accès rapide placés au début du code source.",
    "objectifs": [
      "Permettre aux utilisateurs qui consultent les pages de manière linéaire (mode vocal) ou semi-linéaire (écran de faible largeur) de ne pas avoir à défiler l’ensemble des éléments sur chaque page pour accéder aux contenus.",
      "Fournir des raccourcis accélérant la navigation au clavier et évitant des actions au clavier répétées pour parcourir la page et atteindre la zone souhaitée."
    ]
  },
  {
    "title": "Un lien de désinscription est présent dans chaque newsletter.",
    "objectifs": [
      "Permettre aux abonnés de ne plus recevoir une newsletter."
    ]
  },
  {
    "title": "La désinscription depuis une newsletter ne demande pas de confirmation par courriel.",
    "objectifs": [
      "Ne pas imposer à l’utilisateur une étape qui n’est pas nécessaire dans ce contexte."
    ]
  },
  {
    "title": "L’inscription aux newsletters est soumise à un processus de confirmation.",
    "objectifs": [
      "Éviter l’inscription à une newsletter par un tiers usurpant une identité.",
      "Vérifier que l’adresse e-mail a été saisie sans erreur."
    ]
  },
  {
    "title": "La désinscription aux newsletters est possible depuis le site.",
    "objectifs": [
      "Permettre à l’utilisateur de se désinscrire sans nécessairement passer par un mail."
    ]
  },
  {
    "title": "La dernière newsletter envoyée est disponible en ligne.",
    "objectifs": [
      "Permettre aux utilisateurs de se faire une idée de la newsletter envoyée aux abonnés.",
      "Permettre aux utilisateurs de consulter la newsletter en dehors des contraintes de l’email. ",
      "Accroître le référencement de vos contenus."
    ]
  },
  {
    "title": "Les archives de newsletters sont disponibles en ligne.",
    "objectifs": [
      "Faciliter la consultation des archives des newsletters. ",
      "Permettre aux utilisateurs de se faire une idée de la newsletter envoyée aux abonnés.",
      "Favoriser le référencement de vos contenus."
    ]
  },
  {
    "title": "La fréquence d’envoi des newsletters est consultable avant l’abonnement.",
    "objectifs": [
      "Permettre aux utilisateurs de connaître avant leur inscription la fréquence à laquelle ils recevront la newsletter."
    ]
  },
  {
    "title": "La charte graphique est cohérente sur l’ensemble du site.",
    "objectifs": [
      "Permettre une homogénéité et une continuité dans la visite et la navigation.",
      "Permettre une identification permanente du service en ligne visité."
    ]
  },
  {
    "title": "La taille des polices destinées à l’affichage écran est exprimée en taille variable et non en taille fixe.",
    "objectifs": [
      "Permettre aux utilisateurs équipés de navigateurs qui ne gèrent pas l’agrandissement des polices en taille fixe d’agrandir les polices sans difficulté."
    ]
  },
  {
    "title": "Le site propose des styles dédiés à l’impression.",
    "objectifs": [
      "Permettre l’impression des contenus sous une forme appropriée au support."
    ]
  },
  {
    "title": "Le contenu de chaque page est disponible à l’impression sans blocs de navigation.",
    "objectifs": [
      "Améliorer la lisibilité et la pertinence des contenus imprimés.",
      "Rationnaliser l’espace utilisé par les contenus imprimés pour économiser du papier."
    ]
  },
  {
    "title": "Une famille générique de police est indiquée comme dernier élément de substitution.",
    "objectifs": [
      "Permettre aux contenus de s’afficher correctement, même lorsque les polices prévues ne sont pas présentes sur le système de l’utilisateur."
    ]
  },
  {
    "title": "Les contenus sont présentés avec un contraste suffisant par rapport à leur arrière-plan.",
    "objectifs": [
      "Permettre une bonne lisibilité des contenus.",
      "Limiter la charge mentale lors de la consultation."
    ]
  },
  {
    "title": "Les mises en majuscules à des fins décoratives sont effectuées à l’aide des styles",
    "objectifs": [
      "Permettre un copier-coller des contenus indépendamment de la mise en forme entièrement en majuscules.",
      "Faciliter l’adaptation de la mise en forme pour les utilisateurs ayant des difficultés de lecture des textes entièrement en majuscules."
    ]
  },
  {
    "title": "Les styles ne justifient pas le texte.",
    "objectifs": [
      "Faciliter la lecture à l’écran, notamment pour les personnes dyslexiques."
    ]
  },
  {
    "title": "Un contenu n’est pas désigné uniquement par sa forme ou par sa position à l’écran.",
    "objectifs": [
      "Permettre la compréhension de l’information sans l’accès au support visuel ou lorsque le rendu de celui-ci est altéré."
    ]
  },
  {
    "title": "L’identité des prestataires impliqués dans les transactions est précisée.",
    "objectifs": [
      "Fournir aux utilisateurs des informations sur les partenaires tiers impliqués dans la transaction."
    ]
  },
  {
    "title": "La politique de confidentialité et de respect de la vie privée est accessible depuis toutes les pages.",
    "objectifs": [
      "Permettre aux utilisateurs de connaître les conditions de conservation de leurs données personnelles."
    ]
  },
  {
    "title": "Le site propose une procédure de réinitialisation du mot de passe.",
    "objectifs": [
      "Permette à l’utilisateur d’accéder à son compte en cas de perte du mot de passe.",
      "Simplifier la gestion des comptes utilisateurs. ",
      "Renforcer la sécurité en évitant le stockage de mots de passe non cryptés afin de pouvoir les communiquer de nouveau à l’utilisateur."
    ]
  },
  {
    "title": "Les mots de passe peuvent être choisis ou changés par l’utilisateur.",
    "objectifs": [
      "Permettre aux utilisateurs de choisir un mot de passe personnalisé.",
      "Éviter aux utilisateurs de rechercher leur mot de passe à chaque connexion."
    ]
  },
  {
    "title": "Les mots de passe choisis par l’utilisateur admettent les caractères imprimables de la table ASCII.",
    "objectifs": [
      "Favoriser un niveau élevé de sécurité des mots de passe."
    ]
  },
  {
    "title": "Un dispositif sensibilise l’utilisateur sur le degré de sécurisation du mot de passe qu’il choisit",
    "objectifs": [
      "Informer les utilisateurs sur le niveau de sécurité du mot de passe choisi et donc sur les risques de détournement."
    ]
  },
  {
    "title": "Les certificats de sécurité sont signés et en cours de validité.",
    "objectifs": [
      "Permettre aux utilisateurs de connaître la validité du certificat et contribuer à la sécurisation de la transaction."
    ]
  },
  {
    "title": "Les données sensibles ne sont pas transmises en clair dans les url.",
    "objectifs": [
      "Éviter que des données sensibles ne soient publiques et stockées en clair aux différentes étapes de l’accès à la page (FAI, proxy, serveur Web, historique du navigateur, services tiers…).",
      "Permettre à l’utilisateur de saisir des données sensibles en sachant qu’elles seront protégées et confidentielles."
    ]
  },
  {
    "title": "Les échanges de données sensibles sont sécurisés et signalés comme tels.",
    "objectifs": [
      "Conforter la confiance de l’utilisateur.",
      "Permettre à l’utilisateur de saisir des données sensibles en sachant qu’elles seront protégées.",
      "Minimiser les risques d’utilisation frauduleuse des données des utilisateurs."
    ]
  },
  {
    "title": "Les en-têtes envoyés par le serveur désactivent la détection automatique du type MIME de chaque ressource.",
    "objectifs": [
      "Réduire les risques de téléchargement d’un contenu dangereux dissimulé."
    ]
  },
  {
    "title": "Le serveur indique le type MIME de chaque ressource.",
    "objectifs": [
      "Réduire les risques de téléchargement d’un contenu dangereux dissimulé."
    ]
  },
  {
    "title": "Les informations sur la sécurité des transactions sont indiquées.",
    "objectifs": [
      "Contribuer à l’information des utilisateurs sur la sécurisation des échanges de données sensibles."
    ]
  },
  {
    "title": "L’objectif des cookies et les limitations inhérentes à leur refus sont expliqués.",
    "objectifs": [
      "Informer l’utilisateur sur les cookies.",
      "Expliquer leur rôle et leur utilité."
    ]
  },
  {
    "title": "La procédure d’accès et de rectification des données personnelles est décrite.",
    "objectifs": [
      "Informer l’utilisateur sur l’utilisation de ses données personnelles.",
      "Conforter la confiance dans le site ou le service.",
      "Faciliter la gestion des demandes liées aux données personnelles."
    ]
  },
  {
    "title": "La création d’un compte est soumise à un processus de confirmation.",
    "objectifs": [
      "Réduire les risques d’inscription de l’utilisateur à son insu."
    ]
  },
  {
    "title": "La création de compte est possible sans recours à un système d’identification tiers.",
    "objectifs": [
      "Laisser l’utilisateur libre de son choix d’utiliser ou non un service tiers.",
      "Fournir un moyen alternatif d’accès au service.",
      "Fournir un moyen d’accès maîtrisé par les administrateurs du service.",
      "Limiter la dépendance à un acteur tiers dont la politique et la stratégie commerciale ou technique ne manquera pas d’évoluer dans le temps."
    ]
  },
  {
    "title": "Les comptes ou abonnements ouverts en ligne peuvent être fermés par le même moyen.",
    "objectifs": [
      "Faciliter la gestion des comptes utilisateurs.",
      "Éviter à l’utilisateur une recherche de contact.",
      "Conforter la confiance dans le site ou le service."
    ]
  },
  {
    "title": "Le serveur n’envoie pas la liste des fichiers des répertoires n’ayant pas de page d’index.",
    "objectifs": [
      "Éviter l’affichage de listes de fichiers contenus dans un répertoire.",
      "Améliorer la sécurité du serveur.",
      "Limiter les risques d’intrusion."
    ]
  },
  {
    "title": "Le serveur envoie les informations d’activation de protection cross site scripting.",
    "objectifs": [
      "Réduire les risques de téléchargement d’un contenu dangereux dissimulé."
    ]
  },
  {
    "title": "Le serveur envoie les informations indiquant les domaines autorisés à intégrer ses pages dans des cadres.",
    "objectifs": [
      "Réduire les risques d’utilisation trompeuse du contenu."
    ]
  },
  {
    "title": "Le site propose un mécanisme de sécurité permettant de restreindre l’origine des contenus.",
    "objectifs": [
      "Réduire les risques d’exécution ou d’affichage d’un contenu non désirable ou d’une source non autorisée."
    ]
  },
  {
    "title": "Le serveur envoie les informations permettant la mise en cache des contenus.",
    "objectifs": [
      "Accélérer l’affichage des contenus et permettre une navigation plus fluide.",
      "Réduire les coûts de bande passante."
    ]
  },
  {
    "title": "Le serveur envoie un code http 404 pour les ressources non trouvées.",
    "objectifs": [
      "Permettre la détection automatisée des URL erronées.",
      "Transmettre au navigateur une information sûre."
    ]
  },
  {
    "title": "Le serveur envoie une page d’erreur 404 personnalisée.",
    "objectifs": [
      "Informer l’utilisateur sur l’erreur rencontrée, sur la continuité de fonctionnement du serveur et lever le doute sur un éventuel problème lié à sa connexion."
    ]
  },
  {
    "title": "Le serveur envoie une page d’interdiction 403 personnalisée.",
    "objectifs": [
      "Rassurer l’internaute sur le fait qu’il est toujours dans le même site.",
      "Permettre à l’administrateur du site de mettre des éléments de guidage pour l’utilisateur.",
      "Informer l’utilisateur sur l’erreur rencontrée, sur la continuité de fonctionnement du serveur et mettre hors de cause sa connexion."
    ]
  },
  {
    "title": "Le menu principal de navigation figure sur les pages d’erreur personnalisées.",
    "objectifs": [
      "Éviter aux utilisateurs les ruptures de navigation, l’arrivée sur des pages cul-de-sac ou l’obligation d’utiliser le bouton Précédent du navigateur."
    ]
  },
  {
    "title": "Le serveur transmet des contenus compressés aux clients qui les acceptent.",
    "objectifs": [
      "Améliorer la vitesse de rendu de la page.",
      "Diminuer les coûts de bande passante."
    ]
  },
  {
    "title": "Les en-têtes envoyés par le serveur contiennent les informations relatives au jeu de caractères employé.",
    "objectifs": [
      "Permettre au navigateur de choisir le bon encodage des caractères pour afficher la page."
    ]
  },
  {
    "title": "Le serveur respecte l’ordre préférentiel de langues des outils de consultation.",
    "objectifs": [
      "Servir les pages dans la langue souhaitée."
    ]
  },
  {
    "title": "Les feuilles de style du site sont minifiées.",
    "objectifs": [
      "Minimiser la quantité de données à télécharger par l’utilisateur.",
      "Améliorer les performances."
    ]
  },
  {
    "title": "Les scripts du site sont minifiés.",
    "objectifs": [
      "Accélérer la vitesse d’affichage des pages.",
      "Améliorer les performances.",
      "Diminuer la quantité de données à télécharger."
    ]
  },
  {
    "title": "Les fonctions de scripts internes au site sont placées dans des fichiers externes.",
    "objectifs": [
      "Minimiser la quantité de données à télécharger par l’utilisateur.",
      "Améliorer les performances."
    ]
  },
  {
    "title": "L’adresse du site et de ses sous-domaines fonctionnent avec ou sans préfixe www.",
    "objectifs": [
      "Permettre aux utilisateurs de rejoindre la page d’accueil du site même lorsqu’ils oublient de taper le préfixe www."
    ]
  },
  {
    "title": "Le code source des fils de syndication indique leur fréquence de mise à jour.",
    "objectifs": [
      "Permettre aux utilisateurs de configurer la fréquence à laquelle leurs outils consultent le fil de syndication.",
      "Réduire la charge du serveur."
    ]
  },
  {
    "title": "Les fils de syndication sont détectables par les agents utilisateurs.",
    "objectifs": [
      "Permettre au navigateur d’indiquer dans son interface la présence d’un fil de syndication associé à la page en cours de consultation."
    ]
  },
  {
    "title": "Les hyperliens contenus dans les fils de syndication sont absolus.",
    "objectifs": [
      "Assurer la fiabilité des liens lorsque le contenu est réutilisé."
    ]
  },
  {
    "title": "Le site propose au moins un lien vers chaque fil de syndication.",
    "objectifs": [
      "Permettre aux utilisateurs de s’abonner facilement aux fils de syndication."
    ]
  },
  {
    "title": "Les cellules des tableaux de données sont reliées à leurs en-têtes.",
    "objectifs": [
      "Permettre aux aides techniques de restituer l’information contenue dans les tableaux de données de manière compréhensible, en indiquant à l’utilisateur les relations logiques entre contenu et en-têtes du tableau."
    ]
  },
  {
    "title": "Les titres des tableaux de données sont renseignés.",
    "objectifs": [
      "Permettre aux utilisateurs d’aides techniques (lecteurs d’écran) d’identifier aisément la nature des informations fournies par un tableau."
    ]
  },
  {
    "title": "La linéarisation des tableaux utilisés pour la mise en page ne nuit pas à la compréhension des contenus.",
    "objectifs": [
      "Fournir un contenu compréhensible aux utilisateurs dont l’agent utilisateur ou l’aide technique (lecteur d’écran) ne permet pas de restituer la mise en forme initialement prévue à l’aide d’un tableau."
    ]
  },
  {
    "title": "Les tableaux de données ne sont pas remplacés par des images.",
    "objectifs": [
      "Permettre aux utilisateurs d’accéder à des tableaux exploitables par leur agent utilisateur et restitués de manière compréhensible dans tous les cas."
    ]
  },
  {
    "title": "Les tableaux de données ne sont pas simulés à l’aide de texte mis en forme.",
    "objectifs": [
      "Permettre aux utilisateurs d’accéder à des tableaux exploitables par leur agent utilisateur et restitués de manière compréhensible dans tous les cas."
    ]
  },
  {
    "title": "Si un contenu est proposé sous une forme inaccessible, une version alternative accessible est mise à disposition.",
    "objectifs": [
      "Il arrive qu’il soit impossible de rendre accessible un contenu. Si vous en avez la possibilité, proposez une version alternative. Attention, ne proposez pas une version spécifique accessible de votre site, faites plutôt en sorte de rendre la version principale accessible."
    ]
  },
  {
    "title": "Une description étendue correctement associée complète l’alternative textuelle des images complexes.",
    "objectifs": [
      "La description étendue donne l’intégralité de l’information et complète l’alternative textuelle plus synthétique. Pour un graphique, par exemple (courbe, diagramme, etc.), elle donnera l’ensemble des données, généralement sous forme d’un tableau. Elle profitera ainsi à l’accessibilité, au référencement et plus largement à l’accès aisé au détail de l’information."
    ]
  },
  {
    "title": "Les captchas audio peuvent être mis en pause.",
    "objectifs": [
      "Pouvoir réécouter un captcha audio est déjà une aide appréciable lorsqu’il s’avère difficile à déchiffrer. Pouvoir l’écouter pas à pas, grâce à un bouton play/pause, sera encore plus appréciable."
    ]
  },
  {
    "title": "Le code source de chaque page ne comporte pas d’erreur portant sur l’arbre du document ou la syntaxe des balises et attributs.",
    "objectifs": [
      "Les erreurs de validité HTML sont parfois difficilement évitables, dans la pratique. Mais toutes n’ont pas le même impact et n’exposent pas aux mêmes risques, en particulier en matière d’accessibilité de la page. Les erreurs visées ici sont celles jugées dangereuses pour l’accessibilité."
    ]
  },
  {
    "title": "Le code source des pages est valide au regard de la grammaire choisie.",
    "objectifs": [
      "La validité complète du code HTML est évidemment, quand elle est possible, la solution radicale face aux risques de rendus ou de comportements imprévus."
    ]
  },
  {
    "title": "Les éléments avec une sémantique native sont préférés.",
    "objectifs": [
      "Il est certes possible de reconstruire des éléments sémantiques (liens, boutons, titres de section, etc.) à partir d’éléments génériques (div, span), notamment via ARIA. Mais mieux vaut privilégier autant que possible les éléments sémantiques natifs, dont le support est bien plus assuré."
    ]
  },
  {
    "title": "Les zones principales de la page sont identifiées dans le code source.",
    "objectifs": [
      "Les « landmarks » HTML5 et les rôles ARIA équivalents peuvent être d’une aide considérable pour l’accessibilité. N’hésitez pas à baliser explicitement au moins votre header, vos menus, votre footer, votre contenu principal et votre formulaire de recherche."
    ]
  },
  {
    "title": "Les citations sont balisées de façon appropriée.",
    "objectifs": [
      "Le balisage des citations avec les éléments HTML appropriés (q, blockquote) améliore leur accessibilité en permettant aux aides techniques de les distinguer à coup sûr du reste du contenu. C’est également un atout pour le référencement."
    ]
  },
  {
    "title": "Les dimensions réelles des images sont indiquées dans le code source.",
    "objectifs": [
      "Indiquer les dimensions réelles des images dans le code source accélère le rendu. En cas de nécessité, ces informations peuvent être surchargées par les styles."
    ]
  },
  {
    "title": "L’accès aux contenus et services est possible sans le support des scripts.",
    "objectifs": [
      "Même si la présence d’une alternative à JavaScript n’est plus aujourd’hui une exigence d’accessibilité (dans la mesure où il s’agit de scripts en eux-mêmes conformes aux recommandations d’accessibilité), il peut rester prudent de permettre un accès aussi complet que possible aux contenus indépendamment du support, de l’activation ou du bon déroulement des scripts. Ne serait-ce, par exemple, qu’en cas de dysfonctionnement."
    ]
  },
  {
    "title": "Le site n’emploie aucune technique destinée à bloquer ou gêner l’affichage et/ou la lecture du code source.",
    "objectifs": [
      "Le Web a été pensé de façon à ce que chacun puisse publier librement et se servir des contenus publiés et pour que les techniques utilisées par les autres puissent être partagées. Certains sites tentent d’empêcher d’accéder à leur code source, c’est très facilement contournable et absolument pas dans l’esprit."
    ]
  },
  {
    "title": "Le site n’emploie aucune technique destinée à empêcher l’utilisation de fonctions natives des agents utilisateurs (clic droit, sélection de texte, impression…).",
    "objectifs": [
      "Bloquer certaines fonctionnalités ou possibilités des navigateurs ou équipements des utilisateurs est une très mauvaise idée. C’est non seulement gênant mais également assez facilement contournable. Inutile et contre"
    ]
  },
  {
    "title": "L’auteur de chaque article est identifiable.",
    "objectifs": [
      "La présence de l’identité de l’auteur sur un article est de nature à renforcer la confiance que l’on peut porter à son contenu. Par rebond, cela facilite la réutilisation, et cela incite au partage de l’article."
    ]
  },
  {
    "title": "Des sources (citations, lien vers une référence, etc.) légitiment les informations présentées et/ou leurs auteurs.",
    "objectifs": [
      "Comme le disait Victor Hugo, il est difficile d’établir la véracité et la solidité d’une information sur Internet. La présence des sources est de nature à renforcer la confiance des lecteurs."
    ]
  },
  {
    "title": "L’identité du ou des traducteurs est indiquée.",
    "objectifs": [
      "Les traducteurs ont un rôle important dans la qualité finale des contenus. La mention de leur identité les crédite, permet de les identifier en cas de question sur une traduction et renforce la confiance que l’utilisateur peut accorder à l’information."
    ]
  },
  {
    "title": "Les contenus éditoriaux qui le nécessitent sont associés à une date ou une période de publication.",
    "objectifs": [
      "Certains contenus sont de nature à périmer rapidement, certains nécessitent également d’être datés pour être compris dans leur contexte et réutilisables. La mention des dates aide à la compréhension et à la réutilisabilité."
    ]
  },
  {
    "title": "La date de mise à jour des contenus contractuels est indiquée.",
    "objectifs": [
      "Les contenus contractuels sont opposables à des entités judiciaires ou administratives. Il est donc fortement recommandé de les versionner et d’afficher les numéros de version"
    ]
  },
  {
    "title": "Les systèmes de votes, notes et sondages précisent le nombre de votants, la période et le mode de mesure.",
    "objectifs": [
      "En l’absence du nombre de votants, de la période et du mode de mesure, les votes, notes et sondages sont sujets à caution."
    ]
  },
  {
    "title": "Le site respecte les règles ortho-typographiques de la langue du texte.",
    "objectifs": [
      "La présence de fautes d’orthographe est l’un des éléments qui entâchent fortement la perception de la qualité d’un site. Pour les utilisateurs, cela donne une mauvaise image, et certaines études montrent que la présence de fautes d’orthographe a des effets négatifs sur les taux de conversion."
    ]
  },
  {
    "title": "Le contenu des pages ne contient pas de mots-clés dissimulés.",
    "objectifs": [
      "Pour améliorer le référencement de termes ou d’expressions, certains sites ont introduit des contenus dans les pages, et étant donnée leur faible utilité pour les usagers, ils prenaient soin de les afficher de la même couleur que le fond. Cette pratique a été sanctionnée par Google et a heureusement pratiquement disparu."
    ]
  },
  {
    "title": "L’affichage de contenus publicitaires ou sponsorisés ne vient pas automatiquement modifier la mise en page.",
    "objectifs": [
      "Différentes techniques d’insertion de contenus publicitaires peuvent faire apparaître ceux-ci au cours de la consultation de la page, par exemple en les intercalant entre deux blocs de contenu rendus visibles par le scroll. Il est alors extrêment désagréable de voir le texte qu’on est en train de lire se déplacer inopinément."
    ]
  },
  {
    "title": "Une métadonnée indique l’URL de référence des contenus proposés sous plusieurs formes.",
    "objectifs": [
      "L’indication d’une URL canonique (rel canonical) vous bénéficiera en cas de contenus dupliqués."
    ]
  },
  {
    "title": "Les tableaux de données des documents PDF internes sont structurés.",
    "objectifs": [
      "Comme les pages HTML, les PDF peuvent être vocalisés, les tableaux de données sont très fréquents dans ce type de documents et le fait de les baliser correctement peut rendre ces contenus plus accessibles."
    ]
  },
  {
    "title": "Les listes ordonnées et non ordonnées des documents PDF internes sont structurées.",
    "objectifs": [
      "Le balisage des listes ordonnées et non ordonnées facilite la vocalisation de leur contenu."
    ]
  },
  {
    "title": "Les images des documents PDF internes sont dotées d’alternatives textuelles.",
    "objectifs": [
      "Tout comme une image incluse dans une page HTML, une image porteuse d’information ou une image-lien dans un document PDF ont besoin d’une alternative, pour leur accessibilité et pour le référencement."
    ]
  },
  {
    "title": "Les documents PDF sont linéarisables.",
    "objectifs": [
      "S’assurer que le contenu d’un PDF est linéarisable permet à un lecteur d’écran de le restituer dans un ordre cohérent et compréhensible. Ceci est particulièrement important dans le cas de mises en page complexes."
    ]
  },
  {
    "title": "Les pages proposent un accès à une information synthétique pour les contenus sonores, visuels, animés et médias synchronisés.",
    "objectifs": [
      "Que vous puissiez ou non satisfaire à la bonne pratique qui vous invite à fournir une transcription textuelle de ces contenus, il est toujours bénéfique de donner par ailleurs une indication concise résumant l’essentiel de l’information : cela sera utile en termes d’accessibilité autant que de référencement."
    ]
  },
  {
    "title": "Les contenus multimédias sont sous-titrés.",
    "objectifs": [
      "Les sous-titres sont utiles pour les sourds et malentendants, mais pas seulement, puisqu’en l’absence de transcription, ils peuvent aussi devenir le seul moyen d’accès aux éléments textuels d’un contenu multimédia. Ils peuvent apporter une valeur ajoutée importante pour de nombreux utilisateurs (apprentissage des langues, consultation des contenus sans son, facilitation de la compréhension)."
    ]
  },
  {
    "title": "Chaque contenu vidéo est doté d’une audio-description.",
    "objectifs": [
      "L’audio-description bénéficie à un public non-voyant ou malvoyant, pour qui elle va donner accès, dans les blancs de la piste sonore par défaut, à l’information visuelle contenue dans la vidéo."
    ]
  },
  {
    "title": "L’utilisateur est averti du verrouillage majuscule de son clavier lors de la saisie d’un champ sensible à la casse.",
    "objectifs": [
      "L’activation du verrouillage majuscule est une raison fréquente d’échec lors de la saisie d’un mot de passe. Il peut être intéressant d’avertir l’utilisateur lorsqu’il est activé."
    ]
  },
  {
    "title": "La position des libellés et des champs est uniforme dans chaque formulaire.",
    "objectifs": [
      "La saisie d’un formulaire est une opération essentielle sur le Web, et il est très important de diminuer au maximum la charge mentale imposée aux usagers. Pour ceci, les champs et étiquettes doivent être alignés. L’alignement à droite des étiquettes et à gauche des champs est une solution souvent efficace."
    ]
  },
  {
    "title": "Les validations de formulaires côté client ont une alternative côté serveur.",
    "objectifs": [
      "Lorsque des contenus sont présentés sous forme de multiples blocs successifs à « ouvrir », cela facilite certes la vue d’ensemble sur ceux-ci. Mais la recherche d’une information spécifique à travers ces blocs peut aussi s’avérer fastidieuse s’il faut les ouvrir un à un"
    ]
  },
  {
    "title": "La possibilité d’envoyer un formulaire à l’aide de la touche Entrée du clavier n’est pas altérée.",
    "objectifs": [
      "Naviguer au clavier, c’est aussi très souvent se servir de la touche Entrée pour valider l’envoi d’un formulaire."
    ]
  },
  {
    "title": "Le lien d’activation de l’aide contextuelle à un champ de formulaire est visuellement rattaché à l’étiquette de ce champ.",
    "objectifs": [
      "Cette recommandation étend la bonne pratique invitant à afficher un champ et son étiquette de manière à ce que leur association soit immédiatement visible. Ici, on rapprochera par exemple l’icône donnant accès à une aide à la saisie du champ, selon le même principe de proximité visuelle immédiate."
    ]
  },
  {
    "title": "Les informations relatives à l’audience et à la fréquentation du site sont accompagnées de la période couverte et du mode de mesure.",
    "objectifs": [
      "Une donnée statistique ne peut être utilisable ou compréhensible qu’en présence des conditions dans lesquelles elle a été obtenue. En l’absence de ces conditions, les chiffres sont sujets à caution."
    ]
  },
  {
    "title": "La syntaxe des URL est homogène sur l’ensemble du site.",
    "objectifs": [
      "Les URL ne sont certes pas obligatoirement faites pour être mémorisées par les utilisateurs. Mais une syntaxe d’URL cohérente à travers tout le site facilitera souvent les choses."
    ]
  },
  {
    "title": "Un seul jeu d’identifiants est nécessaire pour accéder à l’ensemble des services proposés.",
    "objectifs": [
      "Certains sites ou groupes de sites (comme Opquast, par exemple) proposent plusieurs services qui nécessitent de s’identifier. "
    ]
  },
  {
    "title": "Les titres, libellés et contenus alternatifs sont traduits dans la langue de la page.",
    "objectifs": [
      "Une page doit si possible être intégralement traduite, y compris les meta données et les contenus alternatifs, éléments qui ne font pas directement partie des contenus traduits."
    ]
  },
  {
    "title": "Les formulaires et les messages associés sont rédigés dans une langue unique.",
    "objectifs": [
      "Cette recommandation vise notamment les messages d’erreurs, qui sont souvent oubliés lors des phases de traduction. Lors de l’internationalisation d’un formulaire, il faut penser à tout."
    ]
  },
  {
    "title": "La version originale des contenus traduits est indiquée.",
    "objectifs": [
      "Les versions originales non traduites d’un contenu peuvent servir de référence pour les utilisateurs, notamment parce que des erreurs d’interprétation ou de traduction sont toujours possibles."
    ]
  },
  {
    "title": "Les pages dont le contenu est issu d’une traduction automatique sont signalées comme telles.",
    "objectifs": [
      "Faire traduire ses pages par un outil automatique n’est pas idéal, mais dans certains cas, c’est mieux que rien. Dans ce cas, il faut simplement le préciser."
    ]
  },
  {
    "title": "Le sens de lecture du contenu est indiqué lorsqu’il diffère de celui par défaut.",
    "objectifs": [
      "Les navigateurs savent exploiter un mécanisme permettant de déterminer le sens de l’écriture à partir de son contenu (algorithme bidirectionnel). Mais ce mécanisme a quelques limites susceptibles de provoquer des rendus indésirables, notamment quand interviennent des signes dont la direction est neutre (chiffres, ponctuations)."
    ]
  },
  {
    "title": "Les pages contiennent des liens transversaux (alternatives à la navigation par les menus).",
    "objectifs": [
      "La navigation peut être accélérée grâce à des liens qui permettent de circuler entre les pages sans avoir à passer par l’accueil ou par les menus."
    ]
  },
  {
    "title": "Le code source des pages contient des liens relatifs vers l’auteur, les droits de reproduction, l’accueil et le plan du site.",
    "objectifs": [
      "Le HTML permet de fournir des données directement dans le code source, ce qui rend ces informations utilisables par les machines."
    ]
  },
  {
    "title": "Les blocs de contenu affichés individuellement à la demande de l’utilisateur peuvent être ouverts en une seule fois.",
    "objectifs": [
      "Lorsque des contenus sont présentés sous forme de multiples blocs successifs à « ouvrir », cela facilite certes la vue d’ensemble sur ceux-ci. Mais la recherche d’une information spécifique à travers ces blocs peut aussi s’avérer fastidieuse s’il faut les ouvrir un à un"
    ]
  },
  {
    "title": "Le défilement du contenu ne provoque pas l’affichage automatique de contenu interstitiel.",
    "objectifs": [
      "La navigation sur un site déclenche de plus en plus fréquemment l’ouverture automatique de contenus. Cette mauvaise pratique provoque des déplacements de contenus et gêne considérablement les utilisateurs."
    ]
  },
  {
    "title": "Chaque résultat de recherche est accompagné d’un extrait du contenu.",
    "objectifs": [
      "À l’instar des grands moteurs de recherche, les extraits de contenus ont une valeur ajoutée importante pour les utilisateurs. Le titre n’est pas toujours suffisant pour se faire une idée du contenu des résultats. L’extrait de contenu peut servir à supprimer des ambiguïtés."
    ]
  },
  {
    "title": "L’utilisateur peut choisir le nombre de résultats de recherche affichés par page.",
    "objectifs": [
      "Afficher des résultats de recherche par tranche de 20, par exemple, peut sembler approprié pour tous les contextes utilisateurs : ni trop à la fois, ni trop peu. Mais pourquoi ne pas éviter de gêner des utilisateurs ayant par exemple besoin de parcourir plus rapidement un grand nombre de résultats ? Permettez-leur d’afficher, au choix, par exemple 20, 50 ou 100 résultats par page."
    ]
  },
  {
    "title": "Les alternatives textuelles, étiquettes et libellés de liens ayant des fonctions identiques sont cohérentes à travers le site.",
    "objectifs": [
      "Il est essentiel pour l’expérience utilisateur que l’interface soit aussi prévisible que possible, lorsque c’est pertinent. Il s’agit ici simplement de donner un même libellé aux liens, boutons et champs de formulaire ayant le même rôle ou la même cible à travers différentes pages du site."
    ]
  },
  {
    "title": "L’accès à chaque contenu temporisé peut être mis en pause ou prolongé.",
    "objectifs": [
      "Chaque limite de temps imposée à l’utilisateur lors de l’accès au contenu peut être extrêmement pénalisante pour des personnes ayant, pour une raison technique ou liée à un handicap, besoin de plus de temps que vous ne l’aviez prévu. Il est donc important, lorsque c’est possible, de permettre à l’utilisateur de prolonger le temps qui lui a été imparti."
    ]
  },
  {
    "title": "Le champ destinataire de la newsletter ne comprend que l’e-mail du destinataire (ou à défaut un e-mail générique créé par l’expéditeur).",
    "objectifs": [
      "L’inscription aux newsletters doit généralement – et c’est ce que demandent de nombreuses législations – faire l’objet d’un opt-in (l’utilisateur manifeste sa volonté d’être abonné en cochant une case) plutôt que d’un opt-out (décochage d’une case pour manifester la volonté de ne pas être abonné). Certains sites ne s’embarrassent même pas de la présence d’une case à cocher et abonnent directement les utilisateurs lors d’une création de compte ou d’une commande en ligne. C’est évidemment à évite"
    ]
  },
  {
    "title": "L’interlettrage n’est réalisé que dans les styles CSS.",
    "objectifs": [
      "Pour obtenir un effet de mise en forme, on peut écrire par exemple « H E L L O ». Ce texte sera interprété par des aides techniques ou par des robots d’indexation ou de traduction comme une suite de lettres sans signification. Mieux vaut, donc, écrire « HELLO » et recourir à la propriété CSS letter"
    ]
  },
  {
    "title": "Les dispositifs de changement de taille de caractères proposés par le site agissent sur la totalité de la page.",
    "objectifs": [
      "Offrir un mécanisme d’agrandissement des caractères inclus dans la page (les classiques icônes A+) peut être ergonomiquement appréciable. Il ne faut cependant pas croire que seul le contenu principal de la page suffit à être visé : l’utilisateur peut tout aussi bien avoir besoin d’agrandir les menus ou les contenus annexes."
    ]
  },
  {
    "title": "Les styles en ligne ne sont utilisés que s’ils ne peuvent pas être externalisés.",
    "objectifs": [
      "Pourquoi surcharger le code HTML d’attributs de styles répétés lorsqu’il s’agit de mises en forme qui pourraient être gérées plus économiquement dans une feuille de styles, à l’aide de classes et d’identifiants ? Allégez vote code autant que possible !"
    ]
  },
  {
    "title": "Le contenu textuel reste lisible avec une taille de caractères augmentée d’un facteur deux dans le navigateur.",
    "objectifs": [
      "Même si l’usage du zoom graphique s’est largement répandu aujourd’hui, il reste important, pour l’accessibilité notamment, de permettre à l’utilisateur d’agrandir uniquement la taille du texte et non les éléments graphiques, par le paramétrage de son navigateur ou le racourci clavier Ctrl++."
    ]
  },
  {
    "title": "Les vignettes ne sont pas des images de taille supérieure redimensionnées côté client.",
    "objectifs": [
      "Pour afficher une vignette de petite taille, il suffit de prendre une image de grande taille et de lui donner une petite taille en HTML. Dans ce cas, l’image s’affiche en petit mais c’est bien la grande image qui est téléchargée. Cela ralentit le temps d’affichage et augmente la quantité de données à télécharger."
    ]
  },
  {
    "title": "Le site n’impose pas d’effets de flash.",
    "objectifs": [
      "Même si ce type de contenu est extrêmement rare, il est préférable d’éviter systématiquement les effets de flash, c’est à dire les clignotements à plus de 3 flashs par seconde, susceptibles de provoquer au minimum une gêne considérable à l’utilisateur."
    ]
  },
  {
    "title": "La commande ou la création de compte ne provoque pas d’inscription automatique à une newsletter.",
    "objectifs": [
      "L’inscription aux newsletters doit généralement – et c’est ce que demandent de nombreuses législations – faire l’objet d’un opt-in (l’utilisateur manifeste sa volonté d’être abonné en cochant une case) plutôt que d’un opt-out (décochage d’une case pour manifester la volonté de ne pas être abonné). Certains sites ne s’embarassent même pas de la présence d’une case à cocher et abonnent directement les utilisateurs lors d’une création de compte ou d’une commande en ligne. C’est évidemment à éviter."
    ]
  },
  {
    "title": "Les contenus postés dans des formulaires sont filtrés pour éviter les injections.",
    "objectifs": [
      "En injectant certaines commandes de bases de données dans de simples formulaires, certains utilisateurs arrivent à prendre la main sur le serveur. Il est donc intéressant de vérifier que cette injection est impossible."
    ]
  },
  {
    "title": "L’utilisateur peut modifier à tout moment ses choix en matière de cookies.",
    "objectifs": [
      "Malgré l’acceptation quasi systématique par les utilisateurs européens de l’activation de cookies, chaque utilisateur doit pouvoir conserver le choix de refuser ceux de certains sites. Pour cela, les administrateurs de sites peuvent proposer aux utilisateurs de refuser les cookies."
    ]
  },
  {
    "title": "Toute collecte d’information personnelle fait l’objet d’une explication ou d’une justification.",
    "objectifs": [
      "Chaque demande d’information personnelle d’un utilisateur doit pouvoir se justifier. En l’absence d’explication ou de justification, l’utilisateur peut imaginer toutes sortes d’utilisations pas forcément utiles de ses données."
    ]
  },
  {
    "title": "Le serveur est configuré pour ne pas renvoyer d’informations sur les versions des logiciels et langages utilisés.",
    "objectifs": [
      "Il est inutile d’exposer publiquement des détails, même apparemment inoffensifs, à propos de votre serveur et de sa configuration : c’est toujours un risque côté sécurité, aussi minime soit-il."
    ]
  },
  {
    "title": "Le serveur envoie un code 301 pour le contenu ayant changé d’adresse de façon permanente.",
    "objectifs": [
      "Améliorez votre référencement et allégez votre charge serveur : ne déménagez pas sans signaler explicitement votre changement d’adresse."
    ]
  },
  {
    "title": "Le site ne pratique pas de détection du user-agent.",
    "objectifs": [
      "Différentes techniques d’insertion de contenus publicitaires peuvent faire apparaître ceux-ci au cours de la consultation de la page, par exemple en les intercalant entre deux blocs de contenu rendus visibles par le scroll. Il est alors extrêment désagréable de voir le texte qu’on est en train de lire se déplacer inopinément."
    ]
  },
  {
    "title": "Les appels de scripts ne sont pas dupliqués.",
    "objectifs": [
      "L’affichage d’une page web peut déclencher des appels multiples au même script. L’effet peut être au mieux une perte de performance, au pire une perte de fonctionnalité."
    ]
  },
  {
    "title": "La date et l’heure du serveur sont correctes.",
    "objectifs": [
      "La date et l’heure du serveur ne sont pas toujours des données essentielles pour les humains, mais elles sont au minimum essentielles pour les machines et logiciels qui accédent aux contenus. Les conséquences d’un mauvais réglage ou d’un oubli de passage à l’heure d’été ou d’hiver peuvent être imprévisibles."
    ]
  },
  {
    "title": "Les appels aux scripts sont placés après le contenu.",
    "objectifs": [
      "Cette règle consistant à charger prioritairement permet souvent, mais pas toujours, d’afficher les contenus plus rapidement, et de donner l’impression d’un chargement plus rapide de la page."
    ]
  },
  {
    "title": "Le serveur envoie des pages d’erreurs personnalisées.",
    "objectifs": [
      "Un serveur renvoie des codes d’erreurs qui dépendent de la requête. Le plus fréquent est 200, qui dit que la ressources existe, mais il existe aussi les codes d’erreurs 404, 403 et 500. Dans tous les cas, ces erreurs gagnent à être aux couleurs du site."
    ]
  },
  {
    "title": "Le nombre de requêtes http est optimisé.",
    "objectifs": [
      "Cette recommandation est de nature à augmenter les performances et la vitesse d’affichage de vos pages. Les valeurs optimales sont complexes à trouver et dépendent beaucoup des contenus, mais une phase d’optimisation de ce paramètre peut jouer un rôle favora"
    ]
  },
  {
    "title": "Le site ne comporte pas de tableaux de données complexes.",
    "objectifs": [
      "Il est possible de baliser de manière accessible un tableau de données comportant de multiples en-têtes, des lignes d’en-têtes intermédiaires et des sections complexes. Certes, mais plutôt qu’un tableau théoriquement accessible mais compliqué pour tous, ne vaut-il pas mieux, autant que possible, scinder tout cela par exemple en plusieurs tableaux plus simples ?"
    ]
  },
  {
    "title": "Pour définir la qualité Web, on retient ici une approche centrée sur :",
    "objectifs": [
      "L’expérience utilisateur."
    ]
  },
  {
    "title": "La notion de visibilité concerne notamment :",
    "objectifs": [
      "Les campagnes publicitaires par voie d’affichage.",
      "La présence du site dans les résultats affichés par les moteurs de recherche externes."
    ]
  },
  {
    "title": "Quels sont les aspects techniques de la qualité ?",
    "objectifs": [
      "L’adaptation au mobile.",
      "La vitesse d’affichage des pages."
    ]
  },
  {
    "title": "La maîtrise d’ouvrage (propriétaire du projet) est généralement responsable :",
    "objectifs": [
      "Des services",
      "Des contenues"
    ]
  },
  {
    "title": "La maîtrise d’œuvre (réalisateur du projet web )est généralement responsable d’aspects tels que :",
    "objectifs": [
      "La sécurité",
      "Le référencement",
      "L’ergonomie"
    ]
  },
  {
    "title": "La notion de perception concerne notamment :",
    "objectifs": [
      "Le design",
      "L’ergonomie"
    ]
  },
  {
    "title": "L’expérience utilisateur :",
    "objectifs": [
      "Ne se limite pas à la visite du site"
    ]
  },
  {
    "title": "La valeur d’un site ou d’un service, qui motive ses visiteurs, dépend essentiellement :",
    "objectifs": [
      "Des contenus et des services qu’il propose"
    ]
  },
  {
    "title": "Une loupe d’écran permet :",
    "objectifs": [
      "D’agrandir le contenu affiché et d’en adapter les couleurs."
    ]
  },
  {
    "title": "La démarche qualité vise :",
    "objectifs": [
      "L’ensemble des contextes d’usages d’un site"
    ]
  },
  {
    "title": "On appelle lecteur d’écran :",
    "objectifs": [
      "Un logiciel de synthèse vocale qui restitue oralement le contenu de la page et permet d’interagir avec celle-ci."
    ]
  },
  {
    "title": "La démarche qualité prend en compte :",
    "objectifs": [
      "Les outils de traductions automatiques.",
      "Les logiciels d’aide aux personnes en situation de handicap",
      "Les robots d’indexation du contenu.",
      "Les utilisateurs humains."
    ]
  },
  {
    "title": "La démarche qualité repose sur :",
    "objectifs": [
      "La prise en compte du plus grand nombre possible de contextes d’usages."
    ]
  },
  {
    "title": "Les conditions de modération des espaces publics…",
    "objectifs": [
      "sont indiquées."
    ]
  },
  {
    "title": "Le délai de livraison estimé",
    "objectifs": [
      "est indiqué avant la validation définitive de la commande."
    ]
  },
  {
    "title": "Les modalités de récupération d’un bien dématérialisé…",
    "objectifs": [
      "sont précisées avant la commande."
    ]
  },
  {
    "title": "L’adresse du site et de ses sous-domaines…",
    "objectifs": [
      "fonctionnent avec ou sans préfixe www."
    ]
  },
  {
    "title": "Les contenus ou fichiers destinés à des espaces publics…",
    "objectifs": [
      "peuvent être vérifiés avant leur envoi définitif."
    ]
  },
  {
    "title": "Qu’est-ce qu’une taille de caractères fixe ?",
    "objectifs": [
      "Les tailles de caractères fixes sont les unités utilisées dans les feuilles de style CSS pour définir la taille du texte, mais qui ne sont pas destinées à gérer l’affichage à l’écran, mais uniquement sur le media print (impression papier) : le point, le centimètre, le pouce.."
    ]
  },
  {
    "title": "Les informations relatives…",
    "objectifs": [
      "à la zone de livraison des produits ou de réalisation des services sont indiquées."
    ]
  },
  {
    "title": "Les informations destinées à des espaces publics…",
    "objectifs": [
      "peuvent être prévisualisées sous la forme où elles seront affichées."
    ]
  },
  {
    "title": "La page d’accueil…",
    "objectifs": [
      "expose la nature des contenus et services proposés."
    ]
  },
  {
    "title": "La référence de la transaction…",
    "objectifs": [
      "est affichée au client après la validation de sa commande."
    ]
  },
  {
    "title": "Quel est le format utilisé le plus souvent pour un `fil de syndication` ?",
    "objectifs": [
      "Un fil de syndication est un fichier XML. Le format RSS est le plus utilisé."
    ]
  },
  {
    "title": "Un lien de désinscription…",
    "objectifs": [
      "est présent dans chaque newsletter."
    ]
  },
  {
    "title": "Si le site déclare respecter un ou plusieurs standards ou référentiels…",
    "objectifs": [
      "un lien est proposé vers chacun d’entre eux."
    ]
  },
  {
    "title": "La disponibilité des produits…",
    "objectifs": [
      "est indiquée avant la validation définitive de la commande."
    ]
  },
  {
    "title": "Une adresse de livraison…",
    "objectifs": [
      "différente de l’adresse de facturation peut être spécifiée."
    ]
  },
  {
    "title": "Les conditions de fonctionnement du service après-vente (tarifs, horaires, moyens de contact, etc.)…",
    "objectifs": [
      "sont indiquées."
    ]
  },
  {
    "title": "Qu’est-ce que les espaces publics d’un site ?",
    "objectifs": [
      "Contenus dont la rédaction et la publication (immédiate ou bien modérée et différée) sont ouvertes aux visiteurs du site (commentaires, forum, wiki, etc.)."
    ]
  },
  {
    "title": "Les espaces publics…",
    "objectifs": [
      "proposent au moins un moyen de signaler les abus."
    ]
  },
  {
    "title": "Le site propose au moins un moyen de contacter…",
    "objectifs": [
      "le responsable des réclamations."
    ]
  },
  {
    "title": "Un courriel…",
    "objectifs": [
      "indiquant la référence de la transaction et les données de la commande est envoyé suite à la validation."
    ]
  },
  {
    "title": "L’identité de la personne ou du service…",
    "objectifs": [
      "responsable des contenus est indiquée"
    ]
  },
  {
    "title": "Qu’est-ce qu’une icône de favori ? (favicon)",
    "objectifs": [
      "Icône hébergée par un site, associé à un nom de domaine ou de sous-domaine, exploitée par le navigateur pour l’identification du site dans des contextes tels que les onglets, les signets ou favoris, l’historique de navigation, etc."
    ]
  },
  {
    "title": "La charte graphique…",
    "objectifs": [
      "est cohérente sur l’ensemble du site."
    ]
  },
  {
    "title": "Le mode de dépôt et la procédure de traitement des réclamations…",
    "objectifs": [
      "sont indiqués."
    ]
  },
  {
    "title": "Les prix affichés",
    "objectifs": [
      "mentionnent le détail des taxes et suppléments éventuels ainsi que le montant hors taxes"
    ]
  },
  {
    "title": "La désinscription aux newsletters…",
    "objectifs": [
      "est possible depuis le site."
    ]
  },
  {
    "title": "Qu’est-ce qu’une taille de caractères variable ?",
    "objectifs": [
      "Les unités em, le % et les mots-clés CSS."
    ]
  },
  {
    "title": "La racine du site contient…",
    "objectifs": [
      "des instructions pour les robots d’indexation."
    ]
  },
  {
    "title": "Les conditions de vente ou d’utilisation…",
    "objectifs": [
      "sont accessibles depuis toutes les pages."
    ]
  },
  {
    "title": "Le nom du site et/ou le nom de l’auteur…",
    "objectifs": [
      "sont indiqués sur chaque page."
    ]
  },
  {
    "title": "Les nouvelles fenêtres dimensionnées et les fenêtres modales…",
    "objectifs": [
      "sont dotées d’un bouton de fermeture explicite."
    ]
  },
  {
    "title": "Les mécanismes de fermetures de fenêtres…",
    "objectifs": [
      "sont immédiatement disponibles."
    ]
  },
  {
    "title": "Le titre de chaque page permet…",
    "objectifs": [
      "d’identifier le site."
    ]
  },
  {
    "title": "Les mécanismes de fermetures de fenêtres sont affichés…",
    "objectifs": [
      "aux mêmes emplacements sur toutes les pages."
    ]
  },
  {
    "title": "Les mots de passe choisis par l’utilisateur…",
    "objectifs": [
      "admettent les caractères imprimables de la table ASCII."
    ]
  },
  {
    "title": "La durée des contenus vidéo ou audio…",
    "objectifs": [
      "est indiquée."
    ]
  },
  {
    "title": "Le format des fichiers proposés en téléchargement…",
    "objectifs": [
      "est indiqué."
    ]
  },
  {
    "title": "L’utilisateur est…",
    "objectifs": [
      "averti des ouvertures de nouvelles fenêtres."
    ]
  },
  {
    "title": "Les contenus publicitaires ou sponsorisés…",
    "objectifs": [
      "sont identifiés comme tels."
    ]
  },
  {
    "title": "La langue principale de la page cible d’un hyperlien…",
    "objectifs": [
      "est identifiable lorsqu’elle diffère de celle de la page d’origine."
    ]
  },
  {
    "title": "Qu’est-ce qu’un tooltip ?",
    "objectifs": [
      "Information affichée en surimpression du contenu de la page, le plus souvent lors du survol d’un contenu."
    ]
  },
  {
    "title": "Le site est…",
    "objectifs": [
      "intégralement utilisable au clavier."
    ]
  },
  {
    "title": "Qu’est-ce qu’un hyperlien relatif ?",
    "objectifs": [
      "Lien dont l’URL finale dépend de la page ou du contenu dans lequel il est présent."
    ]
  },
  {
    "title": "Chaque lien est doté…",
    "objectifs": [
      "d’un intitulé dans le code source."
    ]
  },
  {
    "title": "Les hyperliens consécutifs…",
    "objectifs": [
      "sont séparés visuellement."
    ]
  },
  {
    "title": "Les mécanismes de fermeture de fenêtres…",
    "objectifs": [
      "sont visuellement rattachées à leur contenu."
    ]
  },
  {
    "title": "Les animations, sons et clignotements…",
    "objectifs": [
      "peuvent être mis en pause."
    ]
  },
  {
    "title": "Les liens provoquant l’ouverture d’un logiciel externe…",
    "objectifs": [
      "ont un libellé explicite."
    ]
  },
  {
    "title": "La navigation au clavier…",
    "objectifs": [
      "s’effectue dans un ordre prévisible."
    ]
  },
  {
    "title": "Les hyperliens de même nature…",
    "objectifs": [
      "ont des couleurs, des formes et des comportements identiques sur toutes les pages."
    ]
  },
  {
    "title": "La langue des fichiers en téléchargement…",
    "objectifs": [
      "est précisée lorsqu’elle diffère de celle de la page d’origine."
    ]
  },
  {
    "title": "Qu’est-ce qu’une splash screen ?",
    "objectifs": [
      "Fenêtre transitoire affichée avant l’accès au contenu cible, nécessitant soit d’attendre sa fermeture automatique soit de procéder à sa fermeture manuelle pour pouvoir consulter le contenu visé."
    ]
  },
  {
    "title": "Le titre de chaque page…",
    "objectifs": [
      "permet d’identifier son contenu."
    ]
  },
  {
    "title": "Qu’est qu’un libellé de lien ?",
    "objectifs": [
      "Contenu textuel final d’un hyperlien (HTML, Flash etc.) tel qu’il est restitué à l’utilisateur."
    ]
  },
  {
    "title": "Le site ne comporte pas…",
    "objectifs": [
      "de liens internes vers des pages en construction."
    ]
  },
  {
    "title": "Tous les hyperliens…",
    "objectifs": [
      "internes du site sont valides."
    ]
  },
  {
    "title": "La taille des fichiers internes proposés en téléchargement…",
    "objectifs": [
      "est indiquée."
    ]
  },
  {
    "title": "Qu’est-ce qu’un Fil d’Ariane ?",
    "objectifs": [
      "Indication de la position courante de la page consultée dans l’arborescence des contenus du site, sous la forme d’une succession de liens partant de l’accueil et reflétant la structure des rubriques et sous-rubriques."
    ]
  },
  {
    "title": "Le site…",
    "objectifs": [
      "n’applique pas le même style aux liens visités et non visités."
    ]
  },
  {
    "title": "L’indicatif international…",
    "objectifs": [
      "est disponible pour tous les numéros de téléphone."
    ]
  },
  {
    "title": "Qu’est-ce qu’Apache ?",
    "objectifs": [
      "Logiciel libre de serveur Web."
    ]
  },
  {
    "title": "L’étiquette de chaque champ de formulaire indique…",
    "objectifs": [
      "le cas échéant, quel format de saisie doit être respecté."
    ]
  },
  {
    "title": "Le serveur envoie une page…",
    "objectifs": [
      "d’interdiction 403 personnalisée."
    ]
  },
  {
    "title": "L’information n’est pas véhiculée…",
    "objectifs": [
      "uniquement par la couleur."
    ]
  },
  {
    "title": "La soumission d’un formulaire est suivie…",
    "objectifs": [
      "d’un message indiquant la réussite ou non de l’action souhaitée."
    ]
  },
  {
    "title": "Le contenu de chaque page est organisé…",
    "objectifs": [
      "selon une structure de titres et sous-titres hiérarchisée."
    ]
  },
  {
    "title": "Qu’est-ce qu’un entête HTTP ?",
    "objectifs": [
      "Information échangée entre le navigateur et le serveur lors de l’accès à une page Web."
    ]
  },
  {
    "title": "Qu’est qu’un élément meta ?",
    "objectifs": [
      "Élément HTML meta (balise en HTML, en XHTML). Il permet d’associer à la page Web une métadonnée définie par son attribut CONTENT."
    ]
  },
  {
    "title": "Les captchas audio…",
    "objectifs": [
      "peuvent être réécoutés à volonté."
    ]
  },
  {
    "title": "Les fonctions de scripts…",
    "objectifs": [
      "internes au site sont placées dans des fichiers externes."
    ]
  },
  {
    "title": "Lors de la saisie d’un formulaire réparti sur plusieurs pages…",
    "objectifs": [
      "un récapitulatif global est affiché avant l’envoi définitif."
    ]
  },
  {
    "title": "L’étiquette de chaque champ de formulaire indique…",
    "objectifs": [
      "si la saisie est obligatoire."
    ]
  },
  {
    "title": "L’étape en cours d’un processus complexe…",
    "objectifs": [
      "est indiquée."
    ]
  },
  {
    "title": "Les captchas…",
    "objectifs": [
      "sont accompagnés d’une solution alternative d’accès."
    ]
  },
  {
    "title": "Les feuilles de style…",
    "objectifs": [
      "du site sont minifiées."
    ]
  },
  {
    "title": "Le menu principal de navigation…",
    "objectifs": [
      "figure sur les pages d’erreur personnalisées."
    ]
  },
  {
    "title": "Qu’est-ce qu’un tooltip ?",
    "objectifs": [
      "Information affichée en surimpression du contenu de la page, le plus souvent lors du survol d’un contenu."
    ]
  },
  {
    "title": "Qu’est-ce qu’un tableau de mise en forme ?",
    "objectifs": [
      "Technique de gestion de l’affichage des contenus de la page reposant sur le détournement des éléments HTML de tableaux de données pour parvenir à une mise en forme selon une grille."
    ]
  },
  {
    "title": "En cas de rejet des données saisies dans un formulaire…",
    "objectifs": [
      "les champs contenant les données rejetées sont indiqués à l’utilisateur."
    ]
  },
  {
    "title": "Qu’est-ce qu’un gestionnaire d’événement ?",
    "objectifs": [
      "Fonctionnalité javascript gérant l’interaction avec un élément HTML selon le type d’action de l’utilisateur : clic, actions au clavier, survol, etc."
    ]
  },
  {
    "title": "Qu’est-ce que la linéarisation du contenu ?",
    "objectifs": [
      "Résultat du rendu final d’une page Web non pas dans l’ordre apparent que l’utilisateur peut déduire de son affichage CSS à l’écran, mais dans l’ordre réel où les contenus qui la composent se trouvent dans son code source."
    ]
  },
  {
    "title": "Qu’est-ce qu’un tableau de données ?",
    "objectifs": [
      "Représentation de séries de données textuelles sous la forme d’un tableau dont les lignes et/ou colonnes se lisent à l’aide de leur(s) en-têtes."
    ]
  },
  {
    "title": "Le code source de chaque page ne contient pas…",
    "objectifs": [
      "d’éléments détournés à des fins de présentation."
    ]
  },
  {
    "title": " Qu’est-ce qu’une page d’erreur 404 ?",
    "objectifs": [
      "Page Web envoyée à l’utilisateur en réponse à une requête entraînant une erreur du type « Ressource non trouvée »."
    ]
  },
  {
    "title": "Les dates…",
    "objectifs": [
      "sont présentées dans des formats explicites."
    ]
  },
  {
    "title": "Qu’est-ce que l’art ASCII ?",
    "objectifs": [
      "Images simulées à l’aide de combinaisons de caractères."
    ]
  },
  {
    "title": "Qu’est-ce qu’un captcha ?",
    "objectifs": [
      "Processus de validation associé en général à un formulaire afin de déjouer les robots et les outils de spam. Les captchas sont des tests de Turing, que seul un humain peut réussir en théorie."
    ]
  },
  {
    "title": "Qu’est-ce qu’un htaccess ?",
    "objectifs": [
      "Fichier de configuration des serveurs Web Apache. Il permet en particulier de définir les droits d’accès, les pages d’erreurs personnalisées et les redirections."
    ]
  },
  {
    "title": "Qu’est-ce qu’Unicode ?",
    "objectifs": [
      "Standard de représentation numérique des caractères."
    ]
  },
  {
    "title": "Les textes pouvant être mis en forme via des styles…",
    "objectifs": [
      "ne sont pas remplacés par des images."
    ]
  },
  {
    "title": "la bonne pratique « Le site accepte au moins deux moyens de paiement » a pour objectif :",
    "objectifs": [
      "Permettre aux utilisateurs de choisir le mode de paiement qui leur convient le mieux dans leur contexte."
    ]
  },
  {
    "title": "La bonne pratique « Les mentions d’appartenance à un ordre ou groupe professionnel, d’un label ou d’une récompense sont accompagnées d’un lien vers la source » a pour objectifs :",
    "objectifs": [
      "Permettre à l’utilisateur de vérifier par lui-même l’information.",
      "Accroître le degré de confiance ou de crédibilité",
      "Donner un accès immédiat à l’utilisateur pour lui permettre de comprendre de quoi il s’agit."
    ]
  },
  {
    "title": "Qu’est-ce qu’une icône de favori ?",
    "objectifs": [
      "Icône hébergée par un site, associé à un nom de domaine ou de sous-domaine, exploitée par le navigateur pour l’identification du site dans des contextes tels que les onglets, les signets ou favoris, l’historique de navigation, etc."
    ]
  },
  {
    "title": "Icône hébergée par un site, associé à un nom de domaine ou de sous-domaine, exploitée par le navigateur pour l’identification du site dans des contextes tels que les onglets, les signets ou favoris, l’historique de navigation, etc.",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier précisément les conditions de l’encaissement."
    ]
  },
  {
    "title": "La bonne pratique « La référence de la transaction est affichée au client après la validation de sa commande » a pour objectif :",
    "objectifs": [
      "Permettre aux utilisateurs d’afficher et éventuellement d’imprimer une trace de leur commande."
    ]
  },
  {
    "title": "La bonne pratique « Un courriel indiquant la référence de la transaction et les données de la commande est envoyé suite à la validation » a pour objectifs :",
    "objectifs": [
      "Donner à l’utilisateur une confirmation des informations relatives à la commande.",
      "Permettre à l’utilisateur de conserver un historique de la transaction ailleurs que dans le site"
    ]
  },
  {
    "title": "La bonne pratique « La modification de la quantité de chaque article, l’ajout et la suppression d’un ou plusieurs articles restent possibles avant la validation définitive de la commande » a pour objectif :",
    "objectifs": [
      "Permettre à l’utilisateur de modifier facilement sa commande."
    ]
  },
  {
    "title": "La bonne pratique « Aucun produit ni service annexe n’est ajouté au panier de commande sans que cette action soit déclenchée par l’utilisateur » a pour objectifs :",
    "objectifs": [
      "Laisser à l’utilisateur le contrôle de sa commande.",
      "Ne pas compromettre la relation de confiance avec l’utilisateur.",
      "Ne pas compromettre la relation de confiance avec l’utilisateur."
    ]
  },
  {
    "title": "Qu’est-ce que la racine du site ?",
    "objectifs": [
      "Répertoire physique sur le serveur directement accessible à partir de l’URL du domaine."
    ]
  },
  {
    "title": "La bonne pratique « La période et les conditions de validité des offres spéciales et promotions sont indiquées » a pour objectif :",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier la période au cours de laquelle ils peuvent bénéficier des offres proposées."
    ]
  },
  {
    "title": "La bonne pratique « Chaque demande d’information fait l’objet d’un accusé de réception » a pour objectifs :",
    "objectifs": [
      "Permettre aux utilisateurs d’obtenir une confirmation archivable de la bonne réception de leur demande d’information.",
      "Informer les utilisateurs de la prise en compte de leur demande."
    ]
  },
  {
    "title": "La bonne pratique « l’achat d’un produit ou service est possible sans création de compte » a pour objectifs :",
    "objectifs": [
      "Augmenter le taux de conversion.",
      "Permettre à l’acheteur de commander immédiatement."
    ]
  },
  {
    "title": "Qu’est-ce qu’une taille de caractères variable ?",
    "objectifs": [
      "Les unités em, le % et les mots-clés CSS."
    ]
  },
  {
    "title": "La bonne pratique « Les informations relatives à la zone de livraison des produits ou de réalisation des services sont indiquées » a pour objectif :",
    "objectifs": [
      "Éviter une navigation et des commandes inutiles, voire une perte de temps pour l’utilisateur ainsi que pour la structure qui propose les biens ou les services."
    ]
  },
  {
    "title": "Quel est le format utilisé le plus souvent pour un fil de syndication ?",
    "objectifs": [
      "Un fil de syndication est un fichier XML. Le format RSS est le plus utilisé."
    ]
  },
  {
    "title": "La bonne pratique « Les horaires et tarifs de fonctionnement des services mis à la disposition des utilisateurs sont indiqués » a pour objectif :",
    "objectifs": [
      "Permettre aux utilisateurs de connaître les services mis à leur disposition et leur fonctionnement."
    ]
  },
  {
    "title": "La bonne pratique « Une adresse de livraison différente de l’adresse de facturation peut être spécifiée » a pour objectif :",
    "objectifs": [
      "Permettre aux utilisateurs de faire livrer un achat sur le lieu de leur choix."
    ]
  },
  {
    "title": "La bonne pratique « Les coordonnées postales et téléphoniques de la représentation locale ou du siège social des sociétés et organisations sont indiquées » a pour objectifs :",
    "objectifs": [
      "Favoriser l’identification de l’entité responsable des contenus et des services.",
      "Fournir un moyen de contact alternatif."
    ]
  },
  {
    "title": "La bonne pratique « Les contenus ou fichiers destinés à des espaces publics peuvent être vérifiés avant leur envoi définitif » a pour objectif :",
    "objectifs": [
      "Permettre à l’utilisateur de vérifier sa saisie en contexte et, si nécessaire, de la corriger avant envoi."
    ]
  },
  {
    "title": "Qu’est-ce qu’un ratio de contraste ?",
    "objectifs": [
      "Indice chiffré reflétant la mesure du niveau de contraste et de luminosité d’un avant-plan (texte le plus souvent) par rapport à son arrière-plan, dans la page Web affichée."
    ]
  },
  {
    "title": "La bonne pratique « Les moyens de paiement acceptés et les procédures correspondantes sont indiqués » a pour objectif :",
    "objectifs": [
      "Permettre aux utilisateurs d’anticiper le mode et les conditions de paiement et de vérifier avant la commande s’ils pourront la mener à son terme."
    ]
  },
  {
    "title": "La bonne pratique « Les conditions de fonctionnement du service après-vente sont indiquées » a pour objectif :",
    "objectifs": [
      "Permettre aux utilisateurs de connaître les conditions d’assistance en cas de difficulté."
    ]
  },
  {
    "title": "La bonne pratique « Les espaces publics proposent au moins un moyen de signaler les abus » a pour objectif :",
    "objectifs": [
      "Limiter les risques de consultation de contenus illégaux ou inappropriés.",
      "Faciliter le signalement de contenus illégaux ou inappropriés."
    ]
  },
  {
    "title": "La bonne pratique « Les prix affichés mentionnent le détail des taxes et suppléments éventuels ainsi que le montant hors taxes » a pour objectifs :",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier précisément les montants déductibles et les différentes imputations.",
      "Permettre aux utilisateurs d’identifier précisément et avant l’achat le montant total qu’ils auront à payer."
    ]
  },
  {
    "title": "La bonne pratique « Les conditions de modération des espaces publics sont indiquées » a pour objectifs :",
    "objectifs": [
      "Limiter le nombre de réclamations des utilisateurs ne voyant pas leur publication apparaître.",
      "Expliquer aux utilisateurs pour quelles raisons et dans quelle mesure leurs publications peuvent être modérées."
    ]
  },
  {
    "title": "Qu’est ce que la syndication ?",
    "objectifs": [
      "Mise à disposition d’un contenu Web au format XML, essentiellement RSS, afin de permettre en particulier sa réutilisation par d’autres sites Web."
    ]
  },
  {
    "title": "La bonne pratique « Le délai de livraison estimé est indiqué avant la validation définitive de la commande » a pour objectif :",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier la date réelle à laquelle le bien commandé sera effectivement en leur possession."
    ]
  },
  {
    "title": "La bonne pratique « La nature et les caractéristiques quantifiables des produits et services sont indiquées » a pour objectif :",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier précisément la nature et les spécifications des produits proposés."
    ]
  },
  {
    "title": "La bonne pratique « Le numéro d’immatriculation délivré aux sociétés ou organisations au terme des procédures légales d’enregistrement en vigueur dans leur pays est indiqué » a pour objectif :",
    "objectifs": [
      "Fournir aux utilisateurs une indication vérifiable de l’existence officielle de la structure qui propose les contenus ou le service."
    ]
  },
  {
    "title": "Qu’est-ce qu’un Whois ?",
    "objectifs": [
      "Service d’information sur les domaines Web."
    ]
  },
  {
    "title": "La bonne pratique « Le site n’applique pas le même style aux liens visités et non visités » a pour objectifs :",
    "objectifs": [
      "Faciliter l’identification des contenus déjà visités.",
      "Faciliter l’identification des contenus restant à découvrir.",
      "Inciter à la navigation sur de nouvelles pages."
    ]
  },
  {
    "title": "La bonne pratique « Les hyperliens consécutifs sont séparés visuellement » a pour objectif :",
    "objectifs": [
      "Éviter les confusions entre deux liens consécutifs."
    ]
  },
  {
    "title": "La bonne pratique « Les contenus publicitaires ou sponsorisés sont identifiés comme tels » a pour objectifs :",
    "objectifs": [
      "Prévenir les risques associés aux conflits d’intérêt.",
      "Permettre une identification immédiate des contenus publicitaires ou sponsorisés.",
      "Éviter les confusions entre contenus rédactionnels et publicitaires."
    ]
  },
  {
    "title": "Qu’est-ce qu’un tooltip ?",
    "objectifs": [
      "Information affichée en surimpression du contenu de la page, le plus souvent lors du survol d’un contenu."
    ]
  },
  {
    "title": "Qu’est-ce qu’une fenêtre surgissante ?",
    "objectifs": [
      "Nouvelle fenêtre du navigateur, généralement de taille réduite imposée, dont l’ouverture est imposée à l’utilisateur en complément de la navigation sur le site et de l’affichage des pages visitées."
    ]
  },
  {
    "title": "Qu’est-ce qu’une Icône de navigation ?",
    "objectifs": [
      "Image-lien de taille réduite dont le graphisme (généralement simplifié) représente une fonctionnalité de navigation dans le site : retour à l’accueil, accès au plan de site, accès à la rubrique parente ou à l’élément précédent, etc."
    ]
  },
  {
    "title": "Qu’est-ce qu’un lien d’accès rapide ?",
    "objectifs": [
      "Liens placés en début du contenu de la page, permettant lors de la navigation clavier d’accéder rapidement aux zones de contenu, de menu ou de recherche sans avoir à parcourir l’ensemble des liens et autres éléments d’interaction qui les précèdent."
    ]
  },
  {
    "title": "La bonne pratique « Le site fournit aux utilisateurs la possibilité de connaître les nouveaux contenus ou services » a pour objectif :",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier immédiatement les nouveaux contenus ou services en ligne."
    ]
  },
  {
    "title": "Qu’est-ce que la langue de traitement d’une page Web ?",
    "objectifs": [
      "Langue dans laquelle sont rédigés par défaut les contenus de la page et dont l’indication est nécessaire en particulier pour les outils de synthèse vocale et de traduction afin de parvenir à un rendu correct."
    ]
  },
  {
    "title": "Qu’est-ce qu’une fenêtre modale ?",
    "objectifs": [
      "Fenêtre simulée en surimpression à l’affichage de la page."
    ]
  },
  {
    "title": "Qu’est-ce qu’une nouvelle fenêtre du navigateur ?",
    "objectifs": [
      "Ouverture du contenu cible d’un lien suite à une action de l’utilisateur dans une nouvelle fenêtre (ou un nouvel onglet) de son navigateur."
    ]
  },
  {
    "title": "Qu’est-ce que l’arborescence du site ?",
    "objectifs": [
      "Organisation apparente des pages du site sous forme de rubriques et de sous-rubriques, telle qu’elle est restituée à l’utilisateur. L’arborescence peut être indépendante de l’organisation réelle des contenus sous forme de répertoires sur le serveur ou via la gestion dans le système de gestion de contenu (CMS)."
    ]
  },
  {
    "title": "La bonne pratique « Si le site propose un espace personnel ou abonné, il est possible de sauvegarder les contenus personnels dans un format standard » a pour objectifs :",
    "objectifs": [
      "Permettre l’archivage des contenus créés par l’utilisateur.",
      "Éviter à l’utilisateur d’éventuelles saisies redoublées en cas de réutilisation des contenus."
    ]
  },
  {
    "title": "La bonne pratique « Le titre de chaque page permet d’identifier le site » a pour objectifs :",
    "objectifs": [
      "Améliorer le référencement du site et sa présentation dans les moteurs de recherche.",
      "Permettre aux utilisateurs d’identifier immédiatement le site dans les onglets, les favoris, dans la fenêtre du navigateur ou encore dans les lecteurs d’écran."
    ]
  },
  {
    "title": "Qu’est-ce qu’une fenêtre dimensionnée ?",
    "objectifs": [
      "Fenêtre de taille réduite ouverte dans le navigateur, dont la largeur et/ou la hauteur sont fixées par un script et imposées à l’utilisateur."
    ]
  },
  {
    "title": "Qu’est-ce qu’un plan de site ?",
    "objectifs": [
      "Page ou ensemble de page dont le contenu reflète l’arborescence des contenus sous forme de listes de liens organisées par rubriques. Le plan de site doit donner accès, directement ou indirectement, à tous les contenus du site."
    ]
  },
  {
    "title": "La bonne pratique « Le survol ou l’activation des hyperliens ne modifie pas la mise en page » a pour objectifs :",
    "objectifs": [
      "Limiter les difficultés à cliquer sur un lien lorsque celui-ci occupe plus d’espace en mode survolé ou activé.",
      "Limiter les effets de clignotement ou de déplacement de contenus lors du survol d’un lien ou de sa prise de focus clavier."
    ]
  },
  {
    "title": "La bonne pratique « Tous les hyperliens internes du site sont valides » a pour objectifs :",
    "objectifs": [
      "Éviter les erreurs 404 en cours de navigation.",
      "Faciliter un accès rapide à tous les contenus."
    ]
  },
  {
    "title": "Qu’est-ce qu’une splash screen ?",
    "objectifs": [
      "Fenêtre transitoire affichée avant l’accès au contenu cible, nécessitant soit d’attendre sa fermeture automatique soit de procéder à sa fermeture manuelle pour pouvoir consulter le contenu visé."
    ]
  },
  {
    "title": "La bonne pratique « Le texte des documents PDF internes est sélectionnable » a pour objectifs :",
    "objectifs": [
      "Permettre le référencement des contenus des documents PDF.",
      "Garantir la lisibilité des contenus des documents PDF.",
      "Faciliter la manipulation et la réutilisation du contenu des documents PDF."
    ]
  },
  {
    "title": "La bonne pratique « Un lexique ou un glossaire adapté au public visé explique le vocabulaire sectoriel ou technique » a pour objectifs :",
    "objectifs": [
      "Améliorer le référencement sur des mots-clés ou expressions techniques.",
      "Faciliter l’utilisation d’un service.",
      "Permettre aux utilisateurs de comprendre les contenus sectoriels ou à caractère technique."
    ]
  },
  {
    "title": "Qu’est-ce qu’un Fil d’Ariane ?",
    "objectifs": [
      "Indication de la position courante de la page consultée dans l\’arborescence des contenus du site, sous la forme d\’une succession de liens partant de l\’accueil et reflétant la structure des rubriques et sous-rubriques."
    ]
  },
  {
    "title": "La bonne pratique « Les hyperliens de même nature ont des couleurs, des formes et des comportements identiques sur toutes les pages » a pour objectifs :",
    "objectifs": [
      "Accélérer l’apprentissage du fonctionnement de l’interface.",
      "Améliorer l’identification des liens et de leurs fonctions respectives."
    ]
  },
  {
    "title": "La bonne pratique « Le site n’impose pas d’interdiction ou de restriction à la mise en place des liens entrants » a pour objectifs :",
    "objectifs": [
      "Augmenter la visibilité du site pour les utilisateurs.",
      "Faciliter le référencement à travers l’obtention de backlinks."
    ]
  },
  {
    "title": "La bonne pratique « La taille des fichiers internes proposés en téléchargement est indiquée » a pour objectifs :",
    "objectifs": [
      "Permettre aux utilisateurs de différer le téléchargement en connexion bas débit ou mobile.",
      "Informer de façon préventive les utilisateurs sur la quantité de données à télécharger."
    ]
  },
  {
    "title": "La bonne pratique « Le titre de chaque page permet d’identifier son contenu » a pour objectifs :",
    "objectifs": [
      "Améliorer le référencement des pages et leur présentation dans les moteurs de recherche",
      "Permettre aux utilisateurs d’identifier immédiatement la nature des contenus de chaque page dans les onglets, les favoris, dans la fenêtre du navigateur ou encore dans les lecteurs d’écran."
    ]
  },
  {
    "title": "Qu’est-ce qu’un hyperlien relatif ?",
    "objectifs": [
      "Lien dont l’URL finale dépend de la page ou du contenu dans lequel il est présent."
    ]
  },
  {
    "title": "Qu’est-ce que le focus clavier ?",
    "objectifs": [
      "Manifestation visuelle de la prise de focus d’un contenu interactif (lien, contrôle ou au champ de formulaire, etc.) lors de la navigation au clavier."
    ]
  },
  {
    "title": "La bonne pratique « Les informations relatives aux droits de copie et de réutilisation sont accessibles depuis toutes les pages » a pour objectifs :",
    "objectifs": [
      "Informer les utilisateurs sur les conditions de copie et de réutilisation.",
      "Informer les utilisateurs sur les conditions sous lesquelles sont publiés les contenus."
    ]
  },
  {
    "title": "Qu’est-ce que la négociation de contenu ?",
    "objectifs": [
      "Echange d’information entre le client et le serveur, via HTTP, permettant de déterminer quel contenu répond aux contraintes exprimées par l’utilisateur via le paramétrage de son navigateur."
    ]
  },
  {
    "title": "Qu’est-ce que l’art ASCII ?",
    "objectifs": [
      "Images simulées à l’aide de combinaisons de caractères."
    ]
  },
  {
    "title": "Qu’est-ce qu’une page d’erreur 403 ?",
    "objectifs": [
      "Page Web envoyée à l’utilisateur en réponse à une requête entraînant une erreur du type « Accès non autorisé »."
    ]
  },
  {
    "title": "La bonne pratique « La soumission d’un formulaire est suivie d’un message indiquant la réussite ou non de l’action souhaitée » a pour objectifs :",
    "objectifs": [
      "Fournir à l’utilisateur un retour immédiat et explicite sur l’action qu’il vient d’effectuer.",
      "Éviter la frustration d’un utilisateur qui pense que le processus s’est déroulé avec succès alors qu’il y a eu un problème."
    ]
  },
  {
    "title": "Qu’est-ce qu’un tableau de mise en forme ?",
    "objectifs": [
      "Technique de gestion de l’affichage des contenus de la page reposant sur le détournement des éléments HTML de tableaux de données pour parvenir à une mise en forme selon une grille."
    ]
  },
  {
    "title": "La bonne pratique « Le code source de chaque page ne contient pas d’éléments détournés à des fins de présentation » a pour objectif :",
    "objectifs": [
      "Permettre l’exploitation pertinente du code source par les agents utilisateurs (les navigateurs, les robots d’indexation des moteurs de recherche, les plages brailles, etc.)."
    ]
  },
  {
    "title": "La bonne pratique « L’information n’est pas véhiculée uniquement par la couleur » a pour objectif :",
    "objectifs": [
      "Permettre l’accès à l’information pour les utilisateurs dont le navigateur, la plateforme, l’aide technique ou encore le handicap (comme le daltonisme) ne permettent pas de visualiser ou de différencier les couleurs."
    ]
  },
  {
    "title": "Qu’est-ce qu’un tooltip ?",
    "objectifs": [
      "Information affichée en surimpression du contenu de la page, le plus souvent lors du survol d’un contenu."
    ]
  },
  {
    "title": "La bonne pratique « Les textes pouvant être mis en forme via des styles ne sont pas remplacés par des images » a pour objectif :",
    "objectifs": [
      "Faciliter l’adaptation du rendu au media (mobile, etc.) ou aux besoins de l’utilisateur (agrandissement de la taille des caractères, modification des couleurs, de la police, de la graisse, de la justification, etc.)."
    ]
  },
  {
    "title": "La bonne pratique « Le contenu et le sens de chaque page ne sont pas altérés lorsque les styles sont désactivés » a pour objectifs :",
    "objectifs": [
      "Permettre la compréhension des contenus par les utilisateurs dont le navigateur n’appliquera pas les feuilles de style du site ou dont le mode d’accès n’est pas visuel.",
      "Séparer rigoureusement les contenus de la présentation pour favoriser leur interopérabilité."
    ]
  },
  {
    "title": "Qu’est-ce qu’une étiquette de formulaire ?",
    "objectifs": [
      "Indication accessible au survol d’un champ de saisie de formulaire, destinée à informer l’utilisateur sur la nature de la saisie attendue ou le rôle du champ."
    ]
  },
  {
    "title": "La bonne pratique « La première occurrence d’une abréviation ou d’un acronyme dans le corps de chaque page donne accès à sa signification » a pour objectifs :",
    "objectifs": [
      "Permettre à l’utilisateur d’accéder rapidement à la signification d’un sigle.",
      "Favoriser le référencement du contenu."
    ]
  },
  {
    "title": "Qu’est-ce qu’Apache ?",
    "objectifs": [
      "Logiciel libre de serveur Web."
    ]
  },
  {
    "title": "Qu’est-ce qu’une page d’erreur 404 ?",
    "objectifs": [
      "Page Web envoyée à l’utilisateur en réponse à une requête entraînant une erreur du type « Ressource non trouvée »."
    ]
  },
  {
    "title": "Qu’est-ce qu’Unicode ?",
    "objectifs": [
      "Standard de représentation numérique des caractères."
    ]
  },
  {
    "title": "Qu’est-ce qu’un jeu de cadres ?",
    "objectifs": [
      "Utilisation des éléments HTML FRAMESET et FRAME pour composer une page Web finale à partir de plusieurs ressources HTML combinées."
    ]
  },
  {
    "title": "La bonne pratique « Chaque contenu audio et vidéo est accompagné de sa transcription textuelle » a pour objectifs :",
    "objectifs": [
      "Permettre aux utilisateurs qui ne peuvent accéder au son ou à l’image proposés d’accéder à une transcription textuelle servant d’alternative.",
      "Permettre l’exploitation de l’information par des robots en améliorant ainsi son indexation et son référencement, ou encore permettre sa traduction par des outils linguistiques en ligne."
    ]
  },
  {
    "title": "Qu’est-ce qu’un tableau de données ?",
    "objectifs": [
      "Représentation de séries de données textuelles sous la forme d’un tableau dont les lignes et/ou colonnes se lisent à l’aide de leur(s) en-têtes."
    ]
  },
  {
    "title": "La bonne pratique « Le codage de caractères utilisé est UTF-8 » a pour objectifs :",
    "objectifs": [
      "Recourir à un jeu de caractères international.",
      "Prévenir les défauts d’affichage."
    ]
  },
  {
    "title": "La bonne pratique « Les dates sont présentées dans des formats explicites » a pour objectif :",
    "objectifs": [
      "Éviter aux utilisateurs les risques de méprise sur le sens d’une date."
    ]
  },
  {
    "title": "La bonne pratique « Les éléments visuellement présentés sous forme de liste sont balisés de façon appropriée dans le code source » a pour objectifs :",
    "objectifs": [
      "Permettre l’identification des listes par les navigateurs et les aides techniques et donc leur restitution appropriée afin de faciliter leur compréhension par les utilisateurs.",
      "Améliorer la sémantique du contenu des pages et sa réutilisabilité."
    ]
  },
  {
    "title": "La bonne pratique « L’emplacement des blocs de navigation est cohérent dans le code source de toutes les pages » a pour objectif :",
    "objectifs": [
      "Faciliter la mémorisation de l’organisation des pages et de la navigation pour les utilisateurs de lecteurs d’écran ou pour ceux naviguant au clavier."
    ]
  },
  {
    "title": "La bonne pratique « En cas de rejet des données saisies dans un formulaire, les raisons du rejet sont indiquées à l’utilisateur » a pour objectifs :",
    "objectifs": [
      "Éviter la frustration de l’utilisateur face à une erreur dont il n’aurait pas la solution immédiate."
    ]
  },
  {
    "title": "Qu’est-ce que la linéarisation du contenu ?",
    "objectifs": [
      "Résultat du rendu final d’une page Web non pas dans l’ordre apparent que l’utilisateur peut déduire de son affichage CSS à l’écran, mais dans l’ordre réel où les contenus qui la composent se trouvent dans son code source."
    ]
  },
  {
    "title": "Qu’est-ce qu’une description étendue ?",
    "objectifs": [
      "Complément de l’alternative textuelle d’une image de contenu, quand il s’agit d’une image véhiculant une information trop complexe pour que l’alternative textuelle suffise à la restituer entièrement."
    ]
  },
  {
    "title": "La bonne pratique « Les captchas audio peuvent être réécoutés à volonté » a pour objectifs :",
    "objectifs": [
      "Faciliter l’accès aux contenus ou services protégés par des captchas pour les utilisateurs ne pouvant exploiter les captchas graphiques ;",
      "Faciliter l’utilisation des captchas audio."
    ]
  },
  {
    "title": "Qu’est qu’un élément meta ?",
    "objectifs": [
      "Élément HTML meta (balise en HTML, en XHTML). Il permet d’associer à la page Web une métadonnée définie par son attribut CONTENT."
    ]
  },
  {
    "title": "La bonne pratique « Le code source de chaque page contient une métadonnée qui définit le jeu de caractères » a pour objectifs :",
    "objectifs": [
      "Prévenir le risque de problèmes d’affichage de caractères lié à un fonctionnement parfois hasardeux des mécanismes de rattrapage des navigateurs quand ils ne disposent pas de l’information nécessaire via l’en-tête HTTP content-type.",
      "Permettre un affichage hors-ligne correct des pages en indiquant au navigateur quel est le jeu de caractères utilisé."
    ]
  },
  {
    "title": "La bonne pratique « Le code source de chaque page débute par une déclaration de type de document dont la syntaxe est conforme à celles recommandées par le W3C » a pour objectifs :",
    "objectifs": [
      "Favoriser un rendu prévisible quel que soit le navigateur (les navigateurs s’appuient sur la syntaxe précise de la DTD pour adopter un mode de rendu CSS).",
      "Faciliter la validation du code source."
    ]
  },
  {
    "title": "La bonne pratique « Les objets inclus sont dotés d’une alternative appropriée » a pour objectifs :",
    "objectifs": [
      "Faciliter l’exploitation de ces contenus par les robots (référencement en particulier).",
      "Fournir un accès à l’information pour les utilisateurs dont le navigateur ou la plateforme ne supporte pas l’inclusion d’objets ou les technologies utilisées dans les objets inclus."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Les liens d’accès aux versions traduites pointent directement vers la traduction de la page courante."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "La navigation sur le site ne provoque pas l’ouverture de fenêtres surgissantes (popups)."
    ]
  },
  {
    "title": "Cochez l’objectif de la bonne pratique « Le soulignement est réservé aux hyperliens » :",
    "objectifs": [
      "Éviter les clics inutiles de la part de l’utilisateur"
    ]
  },
  {
    "title": "Cocher les 2 phrases exactes à propos de l’utilité des bonnes pratiques :",
    "objectifs": [
      "Une bonne pratique doit être utile aux utilisateurs du site.",
      "Une même bonne pratique peut s’appliquer sur des sites différents."
    ]
  },
  {
    "title": "Je suis intégrateur Web (HTML CSS). Les bonnes pratiques me concernent-elles ?",
    "objectifs": [
      "Oui : le choix du balisage approprié, la structuration globale des pages et la construction des styles CSS a notamment un impact important sur le référencement, l’accessibilité et l’adaptation aux médias (desktop, mobile)."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Chaque iframe est doté d’une description."
    ]
  },
  {
    "title": "Je travaille au sein du service juridique de l’entreprise publiant le site :",
    "objectifs": [
      "Il est bon que je connaisse les bonnes pratiques, mais cela ne me dispense pas de vérifier les exigences légales."
    ]
  },
  {
    "title": "Cocher le moyen le plus recommandé pour l’intégration des objectifs qualité dans un cahier des charges :",
    "objectifs": [
      "Intégrer dans le cahier des charges un ensemble choisi de règles qualité précisant les exigences fonctionnelles."
    ]
  },
  {
    "title": "En tant que propriétaire d’une boutique en ligne, le respect de la bonne pratique « Le site accepte au moins deux moyens de paiement » me permet :",
    "objectifs": [
      "De proposer aux utilisateurs de choisir le mode de paiement qui leur convient le mieux dans leur contexte."
    ]
  },
  {
    "title": "Quel problème qualité majeur pose immédiatement ce formulaire ?",
    "objectifs": [
      "L’utilisateur est-il averti du format de saisie de la date ?"
    ]
  },
  {
    "title": "Cocher l’étape du processus de conception où devra en priorité être prise en compte la bonne pratique « Le contenu de chaque page est organisé selon une structure de titres et sous-titres hiérarchisée. » :",
    "objectifs": [
      "Conception des intégrations HTML CSS"
    ]
  },
  {
    "title": "Cocher la phrase exacte à propos du rôle du W3C :",
    "objectifs": [
      "L’objectif du W3C est de conduire le Web à son plein potentiel en développant des protocoles et des recommandations qui garantissent son développement à long terme."
    ]
  },
  {
    "title": "Cocher la définition correcte d’une icône de favori (favicon) :",
    "objectifs": [
      "Icône hébergée sur le site, associée à un nom de domaine ou de sous-domaine, exploitée par le navigateur pour l’identification du site dans les onglets, les signets ou favoris, l’historique de navigation, etc."
    ]
  },
  {
    "title": "Le site d’une société est divisé en 2 parties visuellement distinctes. L’une est la partie e-commerce où sont vendus des produits. L’autre est le blog de la société. Cocher la phrase qui s’applique à ce cas.",
    "objectifs": [
      "Les bonnes pratiques peuvent s’appliquer aux 2 parties du site de la société."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Un plan du site est accessible depuis chaque page."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Si le site est réservé ou destiné à un public spécifique, ce public est mentionné au moins sur la page d’accueil."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Les icônes de navigation sont accompagnées d’une légende explicite."
    ]
  },
  {
    "title": "Cocher la définition correcte du terme Fenêtre modale :",
    "objectifs": [
      "Fenêtre simulée en superposition sur le contenu de la page."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "L’identité de la personne ou du service responsable des contenus est indiquée."
    ]
  },
  {
    "title": "Lorsqu’un prototype prévoit la présence d’un tooltip, il s’agit :",
    "objectifs": [
      "D’une information affichée en surimpression de la page, le plus souvent lors du survol d’un contenu."
    ]
  },
  {
    "title": "Quel problème qualité majeur apparaît immédiatement dans cette fenêtre modale affichant une vue agrandie du produit ?",
    "objectifs": [
      "Un bouton de fermeture explicite est-il présent ?"
    ]
  },
  {
    "title": "Cocher la phrase indiquant pourquoi une partie des critères sont manuels :",
    "objectifs": [
      "Un robot logiciel ne peut pas évaluer des questions de pertinence d’un contenu textuel."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Le site n’emploie pas la technique des jeux de cadres."
    ]
  },
  {
    "title": "Le V de « Visibilité » dans le modèle VPTCS de la qualité Web correspond notamment (2 réponses) :",
    "objectifs": [
      "À la communication sur le site par exemple par voie d’affichage dans le métro.",
      "Au référencement du site (SEO)."
    ]
  },
  {
    "title": "Cocher l’expression définissant l’enjeu de l’évaluation qualité à l’étape du maquettage graphique :",
    "objectifs": [
      "De réduire les risques de non qualité le plus tôt possible au cours du projet."
    ]
  },
  {
    "title": "Je suis responsable projet dans une agence Web. Il est prévu un splash screen à l’affichage de la page d’accueil du futur site. De quoi s’agit-il ?",
    "objectifs": [
      "D’un contenu transitoire affiché avant l’accès à la page nécessitant d’attendre sa fermeture automatique. Il peut comporter des publicités, un sondage, etc."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "L’extension utilisée est cohérente avec l’identité, l’activité, la zone géographique couverte ou avec le nom de domaine."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "La page d’accueil expose la nature des contenus et services proposés."
    ]
  },
  {
    "title": "Cocher la définition correcte d’un template :",
    "objectifs": [
      "Les templates permettent de mutualiser la gestion de la structure des pages."
    ]
  },
  {
    "title": "Cochez la raison pour laquelle la bonne pratique « La durée des contenus vidéo ou audio est indiquée » est utile :",
    "objectifs": [
      "Car, quel que soit son contexte (connexion, matériel, etc.), l’utilisateur doit pouvoir décider en toute connaissance de cause de consulter ou de télécharger ou non le contenu concerné."
    ]
  },
  {
    "title": "Cocher la définition correcte du terme Contenus compressés :",
    "objectifs": [
      "Ressources de type texte (fichiers HTML, CSS, Javascript, XML) qui sont compressées par le serveur avant envoi au client."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Les iframes sont dotés d’un titre explicite."
    ]
  },
  {
    "title": "Cocher la bonne pratique concernant les captchas, qui couvre le risque de non-qualité le plus grave :",
    "objectifs": [
      "Les captchas sont accompagnés d’une solution alternative d’accès."
    ]
  },
  {
    "title": "Cocher la phrase exacte à propos de l’impact du designer sur la qualité du site et des services en ligne :",
    "objectifs": [
      "L’impact des choix graphiques sur la qualité du site ou du service en ligne est majeur, aussi bien en matière d’utilisabilité que de lisibilité."
    ]
  },
  {
    "title": "Cocher la définition correcte du terme Focus clavier :",
    "objectifs": [
      "Manifestation visuelle de la prise de focus d’un contenu interactif (lien, contrôle ou au champ de formulaire, etc.) lors de la navigation au clavier."
    ]
  },
  {
    "title": "Cocher les 2 expressions définissant l’enjeu de l’évaluation qualité à l’étape des templates HTML CSS :",
    "objectifs": [
      "De réduire les risques de non qualité lors de la mise en production.",
      "De déployer via le CMS une structure de contenu sémantique."
    ]
  },
  {
    "title": "Cocher les 4 objectifs majeurs des bonnes pratiques e-commerce :",
    "objectifs": [
      "de réduire les abandons en cours de commande.",
      "d’anticiper le besoin d’information prévisible de l’utilisateur.",
      "de donner à l’utilisateur la maîtrise du contenu de son panier.",
      "de favoriser la relation de confiance avec l’utilisateur."
    ]
  },
  {
    "title": "Cocher les trois mesures qui ajoute de la qualité à l’expérience utilisateur :",
    "objectifs": [
      "Sécurisation des échanges de données sensibles.",
      "Compression et optimisation des ressources adressées au navigateur.",
      "Paramétrage de la gestion de pages d’erreur personnalisée."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "La navigation au clavier s’effectue dans un ordre prévisible."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Chaque numéro de téléphone est indiqué au format international."
    ]
  },
  {
    "title": "En tant que propriétaire d’une boutique en ligne, le respect de la bonne pratique « Les produits indisponibles font l’objet d’une différenciation visuelle et textuelle » me permet :",
    "objectifs": [
      "D’éviter l’effet de déception si un utilisateur débute une procédure de commande et s’aperçoit tardivement de l’indisponibilité du produit désiré."
    ]
  },
  {
    "title": "Cocher la phrase exacte concernant les attentes utilisateur en matière de plan de site :",
    "objectifs": [
      "Le plan de site reste a priori nécessaire même dans le cas d’un mini-site événementiel ou site-vitrine ayant un très petit nombre de pages, dès que toutes les pages internes ne sont pas directement accessibles depuis l’accueil."
    ]
  },
  {
    "title": "Le P de « Perception » dans le modèle VPTCS de la qualité Web correspond notamment (2 réponses) :",
    "objectifs": [
      "À la qualité de contraste et de lisibilité des pages du site sur un écran dans des conditions diverses.",
      "À la cohérence de la charte graphique sur l’ensemble des pages du site."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Chaque page affiche une information permettant de connaître son emplacement dans l’arborescence du site."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Le site ne comporte pas de liens internes vers des pages en construction."
    ]
  },
  {
    "title": "Cocher la définition correcte de la qualité Web :",
    "objectifs": [
      "La qualité Web est l’aptitude d’un service en ligne à satisfaire des exigences implicites ou explicites."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Si toutes les pages du site ne sont pas directement accessibles sur la page d’accueil, un plan du site est accessible sur chaque page."
    ]
  },
  {
    "title": "Quelle question qualité majeure pose immédiatement cette page ?",
    "objectifs": [
      "Quelle est la période de validité de la promotion ?"
    ]
  },
  {
    "title": "Je travaille au sein du service juridique de l’entreprise publiant le site :",
    "objectifs": [
      "Il est bon que je connaisse les bonnes pratiques, mais cela ne me dispense pas de vérifier les exigences légales."
    ]
  },
  {
    "title": "Je décide de m’inscrire à une newsletter. Lorsque j’ai validé le formulaire d’inscription, le site doit :",
    "objectifs": [
      "Afficher une page m’informant qu’un mail de demande de confirmation a été envoyé à l’adresse que j’ai indiquée."
    ]
  },
  {
    "title": "La page d’erreur 404 visible ici répond-elle aux exigences qualité Web ?",
    "objectifs": [
      "Non : il n’est pas possible de poursuivre la navigation sur le site."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Le focus clavier n’est ni supprimé ni masqué."
    ]
  },
  {
    "title": "Cocher les 2 phrases exactes à propos de l’utilité des bonnes pratiques :",
    "objectifs": [
      "Une bonne pratique doit être utile aux utilisateurs du site.",
      "Une même bonne pratique peut s’appliquer sur des sites différents."
    ]
  },
  {
    "title": "Cocher la description du prototypage :",
    "objectifs": [
      "Établit le zonage et les composants types des pages."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Le nom du site et/ou le nom de l’auteur sont indiqués sur chaque page."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "La langue des fichiers en téléchargement est précisée lorsqu’elle diffère de celle de la page d’origine."
    ]
  },
  {
    "title": "Je cherche un restaurant où réserver, avec ma tablette 3G :",
    "objectifs": [
      "Si le site avait respecté la bonne pratique sur le plan de site, j’aurais quand même pu trouver la page des réservations malgré le menu de navigation en Flash."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "L’utilisateur est averti des ouvertures de nouvelles fenêtres."
    ]
  },
  {
    "title": "Le site d’une société est divisé en 2 parties visuellement distinctes. L’une est la partie e-commerce où sont vendus des produits. L’autre est le blog de la société. Cocher la phrase qui s’applique à ce cas.",
    "objectifs": [
      "Les bonnes pratiques peuvent s’appliquer aux 2 parties du site de la société."
    ]
  },
  {
    "title": "Cocher la définition correcte du terme fichier Sitemap :",
    "objectifs": [
      "Représentation au format XML de l’arborescence des contenus d’un site Web, destiné aux robots d’indexation."
    ]
  },
  {
    "title": "Cocher la description de l’intégration :",
    "objectifs": [
      "Produit des gabarits de pages-types au format HTML CSS Javascript."
    ]
  },
  {
    "title": "Quelle question qualité majeure pose immédiatement ce formulaire ?",
    "objectifs": [
      "Les libellés soulignés sont-ils des liens ?"
    ]
  },
  {
    "title": "Cocher les 2 expressions correspondant à un effet des CMS sur la qualité Web :",
    "objectifs": [
      "Séparation des métiers",
      "Industrialisation"
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Si toutes les pages du site ne sont pas directement accessibles depuis le plan du site, un moteur de recherche interne est accessible depuis chaque page."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "La navigation sur le site ne provoque pas l’ouverture de fenêtres surgissantes (popups)."
    ]
  },
  {
    "title": "Cochez la phrase exacte sur ce que favorise l’application des bonnes pratiques qualité sur un site :",
    "objectifs": [
      "L’amélioration de l’expérience utilisateur sur ce site."
    ]
  },
  {
    "title": "En tant que propriétaire d’une boutique en ligne, le respect de la bonne pratique « Le site accepte au moins deux moyens de paiement » me permet :",
    "objectifs": [
      "De proposer aux utilisateurs de choisir le mode de paiement qui leur convient le mieux dans leur contexte."
    ]
  },
  {
    "title": "Quelle question qualité majeure pose immédiatement cette page ?",
    "objectifs": [
      "Tous les liens sont-ils explicites ?"
    ]
  },
  {
    "title": "Pour le propriétaire d’un site, le déclenchement automatique des sons, vidéos et animations au chargement de la page Web :",
    "objectifs": [
      "Est une pratique à proscrire : il faut laisser à l’utilisateur le contrôle de l’interface sonore et visuelle lors de la consultation du site, et ne pas le surprendre avec la diffusion inattendue d’un contenu audio."
    ]
  },
  {
    "title": "Quel problème qualité majeur apparaît immédiatement dans cette fenêtre modale affichant une vue agrandie du produit ?",
    "objectifs": [
      "Un bouton de fermeture explicite est-il présent ?"
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "La langue des fichiers en téléchargement est précisée lorsqu’elle diffère de celle de la page d’origine."
    ]
  },
  {
    "title": "Cocher les trois mesures qui ajoute de la qualité à l’expérience utilisateur :",
    "objectifs": [
      "Paramétrage de la gestion de pages d’erreur personnalisée.",
      "Compression et optimisation des ressources adressées au navigateur.",
      "Sécurisation des échanges de données sensibles."
    ]
  },
  {
    "title": "Je suis responsable projet dans une agence Web. Il est prévu un splash screen à l’affichage de la page d’accueil du futur site. De quoi s’agit-il ?",
    "objectifs": [
      "D’un contenu transitoire affiché avant l’accès à la page nécessitant d’attendre sa fermeture automatique. Il peut comporter des publicités, un sondage, etc."
    ]
  },
  {
    "title": "Cocher la définition correcte du terme Fenêtre modale :",
    "objectifs": [
      "Fenêtre simulée en superposition sur le contenu de la page."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "L’identité de la personne ou du service responsable des contenus est indiquée."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "La page d’accueil expose la nature des contenus et services proposés."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "L’extension utilisée est cohérente avec l’identité, l’activité, la zone géographique couverte ou avec le nom de domaine."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Les liens d’accès aux versions traduites pointent directement vers la traduction de la page courante."
    ]
  },
  {
    "title": "Cocher les 3 bonnes pratiques évaluables lors de la validation éditoriale :",
    "objectifs": [
      "Le site n’interdit pas la mise en place de liens entrants.",
      "Le format des fichiers proposés en téléchargement est indiqué.",
      "Le titre de chaque page permet d’identifier son contenu."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Si toutes les pages du site ne sont pas directement accessibles sur la page d’accueil, un plan du site est accessible sur chaque page."
    ]
  },
  {
    "title": "Je décide de m’inscrire à une newsletter. Lorsque j’ai validé le formulaire d’inscription, le site doit :",
    "objectifs": [
      "Afficher une page m’informant qu’un mail de demande de confirmation a été envoyé à l’adresse que j’ai indiquée."
    ]
  },
  {
    "title": "Je cherche un restaurant où réserver, avec ma tablette 3G :",
    "objectifs": [
      "Si le site avait respecté la bonne pratique sur le plan de site, j’aurais quand même pu trouver la page des réservations malgré le menu de navigation en Flash."
    ]
  },
  {
    "title": "Cocher la définition correcte d’un template :",
    "objectifs": [
      "Les templates permettent de mutualiser la gestion de la structure des pages."
    ]
  },
  {
    "title": "Cocher la définition correcte du terme Lien d’accès rapide :",
    "objectifs": [
      "Liens placés en début du contenu de la page, permettant lors de la navigation clavier d’accéder rapidement aux zones de contenu, de menu ou de recherche sans avoir à parcourir l’ensemble des liens et autres éléments d’interaction qui les précèdent."
    ]
  },
  {
    "title": "Quelle est la véritable bonne pratique, utile, universelle, réaliste, vérifiable et consensuelle ?",
    "objectifs": [
      "Chaque page affiche une information permettant de connaître son emplacement dans l’arborescence du site."
    ]
  },
  {
    "title": "Quelle question qualité majeure pose immédiatement cette page ?",
    "objectifs": [
      "Quelle est la période de validité de la promotion ?"
    ]
  },
  {
    "title": "Cocher la définition correcte de la qualité Web :",
    "objectifs": [
      "La qualité Web est l’aptitude d’un service en ligne à satisfaire des exigences implicites ou explicites."
    ]
  },
  {
    "title": "Quelle question qualité majeure pose immédiatement cette page produit ?",
    "objectifs": [
      "La période et les conditions de validité des offres spéciales et promotions sont-elles indiquées ?"
    ]
  },
  {
    "title": "La période et les conditions de validité des offres spéciales et promotions sont-elles indiquées ?",
    "objectifs": [
      "D’identifier la date réelle à laquelle le bien commandé pourra être en ma possession."
    ]
  },
  {
    "title": "Le P de « Perception » dans le modèle VPTCS de la qualité Web correspond notamment (2 réponses) :",
    "objectifs": [
      "À la cohérence de la charte graphique sur l’ensemble des pages du site.",
      "À la qualité de contraste et de lisibilité des pages du site sur un écran dans des conditions diverses."
    ]
  },
  {
    "title": "La bonne pratique « Le site n’impose pas de redirection ou de rafraîchissement automatique côté client » a pour objectifs :",
    "objectifs": [
      "Permettre aux utilisateurs de conserver la maîtrise de leur environnement de travail.",
      "Éviter des coupures ou des pertes d’information en cours de lecture, notamment pour les utilisateurs équipés de lecteurs d’écran qu’un rafraîchissement ou une redirection temporisée interromprait lors de la consultation."
    ]
  },
  {
    "title": "La désinscription aux newsletters…",
    "objectifs": [
      "est possible depuis le site."
    ]
  },
  {
    "title": "La bonne pratique « Le site fournit aux utilisateurs la possibilité de connaître les nouveaux contenus ou services » a pour objectif :",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier immédiatement les nouveaux contenus ou services en ligne."
    ]
  },
  {
    "title": "Je travaille au sein du service juridique de l’entreprise publiant le site :",
    "objectifs": [
      "Il est bon que je connaisse les bonnes pratiques, mais cela ne me dispense pas de vérifier les exigences légales."
    ]
  },
  {
    "title": "Lorsqu’un prototype prévoit la présence d’un tooltip, il s’agit :",
    "objectifs": [
      "D’une information affichée en surimpression de la page, le plus souvent lors du survol d’un contenu."
    ]
  },
  {
    "title": "Qu’est-ce que la minification d’un fichier ?",
    "objectifs": [
      "Réduction de la taille des fichiers textes de type CSS et javascript, obtenue par la suppression des commentaires et la réduction a minima de la syntaxe."
    ]
  },
  {
    "title": "La bonne pratique « Les hyperliens de même nature ont des couleurs, des formes et des comportements identiques sur toutes les pages » a pour objectifs :",
    "objectifs": [
      "Améliorer l’identification des liens et de leurs fonctions respectives.",
      "Accélérer l’apprentissage du fonctionnement de l’interface."
    ]
  },
  {
    "title": "Cocher les 2 expressions définissant l’enjeu de l’évaluation qualité à l’étape des templates HTML CSS :",
    "objectifs": [
      "De réduire les risques de non qualité lors de la mise en production.",
      "De déployer via le CMS une structure de contenu sémantique."
    ]
  },
  {
    "title": "Cocher les 3 qualificatifs et expressions qui caractérisent la démarche de qualité Web :",
    "objectifs": [
      "Exigences mesurables.",
      "Approche transversale à travers les différents métiers",
      "Transformation d’exigences génériques en critères objectifs."
    ]
  },
  {
    "title": "La bonne pratique « Le titre de chaque page permet d’identifier son contenu » a pour objectifs :",
    "objectifs": [
      "Améliorer le référencement des pages et leur présentation dans les moteurs de recherche",
      "Permettre aux utilisateurs d’identifier immédiatement la nature des contenus de chaque page dans les onglets, les favoris, dans la fenêtre du navigateur ou encore dans les lecteurs d’écran."
    ]
  },
  {
    "title": " Permettre aux utilisateurs d’identifier immédiatement la nature des contenus de chaque page dans les onglets, les favoris, dans la fenêtre du navigateur ou encore dans les lecteurs d’écran.",
    "objectifs": [
      "Favoriser le référencement du contenu.",
      "Permettre à l’utilisateur d’accéder rapidement à la signification d’un sigle."
    ]
  },
  {
    "title": "La bonne pratique « Un courriel indiquant la référence de la transaction et les données de la commande est envoyé suite à la validation » a pour objectifs :",
    "objectifs": [
      "Permettre à l’utilisateur de conserver un historique de la transaction ailleurs que dans le site",
      "Donner à l’utilisateur une confirmation des informations relatives à la commande."
    ]
  },
  {
    "title": "La bonne pratique « Les contenus ou fichiers destinés à des espaces publics peuvent être vérifiés avant leur envoi définitif » a pour objectif :",
    "objectifs": [
      "Permettre à l’utilisateur de vérifier sa saisie en contexte et, si nécessaire, de la corriger avant envoi."
    ]
  },
  {
    "title": "Qu’est-ce qu’un captcha ?",
    "objectifs": [
      "Processus de validation associé en général à un formulaire afin de déjouer les robots et les outils de spam. Les captchas sont des tests de Turing, que seul un humain peut réussir en théorie."
    ]
  },
  {
    "title": "La bonne pratique « Une adresse de livraison différente de l’adresse de facturation peut être spécifiée » a pour objectif :",
    "objectifs": [
      "Permettre aux utilisateurs de faire livrer un achat sur le lieu de leur choix."
    ]
  },
  {
    "title": "La bonne pratique « Les dates sont présentées dans des formats explicites » a pour objectif :",
    "objectifs": [
      "Éviter aux utilisateurs les risques de méprise sur le sens d’une date."
    ]
  },
  {
    "title": "La bonne pratique « La période et les conditions de validité des offres spéciales et promotions sont indiquées » a pour objectif :",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier la période au cours de laquelle ils peuvent bénéficier des offres proposées."
    ]
  },
  {
    "title": "La bonne pratique « Tous les hyperliens internes du site sont valides » a pour objectifs :",
    "objectifs": [
      "Éviter les erreurs 404 en cours de navigation.",
      "Faciliter un accès rapide à tous les contenus."
    ]
  },
  {
    "title": "La bonne pratique « La nature et les caractéristiques quantifiables des produits et services sont indiquées » a pour objectif :",
    "objectifs": [
      "La bonne pratique « La nature et les caractéristiques quantifiables des produits et services sont indiquées » a pour objectif :"
    ]
  },
  {
    "title": "La bonne pratique « Si le site propose un espace personnel ou abonné, il est possible de sauvegarder les contenus personnels dans un format standard » a pour objectifs :",
    "objectifs": [
      "Éviter à l’utilisateur d’éventuelles saisies redoublées en cas de réutilisation des contenus.",
      "Permettre l’archivage des contenus créés par l’utilisateur."
    ]
  },
  {
    "title": "La bonne pratique « L’emplacement des blocs de navigation est cohérent dans le code source de toutes les pages » a pour objectif :",
    "objectifs": [
      "Faciliter la mémorisation de l’organisation des pages et de la navigation pour les utilisateurs de lecteurs d’écran ou pour ceux naviguant au clavier."
    ]
  },
  {
    "title": "Qu’est-ce qu’une transcription textuelle ?",
    "objectifs": [
      "Contenu textuel associé à des objets non textuels inclus dans la page (infographies, vidéos, contenus audios) et équivalent à ceux-ci en terme d’information."
    ]
  },
  {
    "title": "En tant que propriétaire d’une boutique en ligne, le respect de la bonne pratique « Les produits indisponibles font l’objet d’une différenciation visuelle et textuelle » me permet :",
    "objectifs": [
      "D’éviter l’effet de déception si un utilisateur débute une procédure de commande et s’aperçoit tardivement de l’indisponibilité du produit désiré."
    ]
  },
  {
    "title": "Qu’est-ce qu’un lien d’accès rapide ?",
    "objectifs": [
      "Liens placés en début du contenu de la page, permettant lors de la navigation clavier d’accéder rapidement aux zones de contenu, de menu ou de recherche sans avoir à parcourir l’ensemble des liens et autres éléments d’interaction qui les précèdent."
    ]
  },
  {
    "title": "Cocher le moyen le plus recommandé pour l’intégration des objectifs qualité dans un cahier des charges :",
    "objectifs": [
      "Intégrer dans le cahier des charges un ensemble choisi de règles qualité précisant les exigences fonctionnelles."
    ]
  },
  {
    "title": "La bonne pratique « Les captchas audio peuvent être réécoutés à volonté » a pour objectifs :",
    "objectifs": [
      "Faciliter l’accès aux contenus ou services protégés par des captchas pour les utilisateurs ne pouvant exploiter les captchas graphiques ;",
      "Faciliter l’utilisation des captchas audio."
    ]
  },
  {
    "title": "La phrase « La distinction visuelle des liens doit être vérifiée pour la première fois lors de la phase de développement » est-elle vraie ou fausse ?",
    "objectifs": [
      "Faux, c’est en phase de design, voire de prototypage."
    ]
  },
  {
    "title": "La bonne pratique « Le texte des documents PDF internes est sélectionnable » a pour objectifs :",
    "objectifs": [
      "Garantir la lisibilité des contenus des documents PDF.",
      "Faciliter la manipulation et la réutilisation du contenu des documents PDF.",
      "Permettre le référencement des contenus des documents PDF."
    ]
  },
  {
    "title": "Pour le propriétaire d’un site, le déclenchement automatique des sons, vidéos et animations au chargement de la page Web :",
    "objectifs": [
      "Est une pratique à proscrire : il faut laisser à l’utilisateur le contrôle de l’interface sonore et visuelle lors de la consultation du site, et ne pas le surprendre avec la diffusion inattendue d’un contenu audio."
    ]
  },
  {
    "title": "Qu’est-ce qu’un jeu de cadres ?",
    "objectifs": [
      "Utilisation des éléments HTML FRAMESET et FRAME pour composer une page Web finale à partir de plusieurs ressources HTML combinées."
    ]
  },
  {
    "title": "Qu’est-ce qu’un Whois ?",
    "objectifs": [
      "Service d’information sur les domaines Web."
    ]
  },
  {
    "title": "La bonne pratique « Chaque demande d’information fait l’objet d’un accusé de réception » a pour objectifs :",
    "objectifs": [
      "Informer les utilisateurs de la prise en compte de leur demande.",
      "Permettre aux utilisateurs d’obtenir une confirmation archivable de la bonne réception de leur demande d’information."
    ]
  },
  {
    "title": "Qu’est-ce qu’un contenu compressé ?",
    "objectifs": [
      "Ressources de type texte (fichiers HTML, CSS, javascript, XML) qui sont compressés par le serveur avant envoi au navigateur, qui les décompresse avant de les exécuter ou de les afficher."
    ]
  },
  {
    "title": "Je suis responsable projet dans une agence Web. Il est prévu un splash screen à l’affichage de la page d’accueil du futur site. De quoi s’agit-il ?",
    "objectifs": [
      "D’un contenu transitoire affiché avant l’accès à la page nécessitant d’attendre sa fermeture automatique. Il peut comporter des publicités, un sondage, etc."
    ]
  },
  {
    "title": "Pour le propriétaire d’un site, le déclenchement automatique des sons, vidéos et animations au chargement de la page Web :",
    "objectifs": [
      "Est une pratique à proscrire : il faut laisser à l’utilisateur le contrôle de l’interface sonore et visuelle lors de la consultation du site, et ne pas le surprendre avec la diffusion inattendue d’un contenu audio."
    ]
  },
  {
    "title": "La bonne pratique « Les espaces publics proposent au moins un moyen de signaler les abus » a pour objectif :",
    "objectifs": [
      "Faciliter le signalement de contenus illégaux ou inappropriés.",
      "Limiter les risques de consultation de contenus illégaux ou inappropriés."
    ]
  },
  {
    "title": "La bonne pratique « Le contenu et le sens de chaque page ne sont pas altérés lorsque les styles sont désactivés » a pour objectifs :",
    "objectifs": [
      "Permettre la compréhension des contenus par les utilisateurs dont le navigateur n’appliquera pas les feuilles de style du site ou dont le mode d’accès n’est pas visuel.",
      "Séparer rigoureusement les contenus de la présentation pour favoriser leur interopérabilité."
    ]
  },
  {
    "title": "La bonne pratique « L’information n’est pas véhiculée uniquement par la couleur » a pour objectif :",
    "objectifs": [
      "Permettre l’accès à l’information pour les utilisateurs dont le navigateur, la plateforme, l’aide technique ou encore le handicap (comme le daltonisme) ne permettent pas de visualiser ou de différencier les couleurs."
    ]
  },
  {
    "title": "Je décide de m’inscrire à une newsletter. Lorsque j’ai validé le formulaire d’inscription, le site doit :",
    "objectifs": [
      "Afficher une page m’informant qu’un mail de demande de confirmation a été envoyé à l’adresse que j’ai indiquée."
    ]
  },
  {
    "title": "Qu’est-ce qu’une alternative textuelle ?",
    "objectifs": [
      "Contenu fourni en alternative aux ressources non textuelles : images, boutons graphiques, objets flash, etc. L’alternative sera utilisé par le navigateur ou l’aide technique (lecteur d’écran par exemple) quand ces ressources ne peuvent pas être restituées afin de reproduire l’information apportée par celles-ci."
    ]
  },
  {
    "title": "La bonne pratique « Les éléments visuellement présentés sous forme de liste sont balisés de façon appropriée dans le code source » a pour objectifs :",
    "objectifs": [
      "Améliorer la sémantique du contenu des pages et sa réutilisabilité.",
      "Permettre l’identification des listes par les navigateurs et les aides techniques et donc leur restitution appropriée afin de faciliter leur compréhension par les utilisateurs."
    ]
  },
  {
    "title": "Cocher la définition correcte de la qualité Web :",
    "objectifs": [
      "La qualité Web est l’aptitude d’un service en ligne à satisfaire des exigences implicites ou explicites."
    ]
  },
  {
    "title": "Je suis designer Web : les bonnes pratiques me concernent-elles ?",
    "objectifs": [
      "Oui : je dois veiller d’une part à éviter certaines erreurs proprement graphiques et mes choix ont d’autre part des conséquences sur la réalisation technique lors de l’intégration."
    ]
  },
  {
    "title": "La bonne pratique « Les captchas sont accompagnés d’une solution alternative d’accès » a pour objectif :",
    "objectifs": [
      "Permettre aux utilisateurs qui ont des difficultés à déchiffrer les images des captchas graphiques ou qui ne peuvent pas les utiliser, d’accéder par un autre moyen aux contenus ou services protégés."
    ]
  },
  {
    "title": "Cocher l’étape du processus de conception où devra en priorité être prise en compte la bonne pratique « Le contenu de chaque page est organisé selon une structure de titres et sous-titres hiérarchisée. » :",
    "objectifs": [
      "Conception des intégrations HTML CSS"
    ]
  },
  {
    "title": "Cocher l’étape du processus de conception où devra en priorité être prise en compte la bonne pratique « Les contenus sont présentés avec un contraste suffisant par rapport à leur arrière-plan » :",
    "objectifs": [
      "Conception des maquettes graphiques"
    ]
  },
  {
    "title": "La bonne pratique « Aucun produit ni service annexe n’est ajouté au panier de commande sans que cette action soit déclenchée par l’utilisateur » a pour objectifs :",
    "objectifs": [
      "Laisser à l’utilisateur le contrôle de sa commande.",
      "Ne pas compromettre la relation de confiance avec l’utilisateur.",
      "Éviter toute forme de vente forcée."
    ]
  },
  {
    "title": "La bonne pratique « Le contenu de chaque page est organisé selon une structure de titres et sous-titres hiérarchisée » a pour objectifs :",
    "objectifs": [
      "Permettre aux machines et aux outils d’indexation d’extraire le plan de chaque page.",
      "Permettre aux utilisateurs qui le souhaitent de visualiser la structure du contenu de la page et d’y naviguer."
    ]
  },
  {
    "title": "La bonne pratique « Les hyperliens consécutifs sont séparés visuellement » a pour objectif :",
    "objectifs": [
      "Éviter les confusions entre deux liens consécutifs."
    ]
  },
  {
    "title": "Les nouvelles fenêtres dimensionnées et les fenêtres modales…",
    "objectifs": [
      "sont dotées d’un bouton de fermeture explicite."
    ]
  },
  {
    "title": "La bonne pratique « Le code source de chaque page contient une métadonnée qui définit le jeu de caractères » a pour objectifs :",
    "objectifs": [
      "Permettre un affichage hors-ligne correct des pages en indiquant au navigateur quel est le jeu de caractères utilisé.",
      "Prévenir le risque de problèmes d’affichage de caractères lié à un fonctionnement parfois hasardeux des mécanismes de rattrapage des navigateurs quand ils ne disposent pas de l’information nécessaire via l’en-tête HTTP content-type."
    ]
  },
  {
    "title": "Qu’est-ce qu’un fichier sitemap ?",
    "objectifs": [
      "Représentation au format XML de l’arborescence des contenus d’un site Web, destiné aux robots d’indexation."
    ]
  },
  {
    "title": "La navigation au clavier…",
    "objectifs": [
      "s’effectue dans un ordre prévisible."
    ]
  },
  {
    "title": "La bonne pratique « Le délai de livraison estimé est indiqué avant la validation définitive de la commande » a pour objectif :",
    "objectifs": [
      "Permettre aux utilisateurs d’identifier la date réelle à laquelle le bien commandé sera effectivement en leur possession."
    ]
  },
  {
    "title": "Qu’est-ce qu’une étiquette de formulaire ?",
    "objectifs": [
      "Indication affichée en association avec un champ de saisie de formulaire, destinée à informer l’utilisateur sur la nature de la saisie attendue ou le rôle du champ.",
      "Indication accessible au survol d’un champ de saisie de formulaire, destinée à informer l’utilisateur sur la nature de la saisie attendue ou le rôle du champ."
    ]
  },
  {
    "title": "La bonne pratique « Les contenus publicitaires ou sponsorisés sont identifiés comme tels » a pour objectifs :",
    "objectifs": [
      "Prévenir les risques associés aux conflits d’intérêt.",
      "Éviter les confusions entre contenus rédactionnels et publicitaires.",
      "Prévenir les risques associés aux conflits d’intérêt."
    ]
  },
  {
    "title": "Qu’est-ce qu’un Fil d’Ariane ?",
    "objectifs": [
      "Indication de la position courante de la page consultée dans l’arborescence des contenus du site, sous la forme d’une succession de liens partant de l’accueil et reflétant la structure des rubriques et sous-rubriques."
    ]
  },
  {
    "title": "La bonne pratique « Le code source de chaque page ne contient pas d’éléments ou d’attributs de présentation » a pour objectifs :",
    "objectifs": [
      "Favoriser l’adaptation de la mise en forme des contenus par les agents utilisateurs, selon les besoins de l’utilisateur.",
      "Réduire le poids du code source des pages, en incitant à mutualiser et à externaliser les informations de mise en forme grâce à CSS."
    ]
  },
  {
    "title": "La bonne pratique « Le site propose au moins deux moyens de contact » a pour objectifs :",
    "objectifs": [
      "Optimiser les possibilités de retour d’information de la part des utilisateurs.",
      "Éviter de mettre l’utilisateur en difficulté en cas d’indisponibilité ou de problèmes d’utilisation d’un moyen de contact."
    ]
  },
  {
    "title": "La bonne pratique « Chaque contenu audio et vidéo est accompagné de sa transcription textuelle » a pour objectifs :",
    "objectifs": [
      "Permettre aux utilisateurs qui ne peuvent accéder au son ou à l’image proposés d’accéder à une transcription textuelle servant d’alternative.",
      "Permettre l’exploitation de l’information par des robots en améliorant ainsi son indexation et son référencement, ou encore permettre sa traduction par des outils linguistiques en ligne."
    ]
  },
  {
    "title": "L’objectif des cookies et les limitations inhérentes à leurs refus sont expliqués. Parmi les affirmations suivantes, laquelle est exacte ?",
    "objectifs": [
      "Parce que l’utilisateur est en droit d’être informé sur les informations qui sont écrites par un site Web sur son poste de travail."
    ]
  },
  {
    "title": "Choisir l’affirmation exacte concernant l’ouverture d’une nouvelle fenêtre au clic :",
    "objectifs": [
      "Déclencher l’ouverture d’une nouvelle fenêtre au clic, c’est possible mais en le signalant aux usagers."
    ]
  },
  {
    "title": "La bonne pratique concernant la validité des hyperliens concerne seulement les liens internes, pourquoi ?",
    "objectifs": [
      "Parce qu’il est impossible de garantir le fonctionnement d’un lien externe, ne serait-ce que parce que le serveur distant peut être indisponible temporairement."
    ]
  },
  {
    "title": "En tant qu’utilisateur, lorsque j’arrive sur une page d’erreur personnalisée où figure le menu principal de navigation :",
    "objectifs": [
      "Cela me permet de reprendre la navigation directement."
    ]
  },
  {
    "title": "Quel est l’ordre des étapes du processus classique de conception Web ?",
    "objectifs": [
      "1. Prototypage 2. Design des pages types 3. Intégration des gabarits 4. Développement dans le CMS 5. Production du contenu éditorial"
    ]
  },
  {
    "title": "Cocher la définition correcte du terme Fenêtre modale :",
    "objectifs": [
      "Fenêtre simulée en superposition sur le contenu de la page."
    ]
  },
  {
    "title": "La proposition suivante est-elle admissible comme bonne pratique Opquast « Le site est déclaré à la CNIL » :",
    "objectifs": [
      "Non, cette bonne pratique serait uniquement valable en France."
    ]
  },
  {
    "title": "La qualité principale d’une page d’erreur 404 personnalisée respectueuse des différentes bonnes pratiques concernés est :",
    "objectifs": [
      "De fournir à l’utilisateur au moins un moyen de poursuivre immédiatement sa navigation dans le site."
    ]
  },
  {
    "title": "Je suis responsable projet dans une agence Web. Il est prévu une splash screen à l’affichage de la page d’accueil du futur site. De quoi s’agit-il ?",
    "objectifs": [
      "D’un contenu transitoire affiché avant l’accès à la page (publicité, sondage, etc.)"
    ]
  },
  {
    "title": "La bonne pratique « Le code source de chaque page indique la langue principale du contenu »est importante car…",
    "objectifs": [
      "Cela permet à tous les outils de traduction automatiques et moteurs de recherche de savoir dans quelle langue la page est-elle écrite."
    ]
  },
  {
    "title": "Après que j’ai validé ma commande sur une boutique en ligne, les bonnes pratiques Opquast demandent que :",
    "objectifs": [
      "Je reçoive un email me rappelant la référence de la transaction et les données de la commande.",
      "Le site m’affiche la référence de la transaction"
    ]
  },
  {
    "title": "Pour un utilisateur, la bonne pratique « Il est possible de revenir à la page d’accueil depuis toutes les pages » serait-elle utile ?",
    "objectifs": [
      "Oui, pour permettre aux utilisateurs d’atteindre facilement la page qui identifie le site et sa nature."
    ]
  },
  {
    "title": "La bonne pratique « L’information n’est pas véhiculée uniquement par la couleur » a pour conséquence :",
    "objectifs": [
      "De veiller à ce qu’un moyen complémentaire soit systématiquement utilisé en renfort de la couleur, pour que l’information soit perçue dans tous les contextes utilisateurs."
    ]
  },
  {
    "title": "Qu’est-ce qu’une alternative textuelle ?",
    "objectifs": [
      "Un contenu fourni en alternative aux ressources non textuelles, utilisé par le navigateur ou l’aide technique pour reproduire l’information apportée par celles-ci."
    ]
  },
  {
    "title": "Qu’est-ce qu’Apache ?",
    "objectifs": [
      "Un logiciel libre de serveur web."
    ]
  },
  {
    "title": "L’arborescence du site désigne :",
    "objectifs": [
      "L’organisation apparente des pages du site sous forme de rubriques et de sous-rubriques, telle qu’elle est restituée à l’utilisateur."
    ]
  },
  {
    "title": "Qu’est-ce qu’un cadre ?",
    "objectifs": [
      "L’utilisation des éléments HTML frame ou iframe."
    ]
  },
  {
    "title": "Qu’est-ce qu’un captcha ?",
    "objectifs": [
      "Une question sous forme graphique, sonore ou logique, destinée à déjouer les robots et les outils de spam."
    ]
  },
  {
    "title": "Qu’est-ce qu’un CMS ?",
    "objectifs": [
      "Une application serveur utilisée via une interface en ligne, qui permet à une équipe éditoriale de concevoir un site Web et d’en créer le contenu."
    ]
  },
  {
    "title": "Qu’est-ce qu’une description étendue (description longue) ?",
    "objectifs": [
      "Un complément de l’alternative textuelle d’une image complexe."
    ]
  },
  {
    "title": "Qu’est-ce qu’un en-tête HTTP ?",
    "objectifs": [
      "Une information échangée entre le client et le serveur dans le cadre du protocole HTTP, lors de l’accès à une page Web."
    ]
  },
  {
    "title": "L’indication dans le code HTML de la (ou des) langue(s) dans lesquelles sont rédigés les contenus :",
    "objectifs": [
      "Permet une lecture correcte du contenu par un outil de synthèse vocale.",
      "Facilite la traduction automatique.",
      "Favorise l’indexation des contenus par les moteurs de recherche (Google)."
    ]
  },
  {
    "title": "La transcription textuelle des sons et vidéos a une valeur ajoutée pour :",
    "objectifs": [
      "Les non-voyants, malentendants, les outils d’indexation et même tous les autres publics."
    ]
  },
  {
    "title": " Je cherche un restaurant où réserver, avec ma tablette 3G :",
    "objectifs": [
      "Si le site avait respecté la bonne pratique sur le plan de site, j’aurais quand même pu trouver la page des réservations malgré le menu de navigation en Flash."
    ]
  },
  {
    "title": "Je suis chef de projet Web. Mon travail en matière de qualité consiste d’abord et avant tout",
    "objectifs": [
      "À veiller tout au long du projet à l’utilisation du référentiel qualité, en favorisant son appropriation par les différents intervenants métiers."
    ]
  },
  {
    "title": "Ma grand-mère veut utiliser Amazon et Twitter :",
    "objectifs": [
      "La qualité Web, c’est aussi aider ma grand mère avec des formulaires plus explicites, de l’assistance en cas d’erreur et un site mieux contrasté et plus lisible."
    ]
  },
  {
    "title": "Le principal objectif de la démarche qualité Web :",
    "objectifs": [
      "La qualité de l’ensemble de l’expérience utilisateur."
    ]
  },
  {
    "title": "Qu’est qu’une page d’erreur 403 ?",
    "objectifs": [
      "Une page web envoyée à l’utilisateur en réponse à une requête entraînant une erreur du type « Accès non autorisé »."
    ]
  },
  {
    "title": "Qu’est-ce qu’une fenêtre dimensionnée ?",
    "objectifs": [
      "Fenêtre de taille réduite ouverte dans le navigateur, dont la largeur et/ou la hauteur sont fixées par un script et imposées à l’utilisateur."
    ]
  },
  {
    "title": "Qu’est-ce qu’un gestionnaire d’événement ?",
    "objectifs": [
      "Une fonctionnalité Javascript destinée à gérer l’interaction sur un élément HTML selon le type d’action de l’utilisateur : clic, action au clavier, survol, etc."
    ]
  },
  {
    "title": "Qu’est que la langue de traitement d’une page Web ?",
    "objectifs": [
      "La langue dans laquelle sont rédigés par défaut les contenus de la page."
    ]
  },
  {
    "title": "Qu’est-ce qu’un lien d’accès rapide ?",
    "objectifs": [
      "Des liens placés en début de page, donnant accès aux zones de contenu, de menu ou de recherche."
    ]
  },
  {
    "title": "Qu’est-ce que la négociation de contenu ?",
    "objectifs": [
      "L’échange d’informations entre le client et le serveur via HTTP permettant de déterminer quel contenu répond aux attentes exprimées par l’utilisateur via le paramétrage de son navigateur."
    ]
  },
  {
    "title": "Qu’est qu’un objet inclus ?",
    "objectifs": [
      "Un contenu non HTML inclus dans une page Web, généralement via les éléments object, embed, applet."
    ]
  },
  {
    "title": "Qu’est-ce que le ratio de contraste ?",
    "objectifs": [
      "La mesure du niveau de contraste et de luminosité du texte par rapport à son arrière-plan."
    ]
  },
  {
    "title": "Je suis designer, chargé de créer les maquettes graphiques du futur site. On m’indique que les pages de thématiques incluent un flux RSS. De quoi s’agit-il ?",
    "objectifs": [
      "C’est la mise à disposition d’un fil d’actualités au format XML afin de permettre par exemple sa réutilisation par d’autres sites web. Concrètement, cela se traduit par une icône lien spécifique à prévoir dans le contenu de la page."
    ]
  },
  {
    "title": "Dans une boutique en ligne, l’exigence qualité à propos des produits indisponibles est :",
    "objectifs": [
      "De veiller à ce qu’ils fassent l’objet d’une différenciation visuelle et textuelle."
    ]
  },
  {
    "title": "Pour la réalisation d’un site présentant une collection de photographies, je dois :",
    "objectifs": [
      "Ne pas chercher à adapter la taille de la fenêtre du navigateur aux dimensions des images."
    ]
  },
  {
    "title": "Chaque demande d’information fait l’objet d’un accusé de réception permet d’indiquer à l’utilisateur que :",
    "objectifs": [
      "La demande d’information est bien parvenue à son destinataire."
    ]
  },
  {
    "title": "Cocher l’affirmation exacte à propos de la bonne pratique « Les informations sur la sécurité des transactions sont indiquées », du point de vue de l’utilisateur d’une boutique en ligne :",
    "objectifs": [
      "Pouvoir connaître le mode et le niveau de cryptage des données contribue à conforter ma confiance en ce service."
    ]
  },
  {
    "title": "Je suis responsable d’un site e-commerce. Les bonnes pratiques me permettent d’abord et avant tout :",
    "objectifs": [
      "De réduire les coûts cachés liés aux abandons de commande."
    ]
  },
  {
    "title": "Lorsqu’un site de e-commerce propose des offres spéciales et promotions, il est essentiel d’indiquer :",
    "objectifs": [
      "La période et les conditions de validité de cette promotion."
    ]
  },
  {
    "title": "Trois règles ci-dessous sont des bonnes pratiques qualité Opquast. Lesquelles ?",
    "objectifs": [
      "La navigation reste possible sur l’ensemble du site en utilisant exclusivement le clavier.",
      "Le serveur envoie les informations permettant la mise en cache des contenus.",
      "Les prix affichés mentionnent le détail des taxes et suppléments éventuels ainsi que le montant hors taxes."
    ]
  },
  {
    "title": "Pour quelles raisons le texte des documents PDF internes doit-il être sélectionnable ?",
    "objectifs": [
      "Afin d’éviter les PDF directement issus du scan d’un document papier, qui ne sont composés que d’images reproduisant le texte, non accessibles et dans lesquelles on ne peut pas faire une recherche de contenu.",
      "Cela permet de s’assurer que le contenu de ces PDF peut être référencé par les moteurs de recherche."
    ]
  },
  {
    "title": "Les bonnes pratiques Opquast sont universelles au sens où :",
    "objectifs": [
      "Elles sont neutres quant aux spécificités locales, par exemple les législations nationales."
    ]
  },
  {
    "title": "Cocher les 3 phrases exactes concernant les alternatives textuelles des images :",
    "objectifs": [
      "L’alternative textuelle d’une image permet l’affichage d’un texte pendant le chargement des images.",
      "L’alternative textuelle d’une image permet aux robots d’exploiter l’information véhiculée par les images.",
      "L’alternative textuelle d’une image permet aux utilisateurs placés dans des contextes où les images ne sont pas perceptibles (navigateur texte, lecteur d’écran, navigateur avec images désactivées) de comprendre le sens des images qu’ils ne peuvent voir."
    ]
  },
  {
    "title": "Le « V » de Visibilité dans le modèle VPTCS de la qualité Web correspond notamment :",
    "objectifs": [
      "À la communication concernant le site, par exemple à l’indication de l’URL du site sur les supports de communication de la société",
      "Au référencement du site (SEO).",
      "À la communication sur les contenus et services offert par le site via un compte Twitter."
    ]
  },
  {
    "title": "Les bonnes pratiques consacrées à la présentation permettent notamment de détecter les risques liés :",
    "objectifs": [
      "À des incohérences de la présentation sur l’ensemble des pages."
    ]
  },
  {
    "title": "Cocher les 2 phrases exactes concernant CSS :",
    "objectifs": [
      "Le format CSS permet de séparer le fond (la structure et le contenu) d’une page web de sa forme (sa mise en page).",
      "Le format CSS permet de décliner le rendu selon les medias de restitution."
    ]
  },
  {
    "title": "Pour l’utilisateur, le respect de la bonne pratique « La première occurrence d’une abréviation ou d’un acronyme dans le corps de chaque page donne accès à sa signification » a pour valeur ajoutée :",
    "objectifs": [
      "D’améliorer le référencement de cette information que je trouverai plus facilement via Google.",
      "De me permettre d’accéder rapidement à la signification d’un sigle."
    ]
  },
  {
    "title": "Je suis intégrateur Web (HTML CSS). Les bonnes pratiques me concernent-elles ?",
    "objectifs": [
      "Oui, en raison de mes décisions techniques lors de la création des gabarits de pages."
    ]
  },
  {
    "title": "Cochez les 4 critères requis pour l’acceptation d’une bonne pratique :",
    "objectifs": [
      "Être utile.",
      "Être consensuelle.",
      "Être réaliste.",
      "Être vérifiable."
    ]
  },
  {
    "title": "Pour l’utilisateur, est ce que le fait que « Le site s’ajoute automatiquement aux favoris (ou signets) de l’utilisateur » est utile ?",
    "objectifs": [
      "Non, c’est à moi de décider si je veux mettre une page en favori ou pas."
    ]
  },
  {
    "title": "Cocher les 3 phrases exactes concernant les titres de page :",
    "objectifs": [
      "Les titres de page doivent permettre aux utilisateurs d’identifier immédiatement le site dans les onglets, les favoris, dans la fenêtre du navigateur.",
      "Les titres de page doivent permettre aux utilisateurs d’identifier immédiatement le site dans les lecteurs d’écran.",
      "Les titres de page améliorent le référencement du site et sa présentation dans les moteurs de recherche."
    ]
  },
  {
    "title": "Pour l’utilisateur, le respect de la bonne pratique « Les dates sont présentées dans des formats explicites » a pour bénéfice :",
    "objectifs": [
      "De m’éviter les risques de méprise sur le sens d’une date."
    ]
  },
  {
    "title": "Le fondement de la démarche qualité Web opquast vise essentiellement :",
    "objectifs": [
      "La prévention des principaux risques de non qualité."
    ]
  },
  {
    "title": "Quel problème qualité majeur pose immédiatement ce formulaire ?",
    "objectifs": [
      "Les étiquettes des champs sont-elles visuellement associées à ceux-ci ?"
    ]
  },
  {
    "title": "Quelle question qualité majeure pose immédiatement ce formulaire ?",
    "objectifs": [
      "Les libellés soulignés sont-ils des liens ?"
    ]
  },
  {
    "title": "Quelle question qualité majeure pose immédiatement cette page ?",
    "objectifs": [
      "Quelle est la période de validité de la promotion ?"
    ]
  },
  {
    "title": "Quelle question qualité majeure pose immédiatement cette page ?",
    "objectifs": [
      "Tous les liens sont-ils explicites ?"
    ]
  },
  {
    "title": "Quel problème qualité majeur apparaît immédiatement dans cette fenêtre modale affichant une vue agrandie du produit ?",
    "objectifs": [
      "Un bouton de fermeture explicite est-il présent ?"
    ]
  },
  {
    "title": "Quel défaut qualité majeur présente immédiatement cette page de mentions légales ?",
    "objectifs": [
      "La gestion des liens externes vers le site."
    ]
  },
  {
    "title": "La [page d’erreur 404 visible ici](http://training-v2.certified.opquast.com/fr/wp-content/uploads/sites/3/pages/404.html) répond-elle aux exigences qualité Web ?",
    "objectifs": [
      "Non : il n’est pas possible de poursuivre la navigation sur le site."
    ]
  },
  {
    "title": "Quelle question qualité majeure pose immédiatement cette page produit ?",
    "objectifs": [
      "La période et les conditions de validité des offres spéciales et promotions sont-elles indiquées ?"
    ]
  },
  {
    "title": "Dans un mini-site simple ayant un nombre de pages très réduit (mini-site événementiel ou site-vitrine par exemple):",
    "objectifs": [
      "Le plan de site est nécessaire."
    ]
  },
  {
    "title": "La proposition « le site propose une application mobile équivalente » serait-elle admissible comme bonne pratique qualité ?",
    "objectifs": [
      "Non : ce n’est pas consensuel ; ce n’est pas universel ; ce n’est pas nécessairement utile."
    ]
  },
  {
    "title": "Pour le designer, les bonnes pratiques sur l’usage de la couleur et sur les contrastes, ce sont :",
    "objectifs": [
      "Des contraintes au sein desquels la créativité trouve d’autant plus à s’exprimer avec maîtrise."
    ]
  },
  {
    "title": "Cocher les 3 bonnes pratiques évaluables lors de la validation d’un wireframe (prototype) :",
    "objectifs": [
      "La modification de la quantité de chaque article, l’ajout et la suppression d’un ou plusieurs articles restent possibles avant la validation définitive de la commande.",
      "Une adresse de livraison différente de l’adresse de facturation peut être spécifiée.",
      "L’étape en cours d’un processus complexe est indiquée."
    ]
  },
  {
    "title": "Cocher les 3 bonnes pratiques évaluables lors de la validation éditoriale :",
    "objectifs": [
      "Le format des fichiers proposés en téléchargement est indiqué.",
      "Le site n’interdit pas la mise en place de liens entrants.",
      "Le titre de chaque page permet d’identifier son contenu."
    ]
  },
  {
    "title": "La bonne pratique « Le site est intégralement utilisable au clavier » vise :",
    "objectifs": [
      "Tous les sites, indépendamment du media, car elle permet de vérifier que la navigation ne dépend pas du périphérique utilisé"
    ]
  },
  {
    "title": "Je travaille au sein du service juridique de l’entreprise publiant le site. En matière de qualité Web :",
    "objectifs": [
      "Il est bon que je connaisse les bonnes pratiques, mais cela ne me dispense pas de vérifier les exigences légales."
    ]
  },
  {
    "title": "Pour l’utilisateur ou le propriétaire du site, quel est le principal objectif de la bonne pratique « les contenus sont présentés avec un contraste suffisant par rapport à leur arrière-plan » ?",
    "objectifs": [
      "Permettre une bonne lisibilité des contenus pour tous les utilisateurs, dans tous les contextes de consultation."
    ]
  },
  {
    "title": "En tant qu’utilisateur, à quoi peuvent me servir l’indication des coordonnées postales et téléphoniques de la représentation locale ou du siège social des sociétés et organisations propriétaires du site ?",
    "objectifs": [
      "À identifier l’entité responsable des contenus et des services."
    ]
  },
  {
    "title": "Responsable Qualité d’un site d’actualités, j’ai lu sur 01net.com que les sites à succès faisaient désormais du flat-design :",
    "objectifs": [
      "Les choix de mode en matière de design ne sont pas du ressort de la démarche qualité Opquast, dont les bonnes pratiques doivent être à la fois universelles et consensuelles."
    ]
  },
  {
    "title": "Une bonne pratique repose le plus souvent sur un test « unitaire », ce qui signifie :",
    "objectifs": [
      "Qu’elle vise un aspect précis de la qualité pouvant faire l’objet d’une vérification objective et spécifique."
    ]
  },
  {
    "title": "Si certaines bonnes pratiques qualité peuvent paraître relever de l’évidence, c’est parce que :",
    "objectifs": [
      "L’approche a pour objectif de se prémunir contre les risques les plus fréquents, qui peuvent correspondre à des erreurs triviales."
    ]
  },
  {
    "title": "Pour l’utilisateur d’une boutique en ligne, la bonne pratique « Le délai de livraison estimé est indiqué avant la validation définitive de la commande » a pour objectif :",
    "objectifs": [
      "D’identifier la date réelle à laquelle le bien commandé pourra être en ma possession."
    ]
  },
  {
    "title": "Laquelle de ces affirmations est exacte à propos de la notion de « handicap » :",
    "objectifs": [
      "Le handicap est la perte ou la restriction de participer à la vie de la collectivité à égalité avec les autres."
    ]
  },
  {
    "title": "Je décide de m’inscrire à une newsletter. Lorsque j’ai validé le formulaire d’inscription contenant mon adresse de courriel, le site doit :",
    "objectifs": [
      "Afficher une page m’informant qu’un mail de demande de confirmation a été envoyé à l’adresse que j’ai indiquée."
    ]
  },
  {
    "title": "Le référentiel des bonnes pratiques Opquast est d’abord et avant tout destiné :",
    "objectifs": [
      "À la mesure des risques de non-qualité et à l’amélioration continue."
    ]
  },
  {
    "title": "Je suis responsable d’un site exclusivement en langue française. Pour moi, les bonnes pratiques d’internationalisation :",
    "objectifs": [
      "Peuvent tout de même être applicables et utiles."
    ]
  },
  {
    "title": "Cocher les 2 phrases exactes concernant la métadonnée indiquant le jeu de caractères dans le code HTML de la page :",
    "objectifs": [
      "L’indication de la métadonnée sur le jeu de caractères prévient le risque de problèmes d’affichage de caractères lié à un fonctionnement parfois hasardeux des mécanismes de rattrapage des navigateurs quand ils ne disposent pas de l’information nécessaire via l’en-tête HTTP content-type.",
      "L’indication de la métadonnée sur le jeu de caractères permet un affichage hors-ligne correct des pages."
    ]
  },
  {
    "title": "Cocher les 4 objectifs majeurs des bonnes pratiques e-commerce :",
    "objectifs": [
      "d’anticiper le besoin d’information prévisible de l’utilisateur.",
      "de donner à l’utilisateur le contrôle du processus de commande.",
      "de lever les freins à la validation de la commande.",
      "de favoriser la relation de confiance avec l’utilisateur."
    ]
  },
  {
    "title": "En tant que propriétaire d’une boutique en ligne, le respect de la bonne pratique « Le site accepte au moins deux moyens de paiement » me permet :",
    "objectifs": [
      "De proposer aux utilisateurs de choisir le mode de paiement qui leur convient le mieux dans leur contexte."
    ]
  },
  {
    "title": "Je suis designer Web : les bonnes pratiques me concernent-elles ?",
    "objectifs": [
      "Oui : je dois veiller d’une part à éviter certaines erreurs proprement graphiques et mes choix ont d’autre part des conséquences sur la réalisation technique lors de l’intégration."
    ]
  },
  {
    "title": "Je suis un lecteur assidu de la presse en ligne. Avec l’âge, j’ai besoin de pouvoir lire en gros caractères :",
    "objectifs": [
      "Les bonnes pratiques me garantissent la possibilité de pouvoir agrandire la taille du texte des pages que je consulte."
    ]
  },
  {
    "title": "Concepteur d’un nouveau service en ligne, je vais parier sur les effets de ruptures avec les usages et séduire en étant inhabituel :",
    "objectifs": [
      "Une large part des bonnes pratiques sont applicables dans mon cas comme pour tout autre type de projet, même si je choisis d’en ignorer certaines en connaissance de cause."
    ]
  },
  {
    "title": "Pour le référenceur (SEO), les bonnes pratiques sur l’usage du balisage HTML (métadonnée description, titres de section, titre de page, alternatives textuelles) :",
    "objectifs": [
      "Correspondent aux bases du référencement naturel."
    ]
  },
  {
    "title": "La proposition de bonne pratique « le site affiche pour chaque page un bouton Ajouter aux favoris » est-elle utile ?",
    "objectifs": [
      "Non, c’est un doublon d’une fonction native des navigateurs, bien connue des utilisateurs : il est possible de la dupliquer dans l’interface du site, mais ce n’est pas nécessaire."
    ]
  },
  {
    "title": "Dans quel cas la bonne pratique « le site fournit aux utilisateurs la possibilité de connaître les nouveaux contenus ou services » est-elle utile ?",
    "objectifs": [
      "Quels que soient les contenus ou les services : pouvoir être aisément au courant des nouveautés est une attente courante des utilisateurs."
    ]
  },
  {
    "title": "La bonne pratique « Le site propose un fichier sitemap indiquant les contenus à explorer » vise :",
    "objectifs": [
      "Le référencement du site.",
      "La pertinence du contenu du fichier sitemap.xml.",
      "La présence du fichier sitemap.xml."
    ]
  },
  {
    "title": "Cocher les 3 phrases exactes concernant les publicités et contenus sponsorisés :",
    "objectifs": [
      "L’identification des publicités et contenus sponsorisés évite les confusions entre contenus rédactionnels et publicitaires.",
      "L’identification des publicités et contenus sponsorisés permet leur identification immédiate.",
      "L’identification des publicités et contenus sponsorisés prévient les risques associés aux conflits d’intérêt."
    ]
  },
  {
    "title": "Cocher les 2 phrases exactes concernant l’indication des délais de réponse aux demandes d’information :",
    "objectifs": [
      "Indiquer le délai de réponse aux demandes d’information permet de rassurer sur la capacité à prendre en compte les demandes.",
      "Indiquer le délai de réponse aux demandes d’information permet de limiter les risques de relance de la part des utilisateurs."
    ]
  },
  {
    "title": "Le « C » de Contenus dans le modèle VPTCS de la qualité Web correspond notamment :",
    "objectifs": [
      "À la rédaction.",
      "À l’orthographe."
    ]
  },
  {
    "title": "Cocher la définition correcte d’un template :",
    "objectifs": [
      "Les templates permettent de mutualiser la gestion de la structure des pages."
    ]
  },
  {
    "title": "Pour l’utilisateur, lorsqu’un site applique le même style (couleur, graisse, soulignement, etc.) aux liens visités et non visités :",
    "objectifs": [
      "C’est une mauvaise pratique qui gêne l’utilisateur privé d’un repère visuel précieux lors de l’exploration du site."
    ]
  },
  {
    "title": "Laquelle de ces affirmations est exacte à propos de la notion de htaccess :",
    "objectifs": [
      "C’est un fichier de configuration des serveurs web Apache qui permet en particulier de définir les droits d’accès, les pages d’erreurs personnalisées et les redirections."
    ]
  },
  {
    "title": "Laquelle de ces affirmations est exacte à propos de la notion d’Ajax :",
    "objectifs": [
      "Ajax désigne une utilisation de Javascript permettant d’optimiser la gestion des contenus dynamiques en limitant les échanges client/serveur à la seule partie concernée de la page et en évitant son rechargement complet à chaque interaction."
    ]
  },
  {
    "title": "Qu’est-ce que les espaces publics d’un site Web ?",
    "objectifs": [
      "Les contenus dont la rédaction et la publication (immédiate ou bien modérée et différée) sont ouvertes aux visiteurs du site (commentaires, forum, wiki, etc.)."
    ]
  },
  {
    "title": "Qu’est-ce qu’une icône de navigation ?",
    "objectifs": [
      "C’est une image-lien de taille réduite dont le graphisme (généralement simplifié) représente une fonctionnalité de navigation dans le site : retour à l’accueil, accès au plan de site, accès à la rubrique parente ou à l’élément précédent, etc."
    ]
  },
  {
    "title": "Qu’est-ce que la racine du site ?",
    "objectifs": [
      "Un répertoire physique sur le serveur directement accessible à partir de l’URL du domaine. Par exemple, le répertoire correspondant à http://example.org/"
    ]
  },
  {
    "title": "Une bonne pratique qualité Web doit être avant tout :",
    "objectifs": [
      "Utile.",
      "Réaliste."
    ]
  },
  {
    "title": "Pour être utile, une démarche qualité doit :",
    "objectifs": [
      "Être menée en continu depuis le démarrage du processus de conception jusqu’au fil de la vie du site."
    ]
  },
  {
    "title": "Le « P » de Perception dans le modèle VPTCS de la qualité Web correspond notamment :",
    "objectifs": [
      "À la cohérence de la charte graphique sur l’ensemble des pages du site.",
      "À la qualité de contraste et de lisibilité des pages du site sur un écran dans des conditions diverses."
    ]
  },
  {
    "title": "Le « T » de Technique dans le modèle VPTCS de la qualité Web correspond notamment :",
    "objectifs": [
      "À l’utilisation correcte du balisage HTML.",
      "Au paramétrage serveur nécessaire pour optimiser la compression des données envoyées au navigateur, afin d’optimiser le temps de chargement des pages et de réduire les coûts de bande passante.",
      "À la gestion des certificats de sécurité."
    ]
  },
  {
    "title": "Le « S » de Services dans le modèle VPTCS de la qualité Web correspond notamment :",
    "objectifs": [
      "Au déroulement du processus de commande dans un site e-commerce.",
      "À la gestion de la logistique d’expédition des produits matériels dans le cas d’une boutique en ligne."
    ]
  },
  {
    "title": "La bonne pratique « Les processus complexes sont accompagnés de la liste de leurs étapes »est utile pour :",
    "objectifs": [
      "Informer l’utilisateur sur ce qui va se passer par la suite.",
      "Donner à l’utilisateur une idée du temps que vont lui prendre les opérations à venir."
    ]
  },
  {
    "title": "Les produits indisponibles doivent faire l’objet d’une différenciation visuelle ou textuelle de façon à :",
    "objectifs": [
      "Informer immédiatement l’utilisateur sur les produits non disponibles et éviter les déceptions ultérieures."
    ]
  },
  {
    "title": "Les prix affichés mentionnent le détail des taxes et suppléments éventuels ainsi que le montant hors taxes parce que :",
    "objectifs": [
      "L’utilisateur peut avoir besoin de ces informations pour prendre sa décision de commander ou non."
    ]
  },
  {
    "title": "Lorsqu’un protoype prévoit la présence d’un tooltip, il s’agit :",
    "objectifs": [
      "D’une information affichée en surimpression de la page, le plus souvent lors du survol d’un contenu."
    ]
  },
  {
    "title": "Lorsqu’un développeur parle du cache navigateur, il s’agit :",
    "objectifs": [
      "D’une fonctionnalité des navigateurs web leur permettant de conserver localement l’enregistrement des ressources d’une page web (images, scripts, etc.) afin de ne pas avoir à les télécharger de nouveau quand elles sont utilisées une seconde fois."
    ]
  },
  {
    "title": "Pour le propriétaire d’un site, le déclenchement automatique des sons, vidéos et animations au chargement de la page Web :",
    "objectifs": [
      "Est une pratique à proscrire : il faut laisser à l’utilisateur le contrôle de l’interface sonore et visuelle lors de la consultation du site, et ne pas le surprendre avec la diffusion inattendue d’un contenu audio."
    ]
  },
  {
    "title": "Pour un utilisateur d’une boutique en ligne, la bonne pratique « La disponibilité des produits est indiquée avant la validation définitive de la commande » a pour objectif :",
    "objectifs": [
      "D’anticiper d’éventuelles difficultés et une augmentation du délai de livraison."
    ]
  },
  {
    "title": "En tant que propriétaire d’une boutique en ligne, est-ce que la bonne pratique « les moyens de paiement acceptés et les procédures correspondantes sont indiqués » m’est-elle utile ?",
    "objectifs": [
      "Oui : j’éviterai d’éventuelles déceptions des utilisateurs au moment de finaliser la commande."
    ]
  },
  {
    "title": "En ce qui concerne les conditions générales de vente d’une boutique en ligne :",
    "objectifs": [
      "L’utilisateur doit pouvoir les consulter les conditions générales de vente à tout moment, avant, pendant ou après la commande."
    ]
  },
  {
    "title": "Cocher les 3 affirmations correspondant à un effet significatif des CMS sur la qualité Web :",
    "objectifs": [
      "Délégation technique",
      "Séparation des métiers",
      "Industrialisation"
    ]
  },
  {
    "title": "La règle suivante « Les recours en cas de litige sont indiqués dans les conditions générales de vente ou d’utilisation » :",
    "objectifs": [
      "Est une bonne pratique Opquast parce qu’elle contribue à rassurer l’internaute avant l’achat."
    ]
  },
  {
    "title": "La bonne pratique « Les champs de formulaires doivent être associés visuellement à leurs étiquettes » est essentielle pour :",
    "objectifs": [
      "Les mal-voyants qui naviguent avec un zoom d’écran ainsi que les utilisateurs de tablettes ou de mobiles qui recourent à un fort agrandissement."
    ]
  },
  {
    "title": "L’ergonome a notamment pour rôle :",
    "objectifs": [
      "De vérifier l’adéquation de l’interface et des conditions d’utilisation aux besoins et capacités de ses utilisateurs."
    ]
  },
  {
    "title": "Cocher les phrases exactes concernant le nombre de moyens de contact :",
    "objectifs": [
      "Offrir plusieurs moyens de contact favorise la confiance en garantissant d’entrée de jeu à l’utilisateur la possibilité d’un recours en cas de difficultés.",
      "Offrir plusieurs moyens de contact permet d’éviter de mettre l’utilisateur en difficulté en cas d’indisponibilité ou de problèmes d’utilisation.",
      "Offrir plusieurs moyens de contact permet d’optimiser les possibilités de retour d’information de la part des utilisateurs."
    ]
  },
  {
    "title": "Je suis expert SEO (référencement) : les bonnes pratiques me concernent-elles ?",
    "objectifs": [
      "Oui : différentes bonnes pratiques relèvent des bases du référencement naturel et doivent être prises en compte le plus tôt possible dans le projet"
    ]
  },
  {
    "title": "Pour l’utilisateur, la bonne pratique « la soumission d’un formulaire est suivie d’un message indiquant la réussite ou non de l’action souhaitée » a une valeur ajoutée ?",
    "objectifs": [
      "Oui, car je saurai dans tous les cas quel est le résultat de mon action (succès ou échec, etc.)"
    ]
  },
  {
    "title": "Cocher les qualificatifs et expressions qui caractérisent la démarche de qualité Web :",
    "objectifs": [
      "Transformation d’exigences génériques en critères objectifs.",
      "Approche transversale à travers les différents métiers",
      "Exigences mesurables."
    ]
  },
  {
    "title": "Cocher les 2 phrases qui expliquent pourquoi certaines bonnes pratiques ne peuvent pas être testées automatiquement :",
    "objectifs": [
      "Seules la présence d’éléments de code HTML est vérifiable automatiquement.",
      "Un robot logiciel ne peut pas évaluer des questions de pertinence d’un contenu textuel."
    ]
  },
  {
    "title": "L’affirmation « le site ne comporte pas de publicités »:",
    "objectifs": [
      "N’est pas une bonne pratique (ce ne serait ni utile ni consensuel ni réaliste)."
    ]
  },
  {
    "title": "Cocher les 2 spécifications émises par la WAI :",
    "objectifs": [
      "Accessible Rich Internet Applications 1.0 (ARIA)",
      "Web Content Accessibility Guidelines 2.0 (WCAG)"
    ]
  },
  {
    "title": "Cocher la définition correcte d’une page d’erreur 404 :",
    "objectifs": [
      "Page web envoyée à l’utilisateur en réponse à une requête entraînant une erreur du type «Ressource non trouvée»."
    ]
  },
  {
    "title": "Cocher les 3 spécifications émises par le W3C :",
    "objectifs": [
      "HTML 5, A vocabulary and associated APIs for HTML and XHTML",
      "Cascading Style Sheets Level 2 Revision 1 (CSS 2.1) Specification",
      "Web Content Accessibility Guidelines (WCAG)"
    ]
  },
  {
    "title": "Le T de « Technique » dans le modèle VPTCS de la qualité Web correspond notamment (3 réponses) :",
    "objectifs": [
      "HTML 5, A vocabulary and associated APIs for HTML and XHTML",
      "Cascading Style Sheets Level 2 Revision 1 (CSS 2.1) Specification",
      "Web Content Accessibility Guidelines (WCAG)"
    ]
  },
  {
    "title": "Cocher l’étape du processus de conception où devra en priorité être prise en compte la bonne pratique « Le contenu de chaque page est organisé selon une structure de titres et sous-titres hiérarchisée. » :",
    "objectifs": [
      "Conception des intégrations HTML CSS"
    ]
  },
  {
    "title": "Cocher les 2 expressions correspondant à l’enjeu du prototypage sur la qualité Web :",
    "objectifs": [
      "Le prototypage permet d’anticiper des risques liés aux choix de zonage et de fonctionnalités qui devront être pris en compte dans la suite de la conception.",
      "Le prototypage permet de s’assurer que tous les éléments requis par les critères Opquast seront présents dans la page."
    ]
  },
  {
    "title": "Cocher la phrase exacte à propos du RGAA :",
    "objectifs": [
      "Le prototypage permet d’anticiper des risques liés aux choix de zonage et de fonctionnalités qui devront être pris en compte dans la suite de la conception.",
      "Le prototypage permet de s’assurer que tous les éléments requis par les critères Opquast seront présents dans la page."
    ]
  },
  {
    "title": "Cocher la phrase exacte à propos de la notion de linéarisation :",
    "objectifs": [
      "Résultat du rendu final d’une page web, non pas dans l’ordre apparent que l’utilisateur peut déduire de son affichage CSS à l’écran, mais dans l’ordre réel où les contenus qui la composent se trouvent dans son code source."
    ]
  },
  {
    "title": "Cocher les 2 phrases exactes concernant les publicités et contenus sponsorisés :",
    "objectifs": [
      "L’identification des publicités et contenus sponsorisés évite les confusions entre contenus rédactionnels et publicitaires.",
      "L’identification des publicités et contenus sponsorisés prémunit contre les risques associés aux conflits d’intérêt (par exemple, dans le cas des publireportages)"
    ]
  },
  {
    "title": "Cocher les 2 bonnes pratiques évaluables lors de la validation d’un wireframe (prototype) :",
    "objectifs": [
      "L’étape en cours d’un processus complexe est indiquée.",
      "La modification de la quantité de chaque article, l’ajout et la suppression d’un ou plusieurs articles restent possibles avant la validation définitive de la commande."
    ]
  },
  {
    "title": "Cocher les 2 phrases décrivant le rôle de l’ergonome :",
    "objectifs": [
      "Il vérifie l’adéquation de l’interface et des conditions d’utilisation aux besoins et capacités de ses utilisateurs.",
      "Il définit, caractérise, et modélise les différents types d’utilisateurs et leurs enjeux."
    ]
  },
  {
    "title": "En tant qu’utilisateur, lorsque j’arrive sur une page d’erreur personnalisée (par exemple, une erreur 404) où figure le menu principal de navigation :",
    "objectifs": [
      "Cela me permet de reprendre la navigation directement."
    ]
  },
  {
    "title": "Cocher la définition correcte du terme Minification :",
    "objectifs": [
      "Réduction de la taille des fichiers textes de type CSS et javascript, obtenue par la suppression des commentaires et la réduction a minima de la syntaxe"
    ]
  },
  {
    "title": "En tant qu’utilisateur d’une boutique en ligne, la bonne pratique « Le délai de livraison estimé est indiqué avant la validation définitive de la commande » me permet :",
    "objectifs": [
      "D’identifier la date réelle à laquelle le bien commandé pourra être en ma possession."
    ]
  },
  {
    "title": "Cocher les 2 bonnes pratiques évaluables lors de la validation d’une maquette graphique :",
    "objectifs": [
      "Chaque étiquette de formulaire est visuellement rattachée au champ qu’elle décrit.",
      "Les contenus sont présentés avec un contraste suffisant par rapport à leur arrière-plan."
    ]
  },
  {
    "title": "Cocher la description du maquettage graphique :",
    "objectifs": [
      "Fournit le design des pages types du site."
    ]
  },
  {
    "title": "Cocher la phrase exacte en matière de contrôle qualité dans le processus de développement :",
    "objectifs": [
      "Le contrôle qualité intervient tout au long du processus de conception du site, de la définition du cahier des charges jusqu’à la mise en production, et se poursuit de manière continue après celle-ci lors de la publication de nouveaux contenus."
    ]
  },
  {
    "title": "Cocher la phrase indiquant ce que favorise l’application des bonnes pratiques qualité sur un site :",
    "objectifs": [
      "La présence d’informations, à destination des utilisateurs, sur l’identification du responsable du site."
    ]
  },
  {
    "title": "Cocher l’affirmation exacte à propos de la bonne pratique « Les informations sur la sécurité des transactions sont indiquées« , du point de vue de l’utilisateur d’une boutique en ligne :",
    "objectifs": [
      "Cela contribue à conforter ma confiance en ce service."
    ]
  },
  {
    "title": "Un contenu en mouvement (3 réponses justes) :",
    "objectifs": [
      "Peut être bloquant pour des utilisateurs ayant besoin de plus de temps que la moyenne pour lire. Il doit donc pouvoir être mis en pause.",
      "Peut être utilisé (sans possibilité de l’interrompre) s’il est suffisamment bref (5 secondes au plus) et si la totalité de l’information est disponible une fois qu’il est arrêté.",
      "Peut constituer une gêne pour des utilisateurs ayant des difficultés de concentration et doit donc pouvoir être mis en pause."
    ]
  },
  {
    "title": "La bonne pratique concernant la présence des coordonnées postales et téléphoniques peut être principalement justifiée par (2 réponses justes) :",
    "objectifs": [
      "L’amélioration de la confiance de l’usager envers le service à travers la matérialisation d’une existence physique réelle des auteurs du site.",
      "La mise à disposition d’un moyen de contact alternatif."
    ]
  },
  {
    "title": "Les bonnes pratiques qualité (2 réponses justes) :",
    "objectifs": [
      "Servent à prévenir les risques d’incompréhension ou d’imprécision",
      "Servent à consolider un cahier des charges."
    ]
  },
  {
    "title": "Les bonnes pratiques qualité concernant l’Internationalisation ont pour principaux objectifs (2 réponses justes) :",
    "objectifs": [
      "De faciliter l’accès rapide aux contenus dans la langue correspondant aux préférences de l’utilisateur.",
      "De permettre un rendu approprié par les outils de synthèse vocale."
    ]
  },
  {
    "title": "Les bonnes pratiques sur le balisage HTML des contenus nécessitent de se pencher sur l’usage (3 réponses justes) :",
    "objectifs": [
      "Des balises identifiant les titres de section.",
      "Des balises identifiant les listes.",
      "Des balises identifiant les sigles, acronymes et abréviations."
    ]
  },
  {
    "title": "La proposition « Il est préférable d’éviter un trop grand nombre de clic » :",
    "objectifs": [
      "N’est pas recevable comme bonne pratique car ce n’est pas mesurable et donc pas vérifiable objectivement."
    ]
  },
  {
    "title": "Afin de prévenir les risques de non qualité, le cahier des charges doit être établi :",
    "objectifs": [
      "En déterminant le public cible, les contenus et services proposés ainsi que leur organisation et leur processus de production, les exigences fonctionnelles et enfin les exigences qualité majeures qui en découlent."
    ]
  },
  {
    "title": "Choisir l’affirmation exacte sur le rôle des bonnes pratiques pendant la rédaction du cahier des charges :",
    "objectifs": [
      "Les bonnes pratiques viennent consolider les exigences et attentes concernant le projet."
    ]
  },
  {
    "title": "Lorsqu’un site de e-commerce propose des offres spéciales et promotions, il est essentiel d’indiquer :",
    "objectifs": [
      "La période et les conditions de validité de la promotion ou de l’offre spéciale."
    ]
  },
  {
    "title": "La bonne pratique qui indique que « Chaque demande d’information fait l’objet d’un accusé de réception » nécessite :",
    "objectifs": [
      "La mise en place d’un mail automatiquement envoyé à l’expéditeur de la demande."
    ]
  },
  {
    "title": "Sur un site, les hyperliens ne sont visuellement différenciés du contenu qu’au survol à la souris. Faut-il rendre les liens visibles directement ?",
    "objectifs": [
      "Oui, car dans le cas contraire, les utilisateurs d’écran tactiles doivent toucher différents endroits leur écran pour trouver où sont les liens."
    ]
  },
  {
    "title": "Si vous proposez un numéro de téléphone spécial ou surtaxé, ou l’adresse physique d’un magasin, il est essentiel d’indiquer (3 réponses justes) :",
    "objectifs": [
      "Un moyen de contact alternatif.",
      "L’identité du responsable du magasin ou de l’établissement.",
      "Le tarif des appels vers le numéro de téléphone."
    ]
  },
  {
    "title": "À l’issue de la phase d’intégration, les livrables sont :",
    "objectifs": [
      "Les templates (gabarits) des  différents types de pages"
    ]
  },
  {
    "title": "Cocher les 2 bonnes pratiques évaluables lors de la validation d’un wireframe (prototype) (2 réponses justes) :",
    "objectifs": [
      "Les processus complexes sont accompagnés de la liste de leurs étapes.",
      "Chaque page affiche une information permettant de connaître son emplacement dans l’arborescence du site."
    ]
  },
  {
    "title": "Afin de renforcer l’impact visuel d’une accroche textuelle :",
    "objectifs": [
      "Je vais recourir à une mise en majuscule du texte via la propriété CSS correspondante."
    ]
  },
  {
    "id": "3961",
    "title": "Afin de prévenir les risques de non qualité, le cahier des charges doit être établi :",
    "objectifs": [
      "En déterminant le public cible, les contenus et services proposés ainsi que leur organisation et leur processus de production, les exigences fonctionnelles et enfin les exigences qualité majeures qui en découlent."
    ]
  },
  {
    "title": "Le CMS (système de gestion de contenus) peut avoir avoir un impact sur :",
    "objectifs": [
      "L’ensemble des bonnes pratiques.",
      "Les bonnes pratiques concernant la qualité du design et des intégrations."
    ]
  },
  {
    "title": "Qu’est-ce qu’un whois ?",
    "objectifs": [
      "Un service d’information sur les domaines web et leurs détenteurs."
    ]
  },
  {
    "title": "La proposition « Il est préférable d’éviter un trop grand nombre de clic » :",
    "objectifs": [
      "N’est pas recevable comme bonne pratique car ce n’est pas mesurable et donc pas vérifiable objectivement."
    ]
  },
  {
    "title": "Quelle est la valeur ajoutée de la bonne pratique « les vignettes ne sont pas des images de taille supérieure redimensionnées côté client » (1 réponse juste) ?",
    "objectifs": [
      "Aucune, ce n’est pas une bonne pratique du référentiel Opquast V3."
    ]
  }
]